{
    "web": {
        "https://www.hellokpop.com/featured/kdramas-on-viu-may-2022/": {
            "title": "7 K-Dramas On Viu To Watch This May 2022",
            "content": "Interestingly, both Korean dramas focus on two fascinating female leads. Fans of award-winning American telenovela Jane the Virgin will be happy to hear that Korean remake, Viu Original series Woori the Virgin, will be streaming soon! In addition, Seo Ye Ji is making her comeback drama in Eve as Lee Ra-el, a charming and intelligent woman with a hidden agenda, who is at the center of a 2 trillion-won divorce scandal that has shocked the entire nation. Continue with the action-packed Viu Original Again My Life, as Lee Joon-gi makes use of the second shot he has at life to uphold justice. Another must-watch is fantasy drama From Now On, Showtime!, as ratings soar amidst its second episode. It’s a formidable match, as popular magician Cha Cha-woong (Park Hae-jin), who can summon ghosts, and passionate police constable Go Seul-hae (Jin Ki-joo), who has supernatural powers, team up to fight crime. Delve deep into the world of entertainment with Sh**ting Stars, casting the spotlight on one celebrity agent, Oh Han-byeol (Lee Sung-kyung), and the star she’s tasked with presenting in the best possible light – Gong Tae-sung (Kim Young-dae). With The Killer’s Shopping List, and Monstrous also making their respective launches; K-Drama fans are surely up for a busy schedule. Don’t miss these exciting new K-Dramas on Viu this May! PR Source: Viu How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/netflix-rolls-out-new-teasers-for-money-heist-korea-joint-economic-area-part-1/": {
            "title": "Netflix Rolls Out New Teasers For “Money Heist: Korea – Joint Economic Area Part 1” + Announces Premiere",
            "content": "With the setting of the two Koreas creating a joint economic area, Money Heist: Korea – Joint Economic Area Part 1 is set to premiere on June 24 with six episodes packed with action and scale. Here is a peek into what this version of the world’s ‘biggest heist’ has in store, as revealed through the teaser poster and teaser trailer!  The new poster finally reveals the mask that will veil the thieves’ identities, which is also the key aesthetic of the series.  Previously, the released teaser showed the Professor contemplating a selection of masks including the original iconic Dali mask. Just before we got to see which one he selects, the trailer ended, igniting excitement and curiosity among fans. The question is finally answered in the poster revealed along with the premiere date, which shows the Korean traditional Hahoe Mask – a face with a big empty smile. However, the bloodstains scattered on one side of the white mask raises yet another question, foreshadowing that this heist will also entail life-threatening overturns. La Casa de Papel, which has captured global viewers’ hearts and created a devoted fandom, is now reborn in Korea – with a different setting in the Joint Economic Area, where the Korean Peninsula faces reunification. This adaptation has already created excitement with its formidable cast to play the characters from the original series: Professor (Yoo Ji Tae), Berlin (Park Hae Soo), Tokyo (Jeon Jong Seo), Moscow (Lee Won Jong), Denver (Kim Ji Hoon, Nairobi (Jang Yoon Ju), Rio (Lee Hyun Woo), Helsinki (Kim Ji Hoon), and Oslo (Lee Kyu Ho). The first Korean blockbuster to kick off the second half of the year, Money Heist: Korea – Joint Economic Area Part 1 will be released on June 24th, only on Netflix. Meet The Korean Cast Of “La Casa de Papel”  PR Source: Netflix  How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/yumis-cells-2-teaser-poster/": {
            "title": "Kim Go Eun Radiates In Pink For “Yumi’s Cells 2” Teaser Poster",
            "content": "TVING brings back the audience inside Kim Yu Mi’s mind again after confirming a prequel for Yumi’s Cells 2. Kim Go Eun also returns as Kim Yumi with her adorable cells.  Yumi’s Cells is based on an original webtoon story created by Donggeon Lee. It was given life by TVING and directed by Director Lee Sang Yeob. His recent dramas include A Piece Of Your Mind, My Holo Love, and Shopping King Louie to name a few.   The mixed 3D animated and live-action series follows the heartbreak of Kim Yu Mi (Kim Go Eun) which led her love cells to fall into a deep coma. She then meets an emotionally stunted game developer, Goo Woong (Ahn Bo Hyun).  A spark between their two love cells unexpectedly helped them to learn to love again and express their feelings. In the second season, Yumi and her cells will find themselves standing at the boundary between love and dreams.  The recent poster for Yumi’s Cells 2 has a similar layout to the first season. Keeping her iconic bangs, Kim Go Eun elevates the look with a longer hair length. Different notes are still pinned on the poster and the pink and blue color palette from the first design made the prequel’s poster more adorable. Yumi’s Cells 2 will be back in June on TVING Source: Xports News   How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/welcome-to-wedding-hell-teaser-photos/": {
            "title": "Lee Jin Wook Is Adorably Attracted To Lee Yeon Hee In “Welcome To Wedding Hell” New Teasers",
            "content": "Lee Jin Wook plays a marriage idealist and soon-to-be-groom, Seo Jun-hyung. He is an optimistic man who is very smitten with his fiancée.   Lee Yeon Hee plays Kim Na Eun, a soon-to-be wife full of joy and affection. She has a harmonious relationship with her fiancé and got a decent job in a large company that everyone is envious of. A savvy realist, she thinks a rational choice is always the best. Capturing the first meeting of Jun-hyung and Na-eun in the latest stills; the love pairing evokes warmth and romance. Obviously, the attraction is evident. His melting gaze disarms her effortlessly. Jun-hyung and Na-eun, who promised to get married after two years of dating, experienced the usual honeymoon stage of a relationship. They thought it would be an easy fairy tale with ever-after and all. However, as the two prepare for marriage, they confront conflicts during the wedding preparations, ceremony, and finding a new home. After going through various episodes that prospective couples may have thought about at least once, it is curious whether they will be able to safely enter the wedding hall. Welcome To Wedding Hell will be released through Kakao TV in May. International fans can watch it on Netflix.  ource: Sports Donga How does this story make you feel? "
        },
        "https://www.hellokpop.com/event/korean-rapper-camo-to-greet-fans-with-camo-wifey-tour/": {
            "title": "Korean Rapper CAMO To Greet Fans With “CAMO: WIFEY TOUR”",
            "content": "Korean rapper, CAMO, will soon greet fans through tour dates in Canada and America as part of her CAMO: WIFEY TOUR. The tour kicks off on May 12 in Vancouver at the Vancouver Playhouse, followed by a show in Calgary at the MacEwan Ballroom on May 13, and her last Canadian stop in Toronto at the Axis Club on May 17. Subsequently, CAMO will perform at her American tour stop in New York on May 21 at the Mission Nightclub.  Though born and raised in Hong Kong, CAMO moved to Korea in her early teens. Since then, she has fostered an impressive career as a rising rapper in the K-music space. The artist first debuted on March 10, 2020, with her EP ICE. Her second single, “Wifey”, featured South Korean rapper, Simon Dominic. CAMO has also collaborated with the likes of BIBI, Coogie, and JMIN, among others. Impressing listeners with her charismatic vocals, pointed lyricism, and trendy melodies, CAMO demanded attention from both domestic and overseas fans. Meanwhile, her latest release “FREAK LIKE ME (Prod. Dayrick)” sees CAMO reinforce her blunt songwriting and confident appeal. The suave track boasts CAMO’s self-assured boldness while its music video follows the artist across Europe and into crowds of her loyal fans. As of writing, the music video exceeds 1.2 million views and continues to soar since its release at the beginning of the year.  Her latest tour is yet another testament to CAMO’s global growth. Tickets for her Canadian dates can be purchased at modo-live.com. Additionally, tickets for her New York concert can be purchased at Mission Nightclub’s eventbrite page. PR Source: Unbound Entertainment Group Image and Video Source: 502 | Unbound Entertainment Group | MODO LIVE & Homestand How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/rosa-mansion-yoonkyun-sang-character-introduction/": {
            "title": "“Rose Mansion” Introduces Yoon Kyun Sang’s Latest Character",
            "content": "Portraying a detective role for Rose Mansion, the actor elevates his charisma for his new role. Yoon plays the pivotal role of Min-su, where he will help the investigation of Jin-na’s (Lim Ji Yeon) missing sister. Known for being a reliable and friendly detective, Min Soo also hides a dark secret that the series will unveil soon. From TVING’s recent posted still cuts of the actor, he has already shown three different emotions that escalate anticipation for his performance. The first still portrays the gentle and bubbly side of Min-su as he works in the police station.  On the other hand, he easily shifts emotion into the charismatic and quiet character of Detective Min-su while reading investigation papers.  Lastly, TVING shares a glimpse of Min-su in an on-field investigation and seems to be aggravated, raising the curiosity about what happened on the scene. Don’t miss Yoon Kyun Sang in his comeback drama when Rose Mansion premieres on May 13! Source: Sports Donga How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/the-sound-of-magic-characters/": {
            "title": "“The Sound of Magic” Acquaints Viewers With Lead Characters",
            "content": "In The Sound of Magic, a magician living in an abandoned theme park makes troubles disappear, and hope reappears, for a disenchanted teen enduring harsh realities.  Vaunting striking character posters, the dreamlike feel and phrases on the posters draw curiosity about the stories of the lead trio. The magician Ri-eul, who stares at someone as if casting a spell, and the blue butterfly flying next to him create a fascinating look. It further heightens the anticipation of the magical moment that he will create. Next, Yoon Ah-yi, who wants to run away from the harsh reality and become an adult, tries to turn away from Ri-eul, who claims to be a real magician. In a moment of crisis, she wants to believe in him as he gave her comfort that no one has ever given. Lastly, Na Il-deung represents the face of conflicting youth. Forced toward a goal by his parents, he decides to discover what he truly wants. The Sound of Magic will be released on May 6. Stay tuned for our press conference coverage on May 3. Source: Netflix   How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/highlight-live-2022-intro-concert/": {
            "title": "HIGHLIGHT Proves Unchanging Power With Sold-Out Tickets For Upcoming Concert",
            "content": "Yes, you read it right. All offline and online concert tickets are out of stock after opening ticket reservations on April 28. HIGHLIGHT LIVE 2022 [INTRO] is the first solo concert held in three years and six months since HIGHLIGHT LIVE 2018 [OUTRO] in November 2018. Notably, HIGHLIGHT proved its unchanging and strong ticket power with the ticket sales turnout following the fan club pre-sale on the 25th and the general reservation on the 28th. Through this concert, the group is expected to spend a meaningful time communicating closely with fans after a long time.  HIGHLIGHT who has a number of hit songs looks forward to bringing joy through their music by showing seasoned stage manners and strong team chemistry like an idol group in their 14th year of debut. In particular, they plan to meet more global fans by broadcasting the concert online through the Idol Live app on the 22nd, the last day of the performance. Yoon Doojoon, Yang Yoseob, Lee Gikwang, and Son Dongwoon are active in music, drama, musical, radio DJ, and various entertainment content as representative allrounder entertainers. Recently, they release their first studio album DAYDREAM and validated their unrivaled presence by showing solid skills and colorful charms in live performances and performances. Meanwhile, the online and offline solo concert HIGHLIGHT LIVE 2022 [INTRO] will be held for three days from May 20 to 22 at Jamsil Indoor Gymnasium in Seoul.    PR Source: HNS HQ Photos: AroundUs How does this story make you feel? "
        },
        "https://www.hellokpop.com/featured/18-k-dramas-to-watch-in-may-2022/": {
            "title": "18 K-Dramas To Watch In May 2022",
            "content": "Six new titles are set to join the current K-Dramaland schedule when April 2022 K-Dramas officially launch. Moreover, a couple of female-centric dramas and fantasy stories will be the highlights for next month’s roster. Historical drama, Bloody Heart, is slated to premiere on May 2. Director Yoo Young Eun (Queen Of Mystery, Manhole) and Writer Park Pil Joo (First Love Again, House Of Bluebird) collaborates for the first time with a unique yet unparalleled cast. The fictional historical drama is about a brutal political romance between King Lee Tae (Lee Joon) and Yoo Jung (Kang Han Na). He has to leave his beloved wife to protect her since his people start to oppose his ruling.  First Vice-Premier Park Gye Won’s (Jang Hyuk) power will challenge King Lee Tae’s decision of being a ‘weak King’ because of love or a King that will protect his women and his people.  Netflix’s latest series features six episodes of enchanting music and dream-chasing stories. The Sound of Magic features Yoon Ah-yi, a girl who has lost her dreams in the face of reality, and Na Il-deung, a boy pressured to pursue his dreams. An unexpected yet enchanting story unravels as the two encounters the mystical magician Rieul.  Woori The Virgin is a romantic comedy-drama based on the hit American show Jane The Virgin. Accordingly, the Korean remake follows Oh Woo Ri (Im Soo Hyang) as she maintains her premarital purity and encounters an unexpected pregnancy with Cosmetics Group CEO Raphael (Sung Hoon). Im Soo Hyang portrays Oh Woo Ri, she has been dating Lee Kang Jae (Shin Dong Wook) for two years. Also, she works as an assistant writer for a popular makjang drama.  Directed by Park Bong Sub, Eve tells the story of a chaebol that has a divorce lawsuit that costs 2 trillion won (approximately 1.7 billion). The actress plays the role of Lee Ra-el, who was born in a well-off family.  Living a golden spoon life, Ra-el couldn’t ask for more. However, her vengeful heart came to light when her father died when she was still a child. She’s also the woman who is behind the extravagant lawsuit. Ra-el has a goal to destroy Kang Yoon-Gyeom (Park Byung Eun), the CEO of the LY group, whom she considers the person responsible for her family affairs.  The series is one of the most anticipated Korean dramas this year. Combining the charm of medical and legal drama, it also features a talented cast. Doctor Lawyer tells the story of an elite surgeon who specializes in general surgery and cardiothoracic surgery, Han Yi Han. His life then transformed as a surgery he conducted and is confident to be successful, unexpectedly fails. As Yi-han’s medical license lifts, he returns four years later as a lawyer, specializing in medical litigation. While defending victims from medical malpractice and negligence, he is also on a mission to unveil the secrets behind the death of his last patient.  Starring Yoon Kye Sang and Seo Ji Hye, the series is directed by Nam Ki-hoon and penned by Jeon Yu-ri. Backing up the project is Arc Media. Kiss Sixth Sense is based on the original Naver web novel of the same name, which was loved for its unique characters and witty narrative. The lead characters possess strange abilities involving their strange and amplified senses. Make sure to update your K-Drama watch list with May 2022 K-Dramas coming up!  Photos: Respective Networks Mentioned in the Feature  || Source: kdramadiary How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/eve-seo-ye-ji-teaser/": {
            "title": "“Eve” Flaunts Confident and Enigmatic Seo Ye Ji In Latest Teasers",
            "content": "The series takes the Wednesday-Thursday slot on tvN beginning May 25. Director Park Bong-seop and writer Yoon Jung-mi collaborate on the project. Billed as a revenge melodrama, Seo portrays the role of Lee Ra-el. After her father’s surprising death when she was young, she has been meticulously designing her vengeance plan. Challenging a 2 trillion won divorce case, Ra-el intends to bring down one of the culprits who caused her family’s misfortune. That person is Kang Yoon-gyeom (Park Byung Eun), a CEO of a conglomerate company. In the teaser poster unveiled, Seo Ye Ji mesmerizes with her sophisticated stance that seemingly foretells trouble. Since her acclaimed portrayal in It’s Okay To Not Be Okay, the actress took a hiatus after being embroiled in a controversy related to her former beau Kim Jung Hyun. Aside from that, she was also tangled in issues of school violence, bullying, and forgery of academic records. In February this year, the actress issued a statement about the controversies and allegations against her. Apologizing for the belated response, she expressed how she took the time to reflect on her actions. “I sincerely apologize for causing concern to many people with my shortcomings. Once again, I sincerely bow my head and apologize for causing a lot of disappointment. It all stems from my immaturity. I will try to act more cautiously and show a more mature image in the future.” Accordingly, Seo now focuses on her latest project which has stirred viewers’ interest. Correspondingly, the teaser video that was also unleashed about Eve commands attention by showcasing her unrivaled talent. In just 15 seconds, her gaze convinces the audience to anticipate her story. Eve premieres on May 25 on tvN. International fans can watch it on Viu.  Source: Sports Donga Photo/Video: tvN Drama How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/urban-myths-overseas-release/": {
            "title": "“Urban Myths” To Be Released Overseas In 13 Countries",
            "content": "Released on April 27 in Korea, the overseas screening unfolds to cater to the raving international fans. Urban Myths aims to recreate ghost stories popular with the younger generation and enter the theater area equipped with new and colorful tales to scarily engross the viewers.  In particular, Kim Do Yoon (Hellbound), Lee Yul Eum,  Lee Young Jin (Between the Seasons), Lee Su Min (The Dude in Me), Oh Ryoong and Jung Won Chang (The Uncanny Counter, Her Private Life) will all make appearances. Additionally, the film marks the screen debuts of Golden Child’s Bong Jaehyun, AleXa, WJSN‘s Seol A and Exy, MONSTA X’s Shownu, Oh My Girl’s Arin and THE BOYZ’s Ju Haknyeon. They are joined by industry seniors BTOB Minhyuk and Lee Ho Won. The film will soon meet K-Movie fans in Japan, Hong Kong, Philippines, Singapore, Thailand, Cambodia, Laos, Myanmar, Vietnam, Taiwan, Macao, Malaysia, Brunei and Indonesia. In addition, director Hong Won-ki of Johnny Bros Co., Ltd., a famous music video company representing Korea, directed more than 1,500 M/Vs and CFs, including Seo Taiji and BTS, completed an eerie and paradigm-shifting horror flick with unique sensuous visual beauty. Notably, Goedam, which was made by Director Hong, was an OTT series released on Netflix in 2020. It has recorded impressive viewership not only in Korea, but also in Hong Kong, Vietnam, and Japan. The global reaction to Urban Myths draws attention aligning to its domestic feat of ranking first in admission ticket sales among films released at the same time for six consecutive days for its first week. It also ranked third at the weekend box office behind foreign films. Watch out for the screening of the film in your area! Source: JTBC News  How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/kdramas-on-netflix-may-2022/": {
            "title": "“The Sound of Magic” and “Welcome To Wedding Hell” Are K-Dramas On Netflix To Watch In May 2022",
            "content": "The two new series feature lauded actors and rising artists. They will decorate stories of hope and love. In The Sound of Magic, a magician living in an abandoned theme park makes troubles disappear, and hope reappears, for a disenchanted teen enduring harsh realities.   Meanwhile, Welcome To Wedding Hell traces a couple’s story who goes for an uphill struggle over wedding preparations.  Slated for May 6 premiere, the six-episode series stars Ji Chang Wook, Choi Sung Eun and Hwang In Youp. All decked to unfold a magical experience filled with fantasy, music, and drama, the story features Yoon Ah-yi – a girl who has lost her dreams in the face of reality – and Na Il-deung – a boy pressured to fulfill his dreams. Correspondingly, an enchanting story unravels as they encounter the enigmatic yet mystical magician Rieul. Interestingly, Rieul lives alone in the ruins of an amusement park, arousing curiosity and suspicion among neighbors. Nevertheless, the self-proclaimed magician presents Ah-yi and Il-deung with a magical experience that they have never experienced before.  Welcome To Wedding Hell narrates the story of a couple in their 30s preparing for their wedding.  Lee Jin Wook plays a marriage idealist and soon-to-be-groom, Seo Jun-hyung. He is an optimistic man who is very smitten with his fiancée.  Easy-go-lucky and an all-rounder, he has a pleasant personality and a fatal charm that will disarm Naeun. It is a point of observation to watch him resolve various conflicts that arise while preparing for marriage with Na-eun and grow into a reliable husband.  Lee Yeon Hee plays Kim Na Eun, a soon-to-be wife full of joy and affection. She has a harmonious relationship with her fiancé and got a decent job in a large company that everyone is envious of. A savvy realist, she thinks a rational choice is always the best. Naeun, who faces reality rather than her ideals, is expected to be revealed in the process of preparing for marriage to her boyfriend, Jun-hyung, whom she has been dating for two years. Don’t miss these new K-Dramas on Netflix next month!  PR Source: Netflix How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/bts-island-in-the-seom-surpasses-1-million-pre-registration/": {
            "title": "BTS’ Puzzle Game “BTS Island: In The SEOM” Surpasses 1 Million Pre-Registration",
            "content": "With its official launch in the second quarter of 2022, BTS Island: In the SEOM is a match 3 puzzle game where users can decorate and interact with BTS characters and the scenery of an island. Along with the adorable in-game graphics, BTS members contributed to the overall production of the game by participating in the development of the official title, logo, character design, and more. The game tells the story of an adventurous ride that unfolds as BTS, who are adrift while going on vacation on a boat, arrive at a remote island with the help of a whale and adapt to the new setting. Previously, the teaser for the game was unveiled at ‘BTS PERMISSION TO DANCE ON STAGE – LAS VEGAS’ prior to the show and raised high anticipation for its official launch.  In line with its pre-registration, BTS released the first episode of an online show, ‘BTS Becomes A Game Developer’ on ‘BTS Island: In the SEOM’ official YouTube channel this week. In the episode, the members enthusiastically shared their ideas for various elements of the game, creating a whole new level of excitement and anticipation for its upcoming launch. Global registration for ‘BTS Island: In the SEOM’ is available via Google Play and App Store. All pre-registered users will be given ‘ARMY Bomb Stand’ that they can use to decorate the island in the game. Additional information regarding BTS Island: In the SEOM can be found on its official website, YouTube and social media channels. PR Source: HYBE How does this story make you feel? "
        },
        "https://www.hellokpop.com/internet/war-of-hormone-becomes-bts-22nd-overall-mv-to-hit-300-million-youtube-views/": {
            "title": "“War Of Hormone” Becomes BTS’ 22nd Overall MV To Hit 300 Million YouTube Views",
            "content": "Worldwide phenomenal K-pop boy group BTS has added “War of Hormone” to their list of music videos with 300 million views on the YouTube platform.  Earlier today, the septet’s music video for “War of Hormone” reached the 300-million mark on YouTube. It took them over seven years, six months, and seven days to achieve the impressive milestone. RM, Jin, Suga, J-Hope, Jimin, V, and Jungkook released the exciting hip-hop song through their debut studio album Dark & Wild on October 22, 2014. The song combines powerful rock guitar sounds and drums and is characterized by fresh lyrics saying that the reason your heart beats in front of the person you like is due to the action of hormones, and the rapping that unfolds like running on the beat. The music video was produced with the “fake one-take technique,” in which each long-take scene was naturally connected and produced like a one-take. In particular, at the end of the video, you can feel the free-spirited and splendid performance of BTS by including the choreography with a 360-degree rotating camera. Notably, “War of Hormone” became BTS’ 22nd overall music video to smash 300 million views. Other music videos of the group that previously obtained the record were “Dope,” “Blood Sweat & Tears,” “MIC Drop (Steve Aoki Remix),” “DNA,” “Fire,” “Fake Love,” “Save Me,” “IDOL,” “Not Today,” “Boy With Luv,” “Boy In Luv,” “Spring Day,” “Dynamite,” “ON” (Kinetic Manifesto Film : Come Prima), “Life Goes On,” “Butter,” “Black Swan,” “Permission to Dance,” “ON,” J-Hope’s “Chicken Noodle Soup (Feat. Becky G), and Suga’s “Daechwita.” Source: Sports Chosun Photo Credits: Big Hit Music How does this story make you feel? "
        },
        "https://www.hellokpop.com/internet/lisa-scores-an-admirable-200-million-spotify-streams-for-lalisa/": {
            "title": "Lisa Scores An Admirable 200 Million Spotify Streams For “LALISA”",
            "content": "BLACKPINK’s Lisa continues showing her prominence as a solo act, exceeding 200 million Spotify streams for her track, “LALISA”. This makes history as the second-fastest female K-Pop soloist track to reach this achievement.  The shortest record for a track by a K-Pop female soloist to reach this number was also by Lisa. Her song, “MONEY”, surpassed 200 million Spotify streams in only 65 days. As the record-holder in both first and second places, Lisa exhibits her strong global influence and popularity. Along with its latest Spotify achievement, “LALISA” received immense support upon its release. The title track topped iTunes’ Top Song chart in 72 countries. It topped YouTube’s global song Top 100 for two consecutive weeks. Additionally, the song ranked number 2 on Billboard’s Global Top 200, 84 on Billboard’s Hot 100, and 64 on UK’s Official Chart Singles Top 100.  The track continues its popularity as a fan-favorite despite being released in September of last year. The self-proclaiming anthem impressed listeners with its catchy melody and lyrics. Moreover, the artist captivated fans with her charismatic performances both in the accompanying music video and on music broadcasts. The soaring achievements of the song and of Lisa as a soloist indicate her global power in the music market. As such, many fans are curious regarding the achievements the song will continue to gain.  Furthermore, Lisa’s popularity is also a testament to the love held worldwide for BLACKPINK as a group. As the worldwide stars are predicted to be gearing for a comeback that could be as quick as this summer, fans are anticipating immense success by the global K-Pop group once again. Source: Newsis Image and Video Source: YG Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/psy-reveals-how-bts-suga-reached-out-for-their-collaboration-track-that-that/": {
            "title": "Psy Reveals How BTS’ Suga Reached Out For Their Collaboration Track “That That”",
            "content": "Worldwide K-pop icon Psy has shared an interesting anecdote about his collaboration with BTS’ genius rapper, composer, and producer, Suga.  In the upcoming episode of JTBC’s Knowing Brothers, which will air on April 30, Psy who returned with a new song “That That,” will appear after five years. He drew the attention of the cast members, saying, “I co-produced the title song ‘That That’ with a surprising person.”  Psy then released the music video for the title song. “Let’s see everyone here,” he said. When BTS’ Suga appeared on the screen, all the brothers couldn’t keep their mouths shut and exclaimed. Afterward, Psy revealed the detailed story of producing a new song with Suga. He revealed, “One day, I got a text message from an unknown number, and it was Suga.” In a recently posted video clip on Psy’s Instagram account, he also shared how he got Suga to participate in the music video for “That That.” “To be honest, I haven’t gotten close to anyone I collaborate with. It’s because I’m usually not the type to meet up with collaborators in person,” said BTS’ Suga. “I seriously didn’t expect to be dancing with Psy. Ah…I thought I was only writing the song.” In addition, Psy shared that in the beginning, they met because Suga wanted to produce his music. The BTS member then ended up featuring on the track, learning the intense choreo, and starring in the music video. “Step by step he got involved more and more deeply. Our Yoongi,” he said with a playful laugh. That That prod.&ft.and Starring SUGA of BTS  2022.04.29 (Fri) 6PM KST#PSY #싸이 #ThatThat#싸다9 #PSY9th #220429_6pmKST#PNATION #피네이션 pic.twitter.com/mHgs37pqun — PSY (@psy_oppa) April 28, 2022  Psy’s newest title track “That That” produced, featuring, and starring Suga of BTS will drop today, April 29, at 6 PM KST. Watch the exciting music video teasers for “That That” below:    Source: iMBC Photo Credits: P NATION | JTBC How does this story make you feel? "
        },
        "https://www.hellokpop.com/fashion/gidle-miyeon-pictorial-with-marie-claire-korea/": {
            "title": "(G)I-DLE’s Miyeon Looks Classy In Her Pictorial With Marie Claire Korea",
            "content": "Miyeon of versatile and talented girl group (G)I-DLE left fans speechless and in awe as she displays a girly and chic aura in her recent feature with Marie Claire Korea.  While donning fashionable clothing pieces in monochromatic tones, the stunning idol made many heads turn with her elegant looks and versatile aura. Shot against plain backdrops, Miyeon displayed her phenomenal and irresistible visuals as she strikes different unique poses. It seems like she’s enjoying every moment of the shoot because the facial expressions she exhibited were very on point and natural. Further drawing attention because of her mesmerizing gaze, the idol has also proved that she can rock any style through her striking figure.  Her stunning facial features also stood out because of her natural and sophisticated makeup look. Miyeon also successfully created a fun and enticing atmosphere that complements her personality onstage and in real life. In the pictorial’s accompanying interview, Miyeon shared her thoughts about (G)I-DLE’s recent bold and chart-topping comeback with a full album I NEVER DIE. She said that they made the return with the thought of becoming challenged. Due to the positive response they got and after realizing that the path they always wanted to go was not wrong, Miyeon shared that (G)I-DLE’ will continue to do the music they want moving forward.  Regarding her solo album My, Miyeon admitted that she was very worried about what kind of music she would include and what kind of energy she would exhibit to show her real self. “After much thought, I came to the conclusion that it was comforting music that gave me comfort or courage,” she added. Miyeon also shared that she took a new challenge by trying to write lyrics for this album about a story that she usually likes to write, but couldn’t bring it out to the world due to shame. When asked about what she would like to do in the future, the idol said, “It’s a good experience to host and act, but anyway, I try not to forget that my beginning is music, and I’m good at what I do. I have a strong desire to do better, but on the other hand, if given the opportunity to experience something I have never done, I will do it all.” Fans can know more about Miyeon’s fun interview by grabbing the May issue of Marie Claire Korea and by visiting its official SNS accounts. Source: Star Daily News Photos from Marie Claire Korea How does this story make you feel? "
        },
        "https://www.hellokpop.com/internet/gi-dles-tomboy-smashes-100-million-youtube-views/": {
            "title": "(G)I-DLE’s “TOMBOY” Smashes 100 Million YouTube Views",
            "content": "Charismatic girl group (G)I-DLE has recently recorded a new milestone on YouTube with their latest masterpiece track “TOMBOY.”  Earlier today, Cube Entertainment announced that (G)I-DLE’s music video for “TOMBOY” reached 100 million views on YouTube. It became their fifth music video to achieve the milestone following “LATATA,” “Oh my god,” “HANN,” and “LION.” On March 14 at 6 PM, the quintet returned on March 14 with their first full-length album I NEVER DIE. On the same day, the music video for their title track “TOMBOY” was also released. It took them just around 46 days and 14 hours to earn the massive online view count. Notably, “TOMBOY” is now (G)I-DLE’s fastest music video ever to join the 100-million club on YouTube. Back in 2020, their track “Oh my god” recorded approximately 93 days and 13 hours to obtain the feat. Aside from its YouTube success, “TOMBOY” also showed impressive performance on the music charts.  The song caused a syndrome by ranking first in the real-time charts and Top 100 of four music sites including Melon, Genie, Bugs, and Flo. (G)I-DLE also raked in several records on various Billboard charts through their latest comeback. I NEVER DIE ranked 58th on the Global 200 chart. In addition, “TOMBOY” took 34th place on the Global Exclusive chart and ranked 12th on the World Digital Song Sales chart, proving its hot topic and global power. Celebrate (G)I-DLE’s latest YouTube achievement by watching their captivating “TOMBOY” music video below:  Source and Photo Credits: Cube Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/akmus-suhyun-to-release-a-touching-ost-for-jtbc-drama-my-liberation-notes/": {
            "title": "AKMU’s Suhyun To Release A Touching OST For JTBC Drama “My Liberation Notes”",
            "content": "Suhyun of sibling duo AKMU is officially the seventh runner in the official soundtrack of the newest drama on JTBC titled My Liberation Notes. Studio Maum C, the production company behind all of the drama’s soundtracks, confirmed on April 29 that the talented singer will lead the seventh part of the drama’s OST.  “On May 1 at 6 pm My Liberation Notes‘ 7th OST Lee Suhyun’s “My Spring” will be released,” the company stated. Titled “My Spring,” the track expresses the feelings of the characters of the show. Moreover, it also conveys deep and heartfelt emotions that viewers can relate to. Lyrics such as “Is it too late for me because of my slow steps” and “May my dazzling dreams bloom in the pouring sunlight” perfectly encapsulate the theme, message, and feel of the song. Making it more special, “My Spring” is the brainchild of Park Seong-il, composer of ‘Adult’, the OST of ‘My Mister’, and writer Seo Dong-seong. This special project will mark Suhyun’s fifth time to feature in a solo OST following her emotional and meaningful song for  Lovestruck in the City titled “Love And Pain.” He also took part in the OSTs of other dramas namely It’s Okay to Not Be Okay and Mr. Sunshine.  Through her impressive vocal techniques and calming tone, the singer will surely impress K-Pop and K-Drama lovers as she expresses the emotions of the protagonists of the show. With her participation, “My Spring” will also increase the immersion of viewers in the engaging and gripping plot of the drama. Produced by JTBC, My Liberation Notes tells the story of three siblings and a secretive stranger, who badly want to escape from their exhausting and dead-end life. It airs every Saturday and Sunday at 10:30 PM KST. Meanwhile, Suhyun made her solo debut in October 2020 with her addictive digital single titled “Alien.” Source: Star News Photos from YG Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/girls-generations-seohyun-signs-anew-with-namoo-actors/": {
            "title": "Girls’ Generation’s Seohyun Signs Anew With Namoo Actors",
            "content": "Girls’ Generation’s Seohyun will continue to pursue her journey as an actress with her agency, Namoo Actors.  Just recently, Namoo Actors announced that Seohyun had officially renewed her exclusive contract with them. She previously joined the agency three years ago after parting ways with SM Entertainment. “We will continue our relationship with Seohyun, who surprises us with a new face in each work,” said the agency. “We will spare no effort to support Seohyun, who is building a stable career as an actress so that she can receive a lot of love from the public in the future.” Seohyun, who made her debut as a member of Girls’ Generation in 2007, has since transformed into an actress and has met viewers through various works. In the Netflix movie Moral Sense, which was released in February, she played the role of Jung Ji Woo, a competent public relations team member who lives and speaks boldly. According to the agency, Seohyun will make a drama comeback soon. She will take on the role of Seulbi, the main character with the mysterious ability to see the future in the new KBS drama Lovers of Jinx scheduled to air in the first half of this year. In addition, she has finished filming for the movie Holy Night: Demon Hunters and the Netflix series Rogue: The Sound of the Sword. Namoo Actors is a management company specializing in actors, including Yoo Jun Sang, Lee Joon Gi, Park Eun Bin, Song Kang, Seohyun, Koo Gwan Hwa, Hong Eun Hee, Kim Hyo Jin, and Lee Yun Ji. Source: Dailyan | iMBC Photo Credits: Namoo Actors How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/ncts-johnny-graces-met-gala-2022-as-the-only-k-pop-star/": {
            "title": "NCT’s Johnny Graces “Met Gala 2022” As The Only K-pop Star",
            "content": "Johnny from SM Entertainment’s global boy group NCT was invited to the world’s largest fashion charity event Met Gala as the only K-pop artist this year.  NCT’s Johnny graced the event, which was held at the Metropolitan Museum of Art in New York on May 2. He climbed the red carpet with Peter Do, the head of the luxury brand of the same name. The Met Gala is the world’s largest fashion charity gala show held on the first Monday of May every year since 1948. Marking his first appearance on the show, Johnny wore an ensemble specially made by Peter Do. The outfit was inspired by “Gilded Glamor,” the official dress code for the event. He also showed his sexy and chic charms by donning straight-fitting stain pants.  In addition, a large number of fans gathered to see Johnny at the scene on this day and gave a warm response. His name also reached the real-time Twitter trends in 40 regions around the world, including Korea, the United States, the United Kingdom, Italy, Canada, Mexico, the Netherlands, and New Zealand. Among the popular celebrities who attended this year’s Met Gala includes Blake Lively, Ryan Reynolds, Emma Stone, Megan Thee Stallion, Jeremy Scott, and Hailey Bieber, Kylie Jenner, Gigi Hadid, Kim Kardashian, Bella Hadid, Hugh Jackman, Billie Eilish, and Olivia Rodrigo. Source: Sports Chosun Photo Credits: Sports Chosun | SM Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/shooting-stars-cameo-appearances/": {
            "title": "Lee Ki Woo, Kang Ki Dong and Lee Sang Woo To Make Special Appearances In “Shooting Stars”",
            "content": "The series depicts the reality of people who shed blood, sweat, and tears to make the artists shine. Given the story’s premise, the scenes are expected to draw more exposure to the entertainment scene, particularly artists, managers, and PR people. Predicting more cameo treats from actors, a new roster was unveiled naming Lee Ki Woo, Kang Ki Dong and Lee Sang Woo to appear in the coming episodes. Ahead of the third episode, Shooting Stars unveils a new set of actors to grace the series. In the drama, Lee Ki Woo is going to play an over-immersed actor who is getting weaker day by day because his latest character suffers a terminal disease. Playing the role of his manager is Kang Ki Dong who indirectly shares his predicament. Expect humorous interaction between the two actors. Meanwhile, Lee Sang Woo takes on the role of a famous actor who Park Ho-young (Kim Yun Hye) is promoting. They are set to challenge rumors surrounding him. Expectations are high for Lee Sang-woo’s impactful performance that will bring out an unpredictable reversal behind his sweet and gentle visual. Shooting Stars airs every Friday and Saturday on tvN! International fans can watch it on Viu.  Source: xportsnews How does this story make you feel? "
        },
        "https://www.hellokpop.com/internet/stayc-welcomes-fans-for-first-fan-recruitment-period/": {
            "title": "STAYC Welcomes Fans For First Fan Recruitment Period",
            "content": "STAYC begins the recruitment period for their first official fanclub. The announcement gathered much interest, as the girl group continues to meet glowing support domestically and overseas.  Regarding the fanclub, Hi-Up Entertainment elaborated, “STAYC’s official fan club “SWITH” 1st recruitment (STAYC OFFICIAL FANCLUB SWITH 1st MEMBERSHIP) will start at 2 pm on the 29th. It will be held until 2 pm on April 28, next year.” Fans interested in registering for the official fanclub can do so through the Weverse Shop membership product page. Benefits from joining the official fanclub include benefits such as mobile membership cards, pre-purchase or lottery for STAYC performances, applications for open broadcasts, opportunities to participate in special online and offline events, and access to exclusive fanclub content. [📢] STAYC OFFICIAL FANCLUB SWITH 1st MEMBERSHIP 오픈 예정 안내 SWITH 여러분의 많은 관심 부탁드립니다❣ ✔가입 기간2022.4.29(금) 2PM(KST) ~ 2023.4.28(금) 2PM(KST) ✔가입 대상STAYC 위버스와 위버스샵에 가입한 회원 ✔가입 방법위버스샵의 멤버십 상품 페이지에서 구매하여 가입 pic.twitter.com/VXgZu53KaS — STAYC(스테이씨) (@STAYC_official) April 25, 2022  STAYC continues to grow a sizeable fandom worldwide. Since debuting, the group has garnered immense attention for their catchy and trendy title tracks including “SO BAD”, “ASAP”, “STEREOTYPE”, and “RUN2U”. Their latest release, “RUN2U”, broke several of their personal records including STAYC’s personal sales record. Moreover, with the title track, the group scored seven broadcast wins and entered the top ten of the real-time, daily, and weekly charts of the music platform Melon. As of writing, STAYC approaches the 45 million mark for YouTube views of their music video for “RUN2U”.  Many fans are eagerly anticipating the group’s future activities this year. With STAYC’s success continuing to soar, expectations are high regarding their potential as a global K-Pop group. STAYC will continue meeting their immense demand by partaking in the ‘KCON 2022 Premiere’ during its Chicago stop in the USA. Source: Newsen Image and Video Source: Hi-Up Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/twices-sana-stays-in-japan-after-being-diagnosed-with-covid-19/": {
            "title": "TWICE’s Sana Stays In Japan After Being Diagnosed With COVID-19",
            "content": "After wrapping up their successful three-day Tokyo dome concerts, TWICE’s Sana has stayed behind in Japan due to being diagnosed with COVID-19.  On April 26, JYP Entertainment shared the announcement that all nine members of TWICE underwent PCR testing for their departure to Korea, following their activities in Japan. Sana tested positive for COVID-19 and remained in her home country to self-isolate and recover. Meanwhile, the other eight members received negative results and flew back to Korea. “Sana arrived in Japan on April 16th (Saturday) and was released from quarantine on April 20th (Wednesday), testing negative for two PCR testings,” the agency said. While staying in Japan, all members proceeded with antigen testing every day and all tested negative during three days of the concert.” According to the agency, Sana has already received her third dose of the COVID-19 vaccine. Currently, she is undergoing quarantine and recuperating, following the disease control guidelines.  After apologizing for causing concern to fans and related people, the agency promised to continue positioning the health of their artists as their top priority. TWICE will next visit Los Angeles next month. The nonet will meet fans through their first-ever stadium concert at the Banc of California Stadium on May 14 and 15 as a special encore to their record-breaking tour III.   Source and Photo Credits: JYP Entertainment | iMBC How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/astro-drive-to-the-starry-road-concept-photos/": {
            "title": "ASTRO Serves Stellar Looks Of MJ and Jinjin In Concept Photos For “Drive To The Starry Road”",
            "content": "Charming boy group Astro is coming back with their third full album and their concept photos are so far tantalizing.    MJ, Jinjin, Cha Eun-woo, Moonbin Rocky and Sanha are set to propel three versions of concept photos: “Drive”, “Starry”, and “Road” which relate to the album’s title.  First up on the list is MJ, opening the doors to a new curiosity for Arohas. On May 2nd, MJ’s pictures revealed preheating expectations for the comeback.  The “Drive” version bathes MJ in a blue hue, matching his denim outfit. The snapshot depicts a free atmosphere perfect for his godly visuals.  Meanwhile, the “Starry” version features MJ perfectly melted into a dreamy atmosphere reminiscent of a dark night. His mature beauty enhanced the delivery of the concept.  Finally, the “Road” version is eye-catching. Colorful flowers surround the artist in a romantic mood while his warm eyes draw attention to the second picture.  [#아스트로] 아스트로 MJ, 정규 3집 세 가지 버전의 콘셉트 포토 공개…별빛 감성으로 ‘청량 매력 UP’▶ https://t.co/2ZPU38O9fW#NEWS #ASTRO #엠제이 #MJ#Drive_to_the_Starry_Road#CandySugarPop pic.twitter.com/Xjr3HzJxhS — 판타지오뮤직 (@fantagiomusic_) May 3, 2022    Subsequently, Jinjin’s concept photos were revealed the day after with the same three versions. He poses nonchalantly and exposes his sharp jawline in the “Drive” version.  In the same dreamy atmosphere as MJ’s, Jinjin wore a stunning suit which further highlights his allure in the “Starry” rendition of the photos.  For the “Road” version, he poses among the flowers with a captivating gaze. [#아스트로] 아스트로 진진, 와일드+성숙+소년美 담은 정규 3집 개인 콘셉트 포토 공개▶ https://t.co/6H006CnzUD#NEWS #ASTRO #진진 #JINJIN#Drive_to_the_Starry_Road#CandySugarPop pic.twitter.com/7fwXjg9SBl — 판타지오뮤직 (@fantagiomusic_) May 4, 2022  Astro is coming back with their third full-length album carrying a high-quality concept just from the concept photos.  Notably, the album clearly captures the group’s musicality by all members participating in lyric-writing, composing, and rap making.  The keyword “star”, which directly relates to their group name, is hidden throughout the album and teasers so make sure to look out for it.  In case you missed it, the album pre-order began on April 29, followed by the individual concept photos release from May 2nd to May 7th.  After which, the group’s concept photo will be revealed on May 9th, before the highlight medley on May 11th. The teaser for the music video will be released on May 13th.  Finally, the album and music video for Drive To The Starry Road will be available to the public on Monday, May 16th. Source: HNS HQ Photos: Fantagio How does this story make you feel? "
        },
        "https://www.hellokpop.com/featured/bloody-heart-character-teasers/": {
            "title": "“Bloody Heart” Foretells Tumultuous Court Romance Starring Lee Joon, Kang Han Na and Jang Hyuk",
            "content": "KBS2 TV’s newest period drama tells the political conflict between a king (Lee Joon) and a kingmaker (Jang Hyuk), following the relationship between an absolute ruler and a kingmaker who desires to transform the king into a “royal flower.” Director Yoo Young Eun (Queen Of Mystery, Manhole) and Writer Park Pil Joo (First Love Again, House Of Bluebird) collaborates for the first time with a unique yet unparalleled cast. First, Lee Joon transforms into a king with aspirations to become an absolute monarch. In contrast to his frail look, his eyes are packed with a range of emotions, including melancholy and ferocity, which captures the viewer’s attention. The phrase, “I will live in my hell, so live with a smile in your world,” conveys Lee Tae’s sincere hope that his beloved will escape the fierce court struggle. Furthermore, concerns are growing concerning his ability to give up his power for Yoo-jeong, despite his meticulous appearance of not living as a counterfeit king.  Demonstrating her unmatched grace, Kang Han Na flaunts her splendid, yet simple and elegant figure. Her solemn expression of seriousness, dazzling eyes, and her statement of “I will protect his highness” reveal Yoo-jeong’s independent charm. Finally, Jang Hyuk emanates a strong aura as Park Gye-won, who has the appearance of a tiger and the statue of a scholar, which overwhelms the viewer.  Interestingly, the faces of Lee Joon, Kang Han Na, and Jang Hyuk, which are becoming more and more blurred with red, stimulate curiosity. Bloody Heart will premiere on May 2 at 9:30 PM on KBS2 TV. Source: KBS Drama How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/vixx-ravi-to-temporarily-leave-2-days-1-night-to-fulfill-mandatory-military-service/": {
            "title": "VIXX’s Ravi To Temporarily Leave “2 Days & 1 Night” To Fulfill Mandatory Military Service",
            "content": "Viewers of the popular KBS2 variety show 2 Days & 1 Night will have to temporarily bid farewell to VIXX’s Ravi.  On April 21, Ravi held a V Live broadcast to reveal that he will be leaving the program. He said, “The reason I came to you today is because I have something I want to tell you. I recently went on my last trip on 2 Days & 1 Night.” He also revealed that he’s been preparing for several things. “I’m doing my best for the things I need to do and what I can do recently. I’m preparing an album and working hard at the company. I hope to meet you and have a good time at my upcoming REVOIR concert,” he added.  Soon after, the production team of 2 Days & 1 Night released an official statement regarding Ravi’s departure and future plans. The team shared, “We would like to inform you that member Ravi is leaving the program to fulfill his military duty. We ask for your support for Ravi, who will temporarily part ways with us after the ‘Wish Us Luck’ tour, which will be aired until next week.” In addition, they said that they will provide future updates about the program-related matters as soon as they are decided. Ravi joined 2 Days & 1 Night as a new member in December 2019. Meanwhile, the remaining cast members are Kim Jong Min, Yeon Jung Hoon, Moon Se Yoon, DinDin, and Na In Woo. Source: iMBC | Sports Donga Photo Credits: KBS2TV How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/bts-island-in-the-seom-launches-pre-registration/": {
            "title": "“BTS Island: In The SEOM” Launches Pre-Registration",
            "content": "‘BTS Island: In the SEOM’ is a match 3 puzzle genre with artful graphics depicting a beautiful island and adorable characters of the band. The game tells the story of an adventurous ride that unfolds as BTS, who are adrift while going on vacation on a boat, arrive at a remote island with the help of a whale and adapt to the new setting. The teaser for the game was unveiled at ‘BTS PERMISSION TO DANCE ON STAGE – LAS VEGAS’ prior to the show and raised high anticipation for its official launch.  One of the standout features of ‘BTS Island: In the SEOM’, is its new characters that are created based on each of BTS members’ unique personalities. The characters in the game reflect the real-life charm of each member, including RM, the cautious and considerate leader, Jin and j-hope, always bright and positive, SUGA with pure vigor for life, Jimin who is sweet and charming, V with quirky charms and Jung Kook, the reliable youngest. The members, not only appeared in the game as characters, but have also contributed to the overall ideation of the game by participating in the development of the official title, logo, character design, and in-game soundtrack music with the intention of creating a game they can enjoy together with their fans – ARMY. In ‘BTS Island: In the SEOM’, the users can decorate BTS characters and the scenery of the island, with various items through puzzle play and enjoy the endearing interaction between the characters taking on various missions on the island.  Global registration for ‘BTS Island: In the SEOM’ is available now via Google Play and App Store. All pre-registered users will be given ‘ARMY Bomb Stand’ item that they can use to decorate the island in the game. In line with its pre-registration, BTS has released the first episode of an online show, ‘BTS Becomes A Game Developer.’ The show will feature behind the scene episodes of BTS’s making of the game including key details such as its official name, logo and more. The members also delved into professional areas of game development by teaming up with a professional game developer. ‘BTS Become Game Developers’ will be released every Tuesday for four consecutive weeks on ‘BTS Island: In the SEOM’ official YouTube channel. PR Source: HYBE How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/yumis-cells-2-teaser-photo/": {
            "title": "“Yumi’s Cells 2” Shows “Pretty In Pink” Kim Go Eun",
            "content": "TVING brings back the audience inside Kim Yu Mi’s mind again after confirming a prequel for Yumi’s Cells 2. Kim Go Eun also returns as Kim Yumi with her adorable cells.  Yumi’s Cells is based on an original webtoon story created by Donggeon Lee. It was given life by TVING and directed by Director Lee Sang Yeob. His recent dramas include A Piece Of Your Mind, My Holo Love, and Shopping King Louie to name a few.  The mixed 3D animated and live-action series follows the heartbreak of Kim Yu Mi (Kim Go Eun) which led her love cells to fall into a deep coma. She then meets an emotionally stunted game developer, Goo Woong (Ahn Bo Hyun).  A spark between their two love cells unexpectedly helped them to learn to love again and express their feelings. In the second season, Yumi and her cells will find themselves standing at the boundary between love and dreams.  The recent poster for Yumi’s Cells 2 has a similar layout to the first season. Keeping her iconic bangs, Kim Go Eun elevates the look with a longer hair length. Yumi’s Cells 2 will be back in June on TVING. Source: xportsnews How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/kiss-sixth-sense-teasers/": {
            "title": "Yoon Kye Sang and Seo Ji Hye To Engage In Peculiar Romance In “Kiss Sixth Sense”",
            "content": "Kiss Sixth Sense is based on the original Naver web novel of the same name, which was loved for its unique characters and witty narrative. The lead characters possess strange abilities involving their senses. At the script rehearsal site, director Nam, writer Jeon, as well as major cast members including Yoon Kye Sang, Seo Ji Hye, Kim Ji Seok, Lee Joo Yeon, Tae In Ho, Kim Ga Eun, and Hwang Bo Ra attended. The main cast unitedly agree on how the script was fun. In addition, the production team promises engrossing romance viewers can look forward to. “The material is fantasy, but the story of Min-ho and Ye-sul at an advertising company is very realistic. It is fun to cross between reality and fantasy. Please look forward to a thrilling romance that will awaken your senses.”  Corresponding the latest video teasers give a peek at the lead pairing. Ye-sul is introduced with her unique seer ability while Min-hu evokes a commanding presence. Their work relationship is as mercurial as it can get. As such, Ye-sul’s premonition of a steamy encounter with Min-ho troubled her. Notably, the appearance of Ye-sul’s ex-boyfriend stimulates a fresh and different romance story. Kiss Sixth Sense targets May premiere on Disney Plus!   Source: Sports Donga How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/astro-drive-to-the-starry-road-track-list/": {
            "title": "ASTRO Drops Track List + Title Track For 3rd Full Album “Drive To The Starry Road”",
            "content": "After unveiling the scheduler for Drive To The Starry Road comeback, the group heads to release concept photos, highlight medley and MV teaser prior to the album launch. On April 27, the tracklist was also presented including details about self-composed songs and the title song. “Candy Sugar Pop” is revealed to be the lead song of ASTRO’s 3rd studio album. Jinjin and Moonbin participated in writing the lyrics and Rocky contributed to the rap parts. It is a song that not only expresses ASTRO’s unique refreshing color deeply but also conveys excitement with a bright and lively feeling plus a sweet and humorous mood. With this title song, they express their musical ability and refreshing feeling at the same time, raising expectations for the performance that will ‘POP’ their own charm.  In addition to the title song, the album contains “Something Something”, “More”, “Light the Sky”, “Story”, “All Day”, and “First Love” A total of 11 high-quality tracks, other songs to be featured are “Let’s go ride”, “S#1”, “24 Hours”, and “Like Stars. In particular, Jinjin and Rocky both worked on the rap parts of four songs including the title song. Jinjin contributed to “More” and “All Day”, while MJ took charge in “Light the Sky” and “Story”. Accordingly, Cha Eunwoo and Rocky actively participated in the lyrics and composition of “First Love” and “S#1” respectively. Based on the musical capabilities they have accumulated over the years, ASTRO members are expected to present an extraordinary album to their fans. Making time to involve themselves despite the weight of their regular schedule, the group intends to give a special gift to AROHA. [#아스트로] ASTRO 3rd Full AlbumScheduler 🌌 2022. 05. 16 RELEASE#ASTRO #Drive_to_the_Starry_Road pic.twitter.com/BqctITXBHc — 판타지오뮤직 (@fantagiomusic_) April 26, 2022  ASTRO will release Drive to the Starry Road on May 16 at 6 p.m. on local and international music sites. PR Source: HNS HQ Photos: Fantagio How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/lee-seung-gi-and-lee-se-young-new-kbs-drama-love-according-to-law/": {
            "title": "Lee Seung Gi and Lee Se Young To Star In New KBS Drama “Love According to Law”",
            "content": "Lee Seung Gi and Lee Se Young have both accepted the lead roles in the KBS2’s upcoming drama Love According to the Law. Based entirely on a hit web novel of the same name by writer Noh Seung Ah, the drama revolves around the romance and law genres. It is set at Law Café, which is both a law firm and a café. Love According to the Law will tell the story of a landlord, who is a former prosecutor once known as the “monster genius,” and a lawyer who runs the café.  This upcoming drama is the brainchild of writer Lim Ji Eun from  KBS’s 2020 Drama Special, One Night. Overseeing the overall production is talented director Lee Eun Jin, who previously handled gripping and exciting dramas such as Baker King Kim Tak Goo, Good Manager, Waiting for Love, and Feel Good to Die. Lee Seung Gi, who is well-known for his versatility and effortless acting skills, will portray the role of Kim Jung Ho, the former prosecutor and current landlord, who has known Kim Yu Ri for 17 years. Although he is charismatic, he also has a soft side to his personality. This project will mark Lee Seung Gi’s first time reuniting with Lee Se Young since they starred in the 2017 drama Hwayugi together. Meanwhile, Lee Se Young is now gearing up to take the role of Kim Yu Ri, an eccentric lawyer who has a personality like fire, being unable to hold back at injustice. She used to work at a powerful law firm, but suddenly leaves her job to open up a café. Viewers can anticipate Lee Se Young’s transformation into a cool and chic female lawyer. The production team shared, “In Love According to the Law, Lee Seung Gi and Lee Se Young will bring Kim Jung Ho and Kim Yu Ri to life with their unique individualities. We are confident that they will properly recharge your drained emotions. Please show lots of interest and anticipation for the crazily heart-fluttering feelings and the thrill of achieving justice.” Details regarding the airing of the drama will be announced soon. Source: Newsen Photos from Hook Entertainment and Prain TPC How does this story make you feel? "
        },
        "https://www.hellokpop.com/fashion/txt-yeonjun-and-soobin-pictorial-with-dazed-korea/": {
            "title": "TXT’s Yeonjun And Soobin Flaunt Their Mesmerizing Visuals In Pictorial With Dazed Korea",
            "content": "TXT’s Yeonjun and Soobin joined forces to complete MOAs day in a stunning and unique photoshoot with Dazed Korea.       Delivering a chic and sophisticated atmosphere, the idols exhibited a manly and mysterious image, while garbed in fashionable monochromatic outfits. Shot against dark settings, the artists were both sights to behold as they sport charismatic poses that perfect fit the pictorial’s concept. Garnering fans’ attention even more, Yeonjun and Soobin’s hairstyles are polar opposites yet they still deliver an impressive chemistry. Both of their piercing gazes and facial expressions can also instantly melt spectators’ hearts. The simple but impactful styling gave both idols distinct characters that still complement one another.  Making it more special, the shoot was conducted in collaboration with Dior, particularly its representative men’s perfume Sauvage and Addict Lip Tint. This photoshoot further proved that TXT has got it all, from looks and intelligence to talents. Indeed, there is no denying that they are one of the best fourth-generation groups today. In the pictorial’s accompanying interview, both idols shared their thoughts on the growing influence of K-Pop worldwide.  Soobin stated, “There are so many idols with various styles and perfections. If you see K-pop idols who show their skills in all aspects of the concept, song, and dance, you will definitely find a group and music that suits your taste.” Meanwhile, Yeonjun opened up about his new role as the MC for SBS’ Inkigayo. He said, “I really like it because I think it’s a new and fun experience. I get along really well with the other two MCs, so I’m happy to be able to work with good people.”  Fans can see more of Yeonjun and Soobin’s exquisite photos and know about their fun interview by buying a copy of Dazed Korea’s May 2022 issue or visiting the magazine’s official SNS accounts. Meanwhile, TXT will make their highly awaited comeback on May 9 with minisode 2: Thursday’s Child. Source: Osen Photos from Dazed Korea   How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/so-ji-sub-doctor-lawyer-first-stills/": {
            "title": "So Ji Sub Is A Caring And Skilled Surgeon In First Stills For Upcoming Drama “Doctor Lawyer”",
            "content": "So Ji Sub is back on the small screen through MBC’s medical suspense legal drama Doctor Lawyer. It tells the story of a genius doctor turned lawyer and a prosecutor from the Medical Crime Division of the Prosecutor’s Office.  The charismatic actor portrays the role of Han Yi Han. He is a double-board certified surgeon who specializes in general and thoracic surgeries. After losing everything in an operation he thought he successfully performed, he returned as a medical malpractice lawyer. Han Yi Han is bent on uncovering the person responsible for the manipulation resulting in his downfall. In the images released, the actor is donning a doctor’s outfit. One of the photos shows Han Yi Han in a white lab coat with his medical scrub underneath. He wears a gentle and concerned expression. Meanwhile, the other image places him in the surgery room garbed in his surgical gown looking sharp and professional. Drawing attention is the contrasting energy emanating from the stills which, So Ji Sub radiated perfectly, showcasing his character’s adaptability.  According to the production team, “So Ji Sub three-dimensionally portrayed a unique character that is difficult to express with his excellent acting skills and presence”. The crew added that the So Ji Sub’s acting surprised and drew admiration from his co-actors as well as the staff. They also invited viewers to watch out and look forward to So Ji Sub, who is coming back with a new drama after four years. MBC’s Doctor Lawyer premieres on May 27, 2022 at 9:50 PM KST. Source: iMBC   How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/ballerina-casting-news/": {
            "title": "Netflix Film “Ballerina” To Unleash Ruthless Revenge",
            "content": "Netflix affirms the production of Ballerina, directed by Lee Choong Hyun and starring Jeon Jong Seo, Kim Ji Hoon, and Park Yu Rim. Ballerina is a Netflix movie that narrates the story of beautiful and merciless revenge. It begins with Ok-ju, a former bodyguard, who exacts a vengeance plan for her most precious friend. Following the success of director Lee Choong Hyun’s movie The Call, this upcoming follow-up is a modern and sophisticated follow-up. Considering The Call exemplified the thriller genre’s fun, unique characters, and sensuous directing, it provided a welcome shock to the Korean film industry, presenting a single action and visual. After their previous work, Jeon works with Director Lee again. They will demonstrate another transformation in Ballerina as the actress portrays Ok-ju. She is a former bodyguard who is able to do self-defense, swordsmanship, firearms, or even rides a bike. Kim Ji Hoon then portrays Choi Pro, the target of revenge. Choi Pro is in direct conflict with Ok-ju as a tall man with an ideal figure and a brilliant mind. Additionally, Jeon and Kim tease their second collaboration, following the Netflix series Money Heist: Korea, and speculate on the chemistry they will display in Ballerina. Besides that, Park Yu Rim will embrace the role of Min-hee, who seeks help from Ok-ju for revenge. Park is a rookie actress who earned a name for herself with Ryusuke Hamaguchi’s Drive My Car. She received an award for the International Feature Film Award at the 94th Academy Awards. Viewers anticipate her winning their hearts as Min-hee, a character with diametrically opposed tastes and charms to Ok-ju. Finally, all-round musical artist GRAY (Gray), who can produce, write lyrics, compose, as well as rap and sing, serves as a music director. GRAY will be joining the production as well, as he has previously collaborated with Netflix through the Netflix series Hellbound and D.P. Source: jTBC News   How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/birth-yoon-shi-yoon-completes-filming/": {
            "title": "Korean Film “Birth” Starring Yoon Shi Yoon Wraps Up Filming",
            "content": "Birth commemorates the 200th anniversary of Father Kim Taegon. He is the first Korean-born Catholic priest and is the patron saint of Korean clergy. He was canonized and named Saint Andrew Kim in 1984 by Pope John Paul II. Playing the titular role is Yoon Shi Yoon of Baker King, Grand Prince, Train fame. Rounding up the main cast members are acclaimed actor Ahn Sung Ki and character actors Yoon Kyung Ho, Lee Moon Sik, Lee Ho Won, Im Hyun Soo, Ha Kyung and rookie actress Song Ji Yeon. The filming for Birth commenced on December 6 last year covering numerous locations in South Korea such as Nonsan, Taean, Boryeong, Danyang, Pyeongchang, Yeosu, Buan, Mungyeong, and Daegu. In addition, scenes were also captured in provinces such as North Chungcheong, Gangwon, South Jeolla, South Gyeongsang, and Goyang Aqua Studio in Gyeonggi as well as Jeju Island. In the backdrop of the Opium war, the movie traces Father Kim’s study in Macau. Crossing the West sea onboard Raphael, the movie will also cover his land entry through Manchuria. It will also feature the scene of pioneering the sea entry route through Baengnyeong Island. The last filming took place in the 18th-century Dominican monastery Shrine of St.Andrew Kim in Lolomboy, Bocaue Bulacan Philippines, where he made a stay. Birth goals to launch in the second half of the year. Source: Sports Donga How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/the-sound-of-magic-main-trailer/": {
            "title": "WATCH: Music, Dreams and Enchantment Mix In “The Sound of Magic”",
            "content": "The Sound of Magic features Yoon Ah-yi, a girl who has lost her dreams in the face of reality, and Na Il-deung, a boy pressured to pursue his dreams. An unexpected yet enchanting story unravels as the two encounters the mystical magician Rieul. The newly released trailer provides a clear context into the narrative, visuals, and relationships among the three main characters – the enigmatic magician Ri-eul (Ji Chang Wook), Yoo Ah-yi (Choi Sung Eun), and Na Il-deung (Hwang In Youp).  As illustrated through the trailer, this fantasy music series will share a universal message of what it is to become a grown-up through a magical yet mysterious storyline. Ji Chang Wook introducing his role, said, “Ri-eul is a mysterious character that will surely intrigue the audience! The line between vice and virtue is irrelevant when it comes to Ri-eul as he constructs and lives in his own world,” stirring up curiosity about his character. This spring, The Sound of Magic invites global audiences to a world of enchantment and heartwarming stories. It will be released on May 6th, only on Netflix.  PR Source: Netflix How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/the-sound-of-magic-director-writer-interview/": {
            "title": "“The Sound Of Magic” Creative Team Gives A Peek At The Creative Process Of The Series",
            "content": "Providing the charming points to anticipate in the series, Director Kim Sungyoun, writer Kim Minjeong and webtoon writer Ha Ilkwon detailed their imaginative intentions in the adapted story. To unfold a magical experience filled with fantasy, music, and drama, The Sound of Magic features Yoon Ah-yi – a girl who has lost her dreams in the face of reality – and Na Il-deung – a boy pressured to fulfill his dreams. Correspondingly, an enchanting story unravels as they encounter the enigmatic yet mystical magician Rieul.  Director Kim Sungyoun launched the project intending to preserve the original webtoon’s message. He was moved by how the original story depicted the characters wavering between dreams and reality and how “magic” alleviated their hardships. For that reason, Kim first proposed this live series adaptation to the original webtoon writer Ha Ilkwon, and after a decade, they’re now ready to present it to global audiences. Kim says working on the hit series Itaewon Class gave him a better understanding of the rift between a webtoon and live series. Thus, he involved writers Kim Minjeong and Ha Ilkwon from the early planning stages to share ideas and set the right direction and tone. “I thought integrating music into the magic theme could effectively convey the story’s message. By weaving in music, choreography, and CG to the original narrative, he created attractive visuals and a compelling narrative that can eventually drive emotional impact.” Meanwhile, writer Kim Minjeong focused on bridging the gaps between the webtoon and the live series, paying close attention to details to suit the overall production. “The necessary process of revising detailed elements was not easy. It simultaneously required matching the song lyrics to the plotline context, convincingly depicting the character’s emotions, and aligning the right kind of magic for the character Ri-eul.” The Sound of Magic invites global audiences to a world of enchantment. It will be released on May 6th, only on Netflix.  PR Source: Netflix How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/big-mouse-slates-broadcast-spot-on-mbc/": {
            "title": "“Big Mouse” Slates Broadcast Spot On MBC",
            "content": "Big Mouse narrates the story of a lawyer with a win rate of 10% who gets caught up in a murder case. He accidentally becomes a rare genius con artist ‘Big Mouse’ overnight. The series digs into the true face of the privileged class, which is stained by a huge conspiracy. Accordingly, the drama would also show the struggles of a lawyer who came from a lower middle class and needs to go out of his comfort zone to protect himself and his family. Lauded creators Jang Young-chul and Jung Kyung-sun, as well as director On Choong-hwan, collaborate in this new legal series. Their combined portfolio boasts popular and acclaimed dramas including Vagabond, Hotel Del Luna, Doctors, While You Were Sleeping, Start-Up and more. In the drama, Lee Jong Suk plays the role of Park Chang-ho. Many people call him “big mouth” because he only talks resplendently but has no sense at all. Moreover, being a third-rate lawyer, he has a hard time paying his monthly rent for his office along with his office manager who is also his father-in-law. Chang-ho is married to Ko Mi-Ho (Im Yoona), who inspires him to be a lawyer. Mi-Ho who is sophisticated during her college days turns into a fearless and foul-mouthed woman. Bolstering the lineup of Big Mouse are reliable actors Kim Joo Heon, Ok Ja Yeon, Yang Kyung Won and Kwak Dong Yeon. Big Mouse premieres in July following Doctor Lawyer.  How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/im-yoona-and-ahn-bo-hyun-gear-up-for-2-oclock-date/": {
            "title": "Im Yoona and Ahn Bo Hyun Gear Up For “2 O’Clock Date”",
            "content": "Director Lee has prepared his new project for three years and is ready to work on it following the success of the hit movie Exit. 2 O’Clock Date narrates the story of a woman who secrety goes for extraordinary dates with her neighbor at 2 a.m. when people are asleep. In the film, Im Yoona takes on the role of Jeong Seon-ji, a lovely woman who has a penchant beyond imagination. Ahn Bo Hyun suits up as Gil-gu, a man from the neighborhood, who spends time with Seon-ji every morning. In addition, Sung Dong Il also joins the main cast as Seon-ji’s father who dotes and loves her unconditionally. Meanwhile, Joo Hyun Young, who has been greatly loved by the MZ generation for her SNL Korea stint makes her big screen debut as Ara, Seon-ji’s cousin. Honored and grateful to helm his second film, Director Lee expressed happiness meeting the actors and crew for the booting ceremony. Likewise, Im Yoona shares the same emotions working again with Exit production team and promises to work hard. Expressing he was drawn to the script of 2 O’Clock Date, Ahn Bo Hyun is excited to work with Director Lee since he also loved his debut film. He feels reassured to be working with the talented female lead. Cameras are going to roll soon for 2 O’Clock Date!  Source: Sports Donga How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/park-bo-gum-confirmed-to-host-58th-baeksang-arts-awards/": {
            "title": "Park Bo Gum Confirmed To Host “58th Baeksang Arts Awards”",
            "content": "After completing his mandatory military service, the popular South Korean actor Park Bo Gum will finally mark his return to the industry soon.  Prior to being discharged from the navy, the well-loved star received a love call from the Baeksang Arts Awards for the host position this year, and it is known that he recently reviewed it positively. On April 29, the actor’s agency, Blossom Entertainment officially announced the exciting news to fans. “Actor Park Bo Gum is about to be discharged, and he will greet him through the Baeksang Arts Awards as his first comeback after his discharge,” the agency said. He will be reuniting with Suzy and Shin Dong Yup at this year’s award ceremony, which will be broadcast live via JTBC on May 6 at 7:45 PM KST. In 2020, Park Bo Gum enlisted for his mandatory military service and later on started serving as a cultural promotion soldier in the navy. He passed the national technical qualification test (barber) practical exam conducted in December last year and obtained his license. Moreover, it is known that he usually shaved the heads of soldiers in the unit. Last February, he was able to get his early comeback after his application to use up his remaining personal and pre-discharge leaves were approved. Source and Photo Credits: OSEN How does this story make you feel? "
        }
    }
}