{
    "web": {
        "https://www.koreaboo.com/news/paparazzi-racist-nct-johnny-2022-met-gala-viral-fans-outrage/": {
            "title": "Video Of Paparazzi Being Racist Towards NCT’s Johnny At The 2022 Met Gala Goes Viral As Fans Express Outrage",
            "content": "NCTzens were excited to hear NCT‘s Johnny would be attending the Metropolitan Museum of Art’s Costume Institute‘s 2022 Met Gala (also known as Met Ball) during his NYC trip. NCT’s Johnny | @NCTsmtown/Twitter It was especially anticipated as he practically manifested it years ago. one thing 127's gonna do is manifest the hell out of something and have it come true in 2-3 years' time https://t.co/yr5j1UYCXC — 🎮 JOHNNY AT THE MET (@waenjivillain) May 2, 2022  He joins EXO‘s Lay, PSY, Rain, and Super Junior‘s Siwon as the fifth male K-Pop idol to grace the annual star-studded event. Johnny is now the 5th Kpop male idol to attend Met Gala after Rain, Psy, Siwon and Lay. Johfam are proud of you 💚 pic.twitter.com/euWXP88rOl — Yanghoe at MET GALA 🎧🍒 (@rishnayuu) May 2, 2022  Considering Anna Wintour herself approves all attendees, it is an especially high honor. for those who talk shit about johnny attending met gala pic.twitter.com/i1GLe2B3nj — acut ⋆｡˚ JOHNNY SUH MET GALA ˚｡⋆｡ (@suhsoftie) May 2, 2022  The theme of this year’s Met Gala is In America: An Anthology of Fashion, focusing on gilded glamour. Since Johnny is a successful Korean-American, styled by a brand owned and run by Asian-Americans, it seemed very fitting since May is Asian-American and Pacific Islander Heritage Month. The stories really reflect the evolution of American style, but they also explore the work of individual tailors, dress-makers, and designers. …We’ve been exploring untold stories and focusing on designers who have been almost written out of fashion history because they weren’t commercially successful or they had a short career span, but at the time had a big impact on American fashion. — Andrew Bolton, Met Gala Curator and Coordinator Is #Johnny wearing a simple look? Yes! However, it‘s the modernized version of the theme by utilizing regality and wealth in fabrics and cuts. That‘s what Peter Do wants his brand to be known for – redefining modern luxury! #MetGala pic.twitter.com/q3cEb8So2H — Λ L E X 🗝🖤 (@alexanderbihn) May 2, 2022  Despite the celebratory event on the particular awareness month, Johnny still became the victim of racism that night. Johnny arrived at The 2022 Met Gala looking fine AF, just as expected. JOHNNY IS SO HANDSOME #MetGala #NCT127 #PETERDO #JOHNNY pic.twitter.com/NItoGx45ut — Met Insider (REAL) (@feIixs) May 2, 2022  The paparazzi directed the celebrities to pose for photos on the red carpet. Being in a crowd of people with so much noise, especially with cameras and flashes going off, can be overwhelming, and one can’t hear everything. Still, one paparazzi got especially impatient. Johnny from @NCTsmtown just said hi to us at the #MetGala and I'm freaking out! pic.twitter.com/8kopnZR6G5 — Teen Vogue (@TeenVogue) May 3, 2022  After directing Johnny to move so that he could get a better picture, one paparazzi became annoyed when the K-Pop idol did not change his pose immediately. Johnny Suh, over here! On this side, please! — Paparazzi Your browser does not support video. Thus the man muttered, “He doesn’t understand a word I’m saying.” He assumed that since Johnny was not responding to his direction immediately and was Asian, he must not understand English. He doesn’t understand a word I’m saying. F*ck. — Paparazzi Your browser does not support video. The original poster of the video @dygenre didn’t realize until after their video went viral that the man next to them had said something racist about Johnny. oh my god the audio for the video i didn’t even realize he said that i was so focused on johnny — eden → met suhla (@dygenre) May 2, 2022  i hope everyone knows i’m not the one talking in the video 🤕 — eden → met suhla (@dygenre) May 2, 2022  Originally, the NCTzen posted the video expressing their excitement about seeing Johnny. JOHNNY I LOVE YOU SO MUCH #MetGala #MetGala2022 #JOHNNY #NCT127 pic.twitter.com/GI0AZAnacJ — eden → met suhla (@dygenre) May 2, 2022  Yet, shortly after posting, the video blew up but for unfortunate reasons as viewers noticed the audio including the paparrazzi’s racist remark.  Netizens were shocked to hear such a racist remark made especially considering Johnny is from Chicago, Illinois, and therefore is fluent in English. Nctzen or not, anyone can see how disrespectful that reporter/paparazzi was to Johnny. Racism and xenophobia is a problem idols face everytime they go to America — nr- JOHNNYS SECURITY (@214yongss) May 2, 2022  Like im gonna need the name of this man to get his job taken from him im being serious, how’s he allowed to work in the industry and have enough confidence to say this straight up ?? pic.twitter.com/0W97pfIl3H — nr- JOHNNYS SECURITY (@214yongss) May 2, 2022  Nevertheless, it was xenophobic to assume that he could not understand English just because Johnny is Asian. yes, but assuming that bc he's asian/is a kpop idol he doesn't understand english IS the xenophobic part, especially in this case bc johnny is literally an american citizen 💀 — babb⁷ᵛ¹²⁷↔✦∞ (@bealbobe) May 3, 2022  Netizens are also pointing out that the paparazzi in question also mispronounced Johnny’s name despite Suh being straightforward to pronounce. *Mispronounces his name * “ he doesn’t understand a word I’m saying” FIRSTLY PUT SOME RESPECT ON HIS NAME…UR TAKING PHOTOS OF HIM SECONDLY ITS THREE LETTERS HOWW?!! THIRDLY HE IS AMERICAN DO A LITTLE RESEARCH OF U WANT A PHOTO SO BADLY — BUSHRA (@BUSHI_101) May 3, 2022  Naturally, the video went viral on both Twitter and TikTok just a couple of hours after the original posting. The original video has over 300K views on Twitter. NCTzen MARKSTAGRAM (@lomlmkl on TikTok) shared it on TikTok, and it garnered 16.8K views in just two hours. once nctzen find his ass, hes for the streets #johnnysuh #metgala #fyp #fypシ #lomlmkl  ♬ original sound – MARKSTAGRAM    | @lomlmkl/TikTok The original poster of the video was able to identify the paparazzi as Erwyn Diaz. The man requested Johnny’s Instagram handle in order to tag him, which many found quite ironic. the only reason i have it is because he later asked me for johnny’s ig to tag him in his story and then asked for mine — eden → met suhla (@dygenre) May 2, 2022  It is disheartening that anyone has to hear such ignorant and racist remarks. Unfortunately, since COVID-19 especially, there has been a rise in anti-Asian rhetoric and hate crimes in America. Many Asian American idols have been troubled about it as they have family there or even live there themselves, such as Eric Nam and GOT7‘s Mark Tuan. Not only that, but the lack of acceptance for Asians in the Western entertainment industry is a primary reason why Eric decided to travel to South Korea to begin a career in music. Eric Nam | EN Management  Thankfully, Johnny also met lots of fans the night of The 2022 Met Gala. So, hopefully, their love drowns out any hate and bigotry he may have overheard. NOT JOHNNY LAUGHING AT ME SCREAMING HIS NAME BYEEEEEE pic.twitter.com/7JmVqGjhVh — child by mark OUT NOW!!! (@onyourm_ark) May 2, 2022  HE SMILED AND THANKED ME FOR THE FLOWERS IM GONNA CRY #JOHNNY #NCT127 #MetGala w/ @dygenre pic.twitter.com/2At4eQAVqM — Met Insider (REAL) (@feIixs) May 2, 2022  Still, this is not an exclusive incident in which Johnny was addressed with such offensive assumptions. Three years ago, an interviewer told Johnny that his “English was phenomenal.” Though, the interviewer in question has since apologized. the interviewer said johnny’s english was “phenomenal” as if he isn’t a wholeass american johnny even said “i’m from chicago” right after that pic.twitter.com/blBGKHn5xK — johnny doing things²⁹ (@johnactivities) May 15, 2019  Similarly, a video went viral of a man being racist towards BLACKPINK‘s Rosé also in New York City. Read more below: Video Of A Man Being Racist Toward BLACKPINK’s Rosé In NYC Goes Viral As Fans Express Outrage  What BTS Are Really Like, According To Actor Simon Pegg American Actors Jake Johnson And Natasha Leggero “Adopt” GOT7’s Jackson Wang AleXa Advances To The Finals Of NBC’s “American Song Contest” The Rose’s Woosung Steals The Show At Marvel’s “Doctor Strange In The Multiverse Of Madness” Premiere View All (338) "
        },
        "https://www.koreaboo.com/news/bts-v-taehyung-rm-namjoon-spoiler-king-new-album/": {
            "title": "BTS’s V Takes RM’s Crown As The New “Spoiler King” And Drops A Clue About The New Album",
            "content": "When BTS‘s RM and V get bored, they hop on social media to answer all of ARMY’s most burning questions. As expected, fans couldn’t stop asking about BTS’s upcoming album that’s set for release on June 10. Your browser does not support video. Previously known as BTS’s “spoiler king,” fans can always rely on RM to drop something…until now! A completion of Namjoon dropping spoilers 🤭🤏 pic.twitter.com/Ye3qPfFNDU — Chimchim🐥 💞| BTS comeback 🔥💜🫰🥵 (@AimanMehmood22) May 2, 2022  When an ARMY asked him for a hint about what fans can expect from the album, he confidently stood his ground and refused to give out any info. ARMY: Why don’t you give us an album spoiler?RM: Because it’s a spoiler? | Weverse However, it didn’t take long for V to step up and accidentally reveal something exciting! Your browser does not support video. In the midst of RM’s spam, V went on Weverse to answer a fan and gave a little bit too much information. ARMY: Will I regret it if I eat something at this time (of the night)…. V: I’m eating rabokki and kimbap. We have a shoot tomorrow though 🤷🏼‍♂️ | Weverse It seems V was too invested in his delicious food that he didn’t realize he spilled some important info to fans! Your browser does not support video. Whether he’s referring to a music video shoot… Your browser does not support video. …or a photo shoot, we’ll just have to wait and find out. However, it’s good to know that exciting things are on the way! Your browser does not support video. Who knows what other kinds of info V will give us in the coming weeks leading up to the album! This is Namjoonification of Taehyung in giving spoilers? THEY SHOOTING THE MV 🫠🤡 — SS⁷🫧 | 2022.06.10 💜 (@findingmybias) May 3, 2022  BTS’s Suga’s Challenging Journey To The Top ARMYs Hope For The Return Of This BTS Jungkook Era RM Spoiled BTS’s “Proof” Album Way Back At “PERMISSION TO DANCE ON STAGE” In LA What BTS Are Really Like, According To Actor Simon Pegg See more BTS "
        },
        "https://www.koreaboo.com/news/kang-daniel-confirms-comeback-drops-story-trailer/": {
            "title": "Kang Daniel Confirms Comeback And Drops “The Story” Trailer Video",
            "content": "Kang Daniel, who released a message related to his comeback, will finally be returning after a year. KONNECT Entertainment recently dropped the The Story trailer online to announce his officially comeback. This one minute and thirty second trailer leaves a strong impression as it reveals various appearances of Kang Daniel. The trailer ends with the phrase, “Every story inspires a generation”. His comeback is set to drop on May 24, making it his first return since his mini album, Yellow, from April of last year. Many are excited to see what he will drop as it will be an album released after “PARANOIA” and “ANTIDOTE”, both of which received huge attention last year. KONNECT Entertainment stated, “We are announcing news of his comeback a bit early for the fans who have been waiting a long time. We plan on making more diverse and interesting communication than our previous method. We hope fans can enjoy this comeback together like a festival”.  Kang Daniel To Drop First Full-Length Album Since Solo Debut Kang Daniel Officially Unveils “Ready To Ride” MV Kang Daniel Unveils His Charisma With “Ready To Ride” MV Teaser Kang Daniel To Make A Comeback This May See more Kang Daniel "
        },
        "https://www.koreaboo.com/news/singer-bi-prerelease-single-global-album-project/": {
            "title": "Singer B.I To Drop Pre-Release Single For Global Album Project",
            "content": "Singer B.I recently dropped a comeback poster announcing the release date of the pre-release single as part of his global album project. The release date for LOVE OR LOVED PART 1 will be May 13 at 1 PM KST. Last month, he first released news of this project through a teaser video, which consists of one pre-release single and two EPs. B.I took off as a solo artist last year by releasing his first full-length album, WATERFALL and half album, COSMOS.  He also became the first Asian and K-Pop artist to participate in the Grammy performance series, GRAMMYs Global Spin. He also recently dropped a documentary teaser online which you can check out below!  "
        },
        "https://www.koreaboo.com/news/yg-entertainment-launch-yg-family-melon-station/": {
            "title": "YG Entertainment To Launch “YG FAMILY” Through Melon Station",
            "content": "YG Entertainment artists will now be appearing on Melon Station. According to Melon, “Today, we will launch YG’s exclusive program, ‘YG FAMILY’ on Melon Station”.  YG FAMILY is an original audio content produced in collaboration with YG Entertainment and Melon. Going forward, they hope to have YG artists appear in person to introduce new albums and behind-the-scene stories, as well as serve as a special communication channel to deliver messages to fans. For the first episode, K-Pop idol group iKON, who will release their fourth mini album, FLASHBACK, made an appearance. Previously, Melon Station introduced SMing, SM Entertainment’s exclusive program, as well as BIGHIT MUSIC RECORD, a program dedicated to Big Hit Music. "
        },
        "https://www.koreaboo.com/news/got7-jackson-parents-first-reaction-jype-audition-everything/": {
            "title": "GOT7’s Jackson Shares His Parents’ First Reaction To His JYPE Audition, And It’s Everything",
            "content": "To most Ahgases (short for IGOT7, their fandom name), it’s common knowledge that had GOT7‘s Jackson not joined JYP Entertainment as a trainee, he would be well-known as a top fencer from Hong Kong! Jackson | @jacksonwang852g7/Instagram As he spent most of his life training and competing in fencing, but left abruptly to pursue his true dream of being a musician in Korea, his parents were understandably worried, and Jackson recently shared their true first reaction to his audition for JYPE!  Jackson recently appeared on The Kelly Clarkson Show as a guest, alongside actor Jake Johnson and American comedian Natasha Leggero. During the show, Kelly Clarkson asked Jackson about his journey from almost-Olympian athlete to a rapper and dancer in GOT7. Jackson talked about his past, and even talked about the way he broke the news of his audition to his parents back then! I was prepping for the London Olympics back then, and then, while prepping, I just told my parents, ‘Hey, I always had this dream about music…let me do my thing!’ —Jackson Your browser does not support video. He also shared how it took him a long time to persuade them, and how everybody around him thought he was making the biggest mistake ever! They of course wanted me to go to the Olympics, and it took me 7 months to convince them. They were really against me [going to Korea]. They were like, ‘You’re out of your mind!’ My principal told me that ‘This is the worst decision you’re ever gonna make in your life’. Then after I debuted as a singer, I went back to have a concert, and I invited him, and he said, ‘Jackson, we believed in you!’ —Jackson Your browser does not support video. Jackson then finally shared his parents’ reaction when he told them he passed the audition for JYP Entertainment-they told him that it was 100% a scam, and were even more against his dropping everything and pursuing music! At first, I said, ‘I passed this audition in Korea, I’m going! I’m leaving!’ And they said, ‘You know what? They told me about this! Entertainment!? No, they’re gonna kidnap you and put you in a cave! You’re not gonna do that! We’re never gonna see you again! You’re gonna be MIA!’ —Jackson Your browser does not support video. He then revealed that he had to work really hard to persuade them for months…which definitely paid off in the end, and now they’re nothing but proud, supportive parents! Jackson (right) and his parents (left) Watch Jackson talk about it here!  And check out his latest English song “Blow” here!  GOT7’s Yugyeom And Mark Tuan Eat Out Together Before Their International Schedules GOT7’s Mark Tuan Plans To Stay In Korea For A Long Time Here’s GOT7 BamBam’s Latest MBTI Result American Actors Jake Johnson And Natasha Leggero “Adopt” GOT7’s Jackson Wang See more GOT7 "
        },
        "https://www.koreaboo.com/news/le-sserafim-kazuha-visuals-resemblance-suzy/": {
            "title": "LE SSERAFIM’s Kazuha Goes Viral For Her Dazzling Visuals That Resemble Suzy",
            "content": "After what seems like forever, HYBE‘s newest and highly anticipated girl group LE SSERAFIM finally debuted with their debut album “FEARLESS.” LE SSERAFIM | @le_sserafim/Twitter  Although netizens have shown their interest in all the members, it seems as if one has recently caught the attention of fans for many reasons, and it’s none other than Japanese member Kazuha. LE SSERAFIM’s Kazuha | @le_sserafim/Twitter  Even before the group debuted, Kazuha was the talk of the internet as it was revealed that the newest idol was actually a professional ballerina, earning accolades and making a mark on the stage worldwide. | @lsrfmfrsl/Twitter  | @inyourhemant/Twitter  In particular, after her debut, Kazuha continued to catch the attention of netizens, whether it was for her visuals… | Weverse Her stunning talent and elegance when performing… Your browser does not support video.| LE SSERAFIM/Youtube  And her unreal proportions! Your browser does not support video.| LE SSERAFIM/Youtube  Yet, it seems like aside from her immense pre-debut talent and visuals, she is also gaining attention for her resemblance to a well-loved Korean star who also started in a girl group: Suzy! Since debuting as part of Miss A in 2010, Suzy has always gained a lot of love for her dazzling visuals that seemed effortlessly beautiful and elegant. Even after she left the group and started gaining an iconic reputation as an actress, Suzy has continued to wow netizens with her ageless visuals and charming personality. Suzy | @skuukzky/Instagram  | @skuukzky/Instagram | @skuukzky/Instagram Well, it seems like after LE SSERAFIM’s showcase, netizens can’t stop seeing the resemblance between the two. In particular, it was Kazuha’s visuals during the group’s recent debut showcase that seemed to emphasize the similarities. In the photos, Kazuha looked absolutely radiant as she showcased her beauty, proportions, and talent. For many, it seemed similar to the vibes Suzy showcases with her elegance and almost Western-like beauty.      Despite the controversy surrounding the group before their debut, the members have showcased class throughout it all. Considering the records they’ve already broken, LE SSERAFIM is a group to watch, and Kazuha could be on her way to becoming a true fourth-generation visual. You can read more about Kazuha below. Meet LE SSERAFIM’s Newest Member Kazuha, The Idol Who Was A Professional Ballerina  LE SSERAFIM To Perform On Japan’s “CDTV Live! Live!” The “Under-Boob” Trend Is Reaching K-Pop, And Netizens Have Mixed Feelings LE SSERAFIM’s Eunchae Showcases Her Immense Professionalism During Their Trailer Filming Here Are LE SSERAFIM’s Animal MBTI Types See more LE SSERAFIM "
        },
        "https://www.koreaboo.com/news/netizens-react-bts-v-boyfriend-vibes/": {
            "title": "BTS’s V Serves Major Boyfriend Vibes In His Instagram Story, And Korean Netizens Are Swooning",
            "content": "BTS‘s V had Korean netizens swooning over his good looks with his recent Instagram story! BTS’s V | @thv/Instagram On May 3, V posted many videos of himself on his Instagram story. In the videos, he was rocking adorably fluffy hair and a Louis Vuitton hoodie. Your browser does not support video.| @thv/Instagram Needless to say, V set ARMY’s hearts on fire with the boyfriend looks he was serving in his Instagram videos! Your browser does not support video.| @thv/Instagram V’s Instagram story also caught the attention of Korean netizens, and they discussed his mindblowing boyfriend visuals on Nate Pann.   We definitely agree with these netizens, and we’re looking forward to more boyfriend material posts from V in the future! BTS’s Suga’s Challenging Journey To The Top ARMYs Hope For The Return Of This BTS Jungkook Era RM Spoiled BTS’s “Proof” Album Way Back At “PERMISSION TO DANCE ON STAGE” In LA What BTS Are Really Like, According To Actor Simon Pegg See more BTS "
        },
        "https://www.koreaboo.com/news/got7-bambam-spoil-everything-ahgases/": {
            "title": "GOT7’s BamBam Promises To “Spoil Everything,” And Ahgases Are Ready",
            "content": "GOT7‘s BamBam celebrated his birthday on May 2 with help from his members! ABYSS giving Bambam his cake with grand music 🖤 BamBam Birthday Party #KingDoubleBDay pic.twitter.com/uRrlOzd9Cr — 𝙨𝙚𝙫𝙚𝙣𝘥𝘭𝘦𝘴𝘴 (@sevendless) May 2, 2022  Jackson Wang shared a video on social media in which the members seemed to be in a rehearsal room for dance practice. Yet, instead of dancing, BamBam was getting whipped cream smeared face on his face. He replied, “Thank you. Every year…” 🎂 pic.twitter.com/28jsSIFg2O — Jackson Wang (@JacksonWang852) May 1, 2022  The next day, BamBam shared his heartfelt gratitude for everyone who wished him a happy birthday, especially Ahgases. He reminded them that he always sees all they do! Thank you for all the birthday wishes🥹and all the projects you guys had done for me😢(you know i check everything😏)i'm already 25 and i feel old as hell lol Thank u IGOT7 for all the love since i'm 17 till now💚 Thank you to all my friends all around the world🙌🏻 Love ya! pic.twitter.com/t2xbJSl3fz — BamBam (@BamBam1A) May 3, 2022  Yet, he shared different messages on Twitter and Instagram. While Twitter received a selfie of the birthday celebrations’ aftermath, Instagram received a photo of his namesake, The Flinstones character.  A post shared by BamBam (@bambam1a)  In addition to thanking Ahgases for their continuous support and love, he promised them something. He will be a “good boy” and “spoil everything.” Ahgases were loving BamBam’s sweet reference to his namesake. find the difference @BamBam1A pic.twitter.com/KexjoRdJUK — ᴍᴜɴɪ. (@wjeking) May 3, 2022  Our good boy 💕✨#bambam @BamBam1A pic.twitter.com/OgBCOOLTQN — diamchuu (@diamchxx) May 3, 2022  Most of all, though, Ahgases are anticipating additional spoilers courtesy of BamBam! Spill everything. Bambam: I'll be a good boy for y'all and spoil everything 😂 All the other Got7 Members: pic.twitter.com/9Tr9ykh4W5 — gaze•bam ☘️ (@gazebam) May 3, 2022  The way BamBam said he’ll be a good boy for us and spoil everything 😭🤣 BamBam our hope ✨ thank you for supplying us with all the major tea @BamBam1A 💚#BamBam #뱀뱀 @GOT7Official #GOT7 #갓세븐 🍓 pic.twitter.com/3TYf1oqQpP — OT7Ahga Int Fanclub (@OT7Ahga) May 3, 2022  BamBam is not BamBam without spoilers! This is why he is our “Spoiler King,” or as Jackson recently referred to him as “Mr. Spoil.” 👤: Bambam told us to come to Korea in June, what does that mean? 👑: Doesn't he tell everybody anything? He's Mr. Spoil. Mr. Spoiler. 😭😭😭#GOT7 #갓세븐 @JacksonWang852 @BamBam1A @GOT7Officialpic.twitter.com/OWfG2yxl7R — 𝙨𝙚𝙫𝙚𝙣𝘥𝘭𝘦𝘴𝘴 (@sevendless) April 19, 2022  Since the start of the year, BamBam has released one spoiler after another regarding the group’s comeback, and we love him for that. BamBam struggling not to spoil got7’s comeback for one minute straight aka BamBam confirming their comeback 😭 🔗 https://t.co/qzXJkiC4HF@BamBam1A #bambam #got7 pic.twitter.com/v8GumZL5Zq — ddalche (@ddalche) January 18, 2022  We’re happy to hear that he won’t change his ways anytime soon. Besides, Jackson recently granted him permission to release more spoilers technically. Read more below: GOT7’s Jackson Wang Grants BamBam Permission To Spoil More Regarding Their Comeback  GOT7’s Yugyeom And Mark Tuan Eat Out Together Before Their International Schedules GOT7’s Mark Tuan Plans To Stay In Korea For A Long Time Here’s GOT7 BamBam’s Latest MBTI Result GOT7’s Jackson Shares His Parents’ First Reaction To His JYPE Audition, And It’s Everything See more GOT7 "
        },
        "https://www.koreaboo.com/news/stray-kids-new-north-american-tour-dates-fans-around-world-next/": {
            "title": "Stray Kids Announces New North American Tour Dates, But Fans Around The World Are Wondering When They’ll Be Next",
            "content": "Stray Kids just dropped new North American tour dates, but some fans are wondering if the “and more” dates initially promised will extend outside of the US. Stray Kids | JYP Entertainment Stray Kids completed the start of their tour Stray Kids 2nd World Tour “MANIAC” in Seoul April 29 to May 1. From there they are set to play shows in Japan and North America as initially announced. Along with these dates, the phrase “AND MORE” was listed on the original poster. Fans still don’t know what this means for them. | @Stray_Kids/Twitter Due to high demand for their US stops, two additional shows were previously added in Newark and Los Angeles. Not all fans were pleased. Though the initial shows were marked as sold out, fans noted that many tickets were being immediately resold at highly inflated prices. Additionally, some fans thought the initial sale of tickets was unfair due to Ticketmaster‘s Official Platinum service. Stray Kids’ “MANIAC” Tour Sells Out, But STAYs Claim Barely Any Fans Got Tickets  | @Stray_Kids/Twitter Even so, more shows were just announced. They will be adding one show in Seattle, WA and will be holding two shows in Anaheim, CA. Stray Kids(스트레이 키즈) 2nd World Tour \"MANIAC\" in North AmericaAdditional Show Info Ticket Open 2022.05.09 (MON) 3PM (Local Time)https://t.co/JjF0JwYkr7 #StrayKids #스트레이키즈#2ndWorldTour_MANIAC#ODDINARY#MANIAC #MANIAC_SKZ#YouMakeStrayKidsStay pic.twitter.com/VP0L6W1q46 — Stray Kids (@Stray_Kids) May 4, 2022  Some fans think that the issue of a large amount of reseller tickets available still needs to be addressed first, considering these stops are still not technically “sold out.” Fans want to buy tickets, just not at the highly inflated prices. | Twitter Though many North American fans were wishing for additional dates in places other that the West Coast, fans around the world are wondering if this is what was meant by the “AND MORE” listed on the original tour poster. When is it our turn pic.twitter.com/0ulbjo9nFE — ᴇʟɪғ☻ 🔩sᴋᴢ ᴍᴀᴅᴇ ᴍᴇ ᴄʀʏ (@2MinSTAYClub) May 4, 2022  Fans of K-Pop artists have joked in the past about what a “world tour” means as many countries are often overlooked. | Twitter Some fans are hoping that adding more North American dates isn’t what they meant by “AND MORE.” | Twitter Fans specifically in Latin America and Europe are still waiting for their chance to buy tickets. | Twitter Hopefully more dates will be announced soon so that STAYs all around the world will get to see the hard work Stray Kids puts into their shows in person. 10+ Viral Moments From Stray Kids’ “MANIAC” Concerts In Seoul That STAYs Will Remember Forever Besties Stray Kids’ Changbin And CRAVITY’s Serim Snuck A Trending Move Into Their Performances Stray Kids’ Resident “Butt Hunter” Lee Know Had The Tables Turned On Him During Their Concert Stray Kids’ I.N Crashes Bang Chan’s Live And Proves He Really Is The “Maknae On Top” See more Stray Kids "
        }
    }
}