{
    "web": {
        "https://metro.co.uk/2022/03/03/btss-jungkook-graduates-from-university-with-prestigious-award-16207059/": {
            "title": "BTS’s Jungkook graduates from university with prestigious President’s award proving there’s nothing he can’t do",
            "content": "BTS’s Jungkook has graduated his broadcasting and entertainment course from the Global Cyber University with the President’s award, a prestigious honour.  The K-pop star, 24, managed to fit his studies in around being part of one of the world’s biggest bands alongside Jimin, V, Jin, J-Hope, Suga and RM, graduating with flying colours.  The Grammy-nominee made a speech to mark the occasion which the university shared on YouTube to celebrate his graduation.  He told fans: ‘Hello, I am Jeon Jungkook, majored in broadcasting and entertainment at the Global Cyber University in the year of 2017, who will graduate today.’ Asked how she felt about graduating, Jungkook said: ‘Graduation is an end and a beginning and I guess that is the reason why I feel very touched and excited.’ He added: ‘From President Ilchi Lee to many other professors and staff members, I pay sincere gratitude and congratulations to my peers who are graduating today as well.’ Speaking about being given the President’s award, Jungkook added: ‘Thank you for this great award and I’ll do my best to become a good role model for junior students.’ Jungkook also encouraged his fans to go for their own dreams and further education, telling them: ‘Learning something is always a very exciting and fabulous experience.  ‘I hope we all cherish this present moment and put sincere effort into our beloved dreams. I’ll always cheer for your dreams.’ He then promised: ‘I’ll try my best to make more beautiful music performances for our beloved fans. Thank you.’ Unmissable K-Pop festival HallyuPopFest heading to London this summer Jungkook’s graduation comes just a week after BTS were named the International Federation of the Phonographic Industry’s (IFPI) global recording artist of the year.  The band made history as the first act to win the award for two consecutive years, with the award being calculated according to an artist’s or group’s worldwide performance across digital and physical music formats during the year – including music downloads, streams and physical sales – and covers their entire body of work. MORE : BTS star Jungkook covers Harry Styles’ song and fans are Falling over the stunning rendition MORE : BTS’s Jungkook sends the Army wild as they try to figure out whether his new lip piercing is real "
        },
        "https://metro.co.uk/2022/04/13/k-pop-festival-hallyupopfest-heading-to-london-this-summer-16462080/": {
            "title": "Unmissable K-Pop festival HallyuPopFest heading to London’s Wembley Arena this summer",
            "content": "K-Pop fans it’s time to get excited as a festival dedicated to the genre is heading to London this summer. HallyuPopFest will be making its first foray into the capital this July following huge success as one of South East Asia’s largest Korean music festivals. The best of Korean music and lifestyle will converge on July 9 and 10 at OVO Arena Wembley with the likes of ASTRO, EVERGLOW, Hwasa, SF9, CRAVITY, and ONEUS on the bill. More headliners and artists will be announced in the coming weeks with a total of 14 performing acts across two days. Every ticket gives festivalgoers access to two concert events per day – the afternoon showcase and the three-hour evening concert where headliners will perform individual sets.  Each event day, revelers will get an all-in-one, day-to-night experience, starting with activities at HallyuTown. Ticketholders will be able to enjoy an array of performances by up-and-coming K-pop and indie artists, the red carpet event, artist engagement opportunities, and finally the spectacular evening concert featuring the headline acts. This year’s first HallyuPopFest event in London will also treat fans to the best of all things Korean.  HallyuTown will function as the main festival square and will be open to the public, offering a variety of Korean-centric booths and activities featuring K-Food, K-Beauty and K-Lifestyle. ‘HallyuPopFest came about because we wanted to create a festival experience where K-pop fans from all over, from various fandoms, could come together and celebrate their fervent idol support, boundless energy and love for music and dance that are the cornerstones of K-pop,’ CEO Selena Ho enthused. Tickets for HallyuPopFest 2022 go on sale here at 10am on Wednesday 20 April. Sign up here for pre-sale tickets, which will become available at 10am on Tuesday 19 April.  Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.  Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you.  "
        },
        "https://metro.co.uk/2022/03/16/btss-jungkook-changes-instagram-username-leaving-fans-sad-16284701/": {
            "title": "BTS’s Jungkook changes Instagram handle and fans are devastated that ‘iconic’ alphabet username is ‘not available’",
            "content": "Jungkook from BTS has got the Army in a frenzy after a sudden change to his Instagram username, leaving fans mourning the old one. The K-pop star, 24, had been nicknamed the ‘alphabet guy’ by fans after signing up to Instagram with the username ‘@abcdefghi__lmnopqrstuvwxyz’. However, the singer appeared to have had enough of the lengthy handle and opted to change it to his name and year of birth, @jungkook.97 without warning. While all of Jungkook’s 29 existing posts and his 34.4million followers transferred over with him, the unexpected change did mean his old account was showing up as ‘page not available’. The Army were left pretty devastated that the ‘alphabet guy’ username was now defunct, taking to Twitter to write: ‘can’t call jungkook “user alphabet” anymore it’s a terrible terrible day for me i’ll need a minute.’ Another added: ‘no one gets it. jungkook’s alphabet username was pure genius, revolutionary, got famous brands and everyone talk about it. jungkook earned the nickname “alphabet guy” because of it, he was so proud of it and no one could’ve come up with that, except him.’ canâ\u0080\u0099t call jungkook â\u0080\u009cuser alphabetâ\u0080\u009d anymore itâ\u0080\u0099s a terrible terrible day for me iâ\u0080\u0099ll need a minute me still searching with username #abcdefghi__lmnopqrstuvwxyz and realized it had changed to jungkook.97 pic.twitter.com/vohVIYkjd0 no one gets it. jungkook’s alphabet username was pure genius, revolutionary, got famous brands and everyone talk about it. jungkook earned the nickname ‘alphabet guy’ because of it, he was so proud of it and no one could’ve come up with that, except him abcdefghi_lmnopqrstuvwxyz, you will always be iconic, the trendsetter. Absolutely brilliant of Jungkook for this username. the impact of this is insane! pic.twitter.com/dn81m3O5fh Biggest flex we have seen jungkook alphabet username and have called him by that name many times future armys won’t be able to relate Weâ\u0080\u0099re really out there screaming that Jungkook changed his username for all the world to see! Weâ\u0080\u0099re so dramatic ð\u009f\u0098\u0086 pic.twitter.com/sKlijBiTjo no cuz jungkook’s IG username got so many people making it his brand and talking about it. he really is a trendsetter and the blueprint. user alphabet you will always be famous. Others commented: ‘abcdefghi_lmnopqrstuvwxyz, you will always be iconic, the trendsetter. Absolutely brilliant of Jungkook for this username. the impact of this is insane!’ and ‘We’re really out there screaming that Jungkook changed his username for all the world to see! We’re so dramatic.’ The idol has recently been sharing snaps of himself in powerful poses performing at BTS’s three sold out concerts at the Jamsil Olympic Stadium in Seoul, South Korea. Unmissable K-Pop festival HallyuPopFest heading to London this summer Jungkook’s old username had been the whole alphabet with the letters JK – which he often goes by – taken out and replaced with an underscore. While it may not be his handle any longer, something tells us User Alphabet won’t ever be forgotten by the fans. Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you. MORE : BTS star Jungkook struggles to perform when fans aren’t singing as South Korea introduces ‘cheering ban’ amid Covid-19 surge MORE : BTS’s Jungkook graduates from university with prestigious President’s award proving there’s nothing he can’t do  "
        },
        "https://metro.co.uk/2022/03/29/btss-jungkook-tests-positive-for-covid-19-after-arriving-to-us-16365944/": {
            "title": "BTS’s Jungkook tests positive for Covid after arriving in US for Grammys as he experiences ‘mild’ symptoms",
            "content": "BTS star Jungkook has tested positive for Covid-19 but is experiencing ‘mild’ symptoms, according to the band’s management.  Big Hit Music confirmed that the singer, 24, had tested positive after arriving in the US just days after fellow member J-Hope also caught Covid ahead of flying out.  They claim Jungkook had tested negative on a PCR test on March 27 ahead of the band’s flight tp Las Vegas.  He took a rapid test and a PCR test after his arrival in America which both came back positive after experiencing discomfort in his throat, Big Hit said. The agency told fans, per Soompi: ‘Jungkook has been currently under self-quarantine and treatment, following the guidelines of health authorities in the United States. ‘He is not exhibiting any symptoms other than a mild sore throat, and we will attentively monitor his health during the quarantine.’ BTS are due to perform at the 2022 Grammys on April 3, before starting a Las Vegas residency across four nights on April 8, 9, 15 and 16.  The agency confirmed that Jungkook’s participation in the shows ‘will be determined by the local Covid-19 regulations.’ It added: ‘We would like to extend our sincerest apologies to our fans for causing you concern despite our effort to take all necessary measures for our artists’ health prior to and throughout the schedule in the United States. ‘We ask for your generous understanding and support. We will continue to provide support for the rapid recovery of Jungkook, placing our highest priority on the health and safety of our artists.  Unmissable K-Pop festival HallyuPopFest heading to London this summer ‘We will also continue to fully cooperate with the requests and guidelines of healthcare authorities.’ Jungkook is the final member of BTS to have contracted coronavirus in recent months, with Jimin, Jin, Suga, RM, V and J-Hope all also having had it. Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you. MORE : BTS’s Jungkook changes Instagram handle and fans are devastated that ‘iconic’ alphabet username is ‘not available’ MORE : BTS star Jungkook struggles to perform when fans aren’t singing as South Korea introduces ‘cheering ban’ amid Covid-19 surge  "
        },
        "https://metro.co.uk/2022/02/16/bts-confirm-first-in-person-concerts-permission-to-dance-on-stage-16117647/": {
            "title": "BTS confirm first in-person and online concerts, Permission To Dance On Stage Seoul, in March",
            "content": "BTS are set to make their long-awaited return to the stage in Korea in March, with their first in-person shows in Seoul since the pandemic began.  The band announced they would be performing three shows on March 10, 12 and 14 at Seoul Olympic Stadium, the first time they have appeared before a live crowd in Korea in approximately two and a half years.  For fans who are based overseas, there will also be a live stream, so no ARMYs will have to miss out on seeing their first shows back.  The BTS Permission To Dance On Stage – Seoul shows are the first time the band has performed in front of a live audience since the BTS world tour Love Yourself: Speak Yourself [The Final] which was held at the same venue in October 2019.  The online live stream will be available on March 10 and 13, with March 12’s performance being broadcast in cinemas worldwide through a ‘Live Viewing’ event. More information on the concerts is set to be announced on Weverse, the global fan community, in due course.  Fans have been awaiting news of when Jungkook, RM, Jin, Suga, J-Hope, Jimin and V would be returning to live shows after the band performed virtually amid the pandemic.  The announcement comes after it was confirmed that Jimin had been released from hospital and isolation after having Covid-19 and appendicitis.  The 26-year-old had been diagnosed with acute appendicitis and tested positive for Covid-19 in January, and required surgery.  BTS’s agency, Big Hit Entertainment, issued a statement on February 5 reassuring fans that Jimin was on the mend.  Unmissable K-Pop festival HallyuPopFest heading to London this summer They said at the time: ‘We deeply thank the fans for worrying about the artist’s health and the medical staff who are working hard to overcome Covid-19. ‘We will continue to consider the health and safety of our artists as our top priority and faithfully follow the quarantine guidelines.’ Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you. MORE : BTS star Jimin discharged from hospital after Covid-19 and appendicitis MORE : BTS star Jimin shares health update after he contracted appendicitis and Covid-19: ‘I am recovering well!’  "
        },
        "https://metro.co.uk/2021/12/08/coldplay-pay-sweet-tribute-to-younger-brothers-bts-in-radio-2-gig-15738953/": {
            "title": "Coldplay’s Chris Martin pays sweet tribute to ‘younger brothers’ BTS during intimate BBC Radio 2 gig",
            "content": "Coldplay frontman Chris Martin took the opportunity to shout out the South Korean boyband at their Radio 2 concert after they recently collaborated with the group on the hit song My Universe. The four-piece were back to perform at the BBC ahead of a string of arena shows set to take place next year. During the one-off performance for the broadcaster, Coldplay gave their all in a typically high-energy set mixed with old and new tracks. Their most recent hit My Universe was originally released on their latest album Music of The Spheres, and they performed it for an extremely lucky bunch of fans on Tuesday evening.   A very sweaty Chris used the moments before their performance to hype up their collaborators BTS. He told the audience: ‘It’s our first song half in Korean, we’re so happy to be doing this one. ‘This is with our brothers in BTS, our younger brothers.’ Chris went on to comment: ‘Some of you may not know who that is, but they’re so great!’ The performance featured the singer attempting to cover some of the vocals, whilst some of BTS’s pre-recorded parts weaved into the track. He sang their praises prior to the show too, telling Radio 2 presenter Ken Bruce: ‘BTS are definitely the biggest boy band in the world right now.’ The two bands got together to perform the track in-person for their first time since its release at last month’s AMAs in Los Angeles. Chris swapped vocals with the seven members of the group before their joint effort finished with the singers jumping in time to pyrotechnics. “@BTS_bighit are definitely the biggest boy band in the world right now.” ð\u009f\u0092\u0096This week, @coldplay’s Chris Martin joined @realkenbruce ahead of their ‘In Concert’ to talk about how ‘My Universe’ came about â\u009c¨Listen in full on @BBCSounds: https://t.co/Q2kj7tkHKs#BTS #Coldplay pic.twitter.com/HLFc7ejF4h Coldplay also thanked someone else very special during their latest gig, in the form of Radio 2’s Jo Whiley – who also hosted the show. The lead singer dedicated a very raw rendition of Yellow to the DJ, saying: ‘Because for good or for bad, without Jo there really would be no Coldplay so you can either thank her or blame her! Life on Mars creators confirm 'pilot script' revival 'is completed' 12 years after sequel Elon Musk documentary in the works at BBC from team behind Jimmy Savile Netflix series Doctor Who's Mandip Gill stresses it is the end for Yaz – but maybe not forever She’s been looking after us now since we were about 9 [laughs]. We were just a baby band then. She took us under her wing and a lot of other people did too – don’t get me wrong – but Jo has been with us the whole time. ‘It just makes us so happy when we get to do things with her all these years later, when she’s still only 31 and we somehow have become old men! This is I think the first song we ever played on her show.’ BBC Radio 2 In Concert with Coldplay is now available to watch on BBC iPlayer and listen on BBC Sounds. Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you. MORE : Strictly Come Dancing judges’ scoring is getting ridiculous MORE : Ant McPartlin and Dec Donnelly dragged into PMQs after blistering Boris Johnson swipe on ‘fictional’ Downing Street party  "
        },
        "https://metro.co.uk/2021/12/24/bts-suga-tests-positive-for-covid-after-flying-back-to-korea-15818872/": {
            "title": "BTS star Suga tests positive for Covid after jetting back to Korea but showing no symptoms",
            "content": "BTS singer Suga has tested positive for Covid, it has been confirmed, hours after flying back to Korea.  The Dynamite hitmaker jetted back to his native country on Thursday following a stint in the US where BTS performed the first set of shows in two years.  However, after taking a PCR test while in quarantine, Suga received a positive result for the virus but fortunately, is currently showing no symptoms.  The K-pop group’s agency Big Hit Music announced the news in a statement, explaining: ‘BTS member Suga was confirmed with Covid-19 on Friday, December 24 during his self-quarantine after taking the PCR test immediately upon his return to Korea on Thursday, December 23. ‘Suga completed his second round of the Covid-19 vaccination in late August and is not presenting any symptoms as of today. He is currently administering self-care at home per the guidelines of the healthcare authorities.’  The agency continued: ‘Suga, who had a number of personal engagements in the United States during BTS’s official time off, tested negative for the PCR test taken before traveling to the United States and began his self-quarantine after taking the PCR test upon his return to Korea.  ‘He received positive results during quarantine, and there was no contact with the other members.’  The company added that it prioritises its artists’ health and ‘will do everything we can to aid Suga in his speedy recovery’.  ‘We will also diligently cooperate with the requests and guidelines of the healthcare authorities,’ they added.  At this stage, the test results of the other BTS members are currently unknown.  It comes after Suga recently discussed his dedication to the group, stating he plans on performing with BTS ‘until I die’.  Speaking to Vogue Korea, he said: ‘I think I’ll be in BTS until I die. I just like BTS.  ‘I’m often asked how I’d like to try producing [a group] but I don’t think I’d be able to. I don’t have that much responsibility to be responsible for someone else. I’ll always be a member of BTS.’ Unmissable K-Pop festival HallyuPopFest heading to London this summer He also said people have suggested he should ‘become a full-time producer’, but Suga can’t see it happening as he’s more than content ‘being part of BTS’. In November, BTS graced the stage in Los Angeles to perform their first gig with a live audience in two years.  It was announced shortly after that the Boy With Luv singers will be taking an ‘extended period of rest’ to recharge.  Got a story? If you’ve got a celebrity story, video or pictures get in touch with the Metro.co.uk entertainment team by emailing us celebtips@metro.co.uk, calling 020 3615 2145 or by visiting our Submit Stuff page – we’d love to hear from you. MORE : Sex And The City bosses planned ‘beautiful last scene’ between Stanford and Carrie before Willie Garson death MORE : Richard Bacon gets his legs out in shorts and hotel slippers to host Good Morning Britain  "
        }
    }
}