{
    "web": {
        "https://www.nme.com/news/tv/lily-allen-compares-kylie-jenners-met-gala-dress-to-her-2006-v-festival-outfit-3217334": {
            "title": "Lily Allen compares Kylie Jenner’s Met Gala dress to her 2006 V Festival outfit",
            "content": "Lily Allen has responded to fans who have been comparing Kylie Jenner’s Met Gala dress with her bridal-inspired outfit from V Festival. Jenner attracted attention at the celebration of fashion at the Metropolitan Museum Of Art in New York on Monday (May 2), where she wore a wedding dress from Off-White with a white cap and veil. On social media, fans began to compare Jenner’s dress with Allen’s outfit from V Festival in 2006, where the singer sported a snapback and strapless dress. Posting on Instagram, one fan wrote: “@kyliejenner is giving off @lilyallen at the 2006 V Festival vibes.” Lily Allen shared the comparison on Instagram CREDIT: Instagram Allen, who also attended the ceremony with her husband David Harbour, reposted the picture to her Instagram Story, with the caption: “Lol.” Following the Met Gala, Jenner explained how the outfit was a tribute to fashion designer Virgil Abloh, who died from cancer in November last year. “Virgil and I were supposed to go to the Met together before it got postponed in 2020, to celebrate V tonight and his incredible legacy truly means the world to me,” Jenner wrote on Instagram. “I’m humbled to wear this dress and honour my talented beautiful friend. We felt you tonight Virgil and love you forever & thank u to the entire @off__white team!!”  Last year, Allen made her West End debut in supernatural thriller 2:22, where she starred alongside Julia Chan, Hadley Fraser and Jake Wood. Her performance as Jenny was nominated for Best Actress at the 2022 Laurence Olivier Awards. "
        },
        "https://www.nme.com/news/music/sex-pistols-to-reissue-god-save-the-queen-to-mark-the-queens-platinum-jubilee-3217322": {
            "title": "Sex Pistols to reissue ‘God Save The Queen’ to mark the Queen’s Platinum Jubilee",
            "content": "Sex Pistols are set to reissue their classic single ‘God Save The Queen’ to mark the Queen’s Platinum Jubilee next month. The protest song was officially released by the band via Virgin in May 1977. Despite being banned by the BBC, it reached number one on the NME chart and number two on the UK’s singles chart (the track was listed as a blank on the latter to avoid causing offence). Prior to that, however, the band had been controversially dropped by their previous label A&M, prompting the destruction of 25,000 unreleased copies of ‘God Save The Queen’. Only a handful of copies of the original A&M release remain, with one selling for £13,000 back in 2019. Ahead of the Queen’s Platinum Jubilee, which will be celebrated in the UK from June 2-5 to mark Queen Elizabeth II’s 70 years on the throne, the Sex Pistols will reissue both the Virgin and A&M versions of ‘God Save The Queen’ on May 27 via UMC. Sex Pistols – ‘God Save The Queen’ reissue (Picture: Press) 1,977 7″ copies of the A&M version of the single, which features the B-side ‘No Feeling’, will be made available, while 4000 7″ copies of the Virgin-released ‘God Save The Queen’ (featuring the B-side ‘Did You No Wrong’) will go on sale. Both versions of the single will feature their original artwork, with the A&M edition featuring its generic company sleeve and being pressed on silver/platinum vinyl. The Virgin single will feature the Jamie Reid-designed Sex Pistols artwork. Pre-order is available now from here.  Sex Pistols frontman John Lydon recently distanced himself from the band’s compilation ‘The Original Recordings’, which is set for release later this month. “He and his team were not involved in producing this compilation and consider it substandard compared to previous Universal releases since 2012,” a statement on the singer’s Facebook page read. "
        },
        "https://www.nme.com/news/film/taylor-swift-discuss-all-too-well-short-film-new-york-tribeca-film-festival-3216897": {
            "title": "Taylor Swift to discuss ‘All Too Well’ short film at New York’s Tribeca Film Festival",
            "content": "Taylor Swift will appear at New York’s Tribeca Film Festival next month to discuss and screen her All Too Well short film. Last year, the pop star released the 15-minute film to accompany the release of ‘All Too Well (10 Minute Version) (Taylor’s Version)’, which featured on the re-recorded version of her 2012 album ‘Red’. Tribeca Film Festival will host a special screening of All Too Well: The Short Film, which was directed, written and produced by Swift. After the screening, an “in conversation” event will be held where she will discuss her approach to filmmaking. The event will take place at New York’s Beacon Theater on June 11 and is one of a handful of music-related features at this year’s festival.  Elsewhere, Pharrell will discuss his career at the Borough of Manhattan Community College on June 10, while Common will take part in a conversation with journalist Charles Blow. The rapper is also set to receive the festival’s second annual Harry Belafonte Voices for Social Justice Award and will be presented with the trophy by Robert De Niro. Visit the Tribeca Film Festival website for the full line-up and for information on tickets, including ‘At Home’ passes. Swift will continue her film career with an appearance in David O. Russell’s Amsterdam. The star joins the likes of Margot Robbie, John David Washington, Christian Bale, Chris Rock and Zoe Saldana in the movie. She can be seen in the trailer as a mourning daughter, breaking down in tears before her father’s body as Rock and Bale look on.  The musician has previously appeared in the live-action version of Cats in 2019, as well as 2014’s The Giver and 2012’s The Lorax. Meanwhile, music exec Scooter Braun recently spoke out about acquiring Swift’s masters when he bought her former record label, Big Machine Records, and how he doesn’t appreciate artists “weaponising” their fanbase. "
        },
        "https://www.nme.com/news/music/lance-bangs-announces-new-alternative-rock-docuseries-i-dont-belong-here-3217170": {
            "title": "Lance Bangs announces new alternative rock docuseries ‘I Don’t Belong Here’",
            "content": "American director Lance Bangs is set to helm a new docuseries entitled I Don’t Belong Here, which will focus on the rise of alternative rock in the 1990s. The series, announced yesterday (May 2), will be made by the production company Anonymous Content, although it’s unclear which network it will appear on. It marks Bangs’ return to television after several years, having worked on episodes of Portlandia and The Meltdown With Jonah And Kumail in the mid-2010s. The series’ title is taken from the chorus of Radiohead‘s 1993 hit ‘Creep’, which has gone on to be regarded as one of the most notable alt-rock songs of the decade. A synopsis for the series, provided to Deadline, describes the sub-genre’s commercial rise in the ’90s as “an absurd and surreal moment” in music history. “These are the stories – told by the musicians, scouts, producers and label heads – who did their best to make sense of a time that made no sense, when dope-fiending punk rock trolls swindled seven-figure advances and an anarchist Japanese noise collective wound up as labelmates with Fleetwood Mac,” it continued.  Bangs was a notable contributor to ’90s alt-rock via his prolific work as a music video director. Amongst those within the genre he worked with at the time are R.E.M., Pavement, Sonic Youth and Green Day. Bangs is also married to Corin Tucker, a member of ’90s alt-rock band Sleater-Kinney. Bangs shared the Deadline announcement in a screenshot posted to his Instagram page. In the caption, he also called for additional contributors to assist in making the series as comprehensive as possible. “I’m sure there are more stories from this era to learn from,” he wrote, “so reach out if you have them.” Outside of his music-related work, Bangs was seen on cinema screens earlier this year as a cameraman for Jackass Forever. Bangs has worked closely with the stunt and prank collective since their MTV series in 2000, and has appeared in all of their movies thus far. "
        },
        "https://www.nme.com/news/music/watch-the-video-for-khalids-breezy-new-single-skyline-3217202": {
            "title": "Watch the video for Khalid’s breezy new single ‘Skyline’’",
            "content": "Khalid has shared a new single titled ‘Skyline’, released alongside a music video directed by Levi Turner and Cody LaPlant. The video puts Khalid – as well as a full cast of backup dancers – in a series of summery settings around a grassy mountainside landscape. It marks the second time Khalid has worked with Turner and LaPlant on a clip, following on from March’s ‘Last Call’. Have a look at the video for ‘Skyline’ below:  In a statement shared with the song’s release last week, Khalid described ‘Skyline’ as “a recharge” that is “full of summer vibes”. He continued: “I hope it brings my fans joy and gets them through any dark times they may be going through.” ‘Skyline’ marks the second track shared from Khalid’s forthcoming third album, ‘Everything Is Changing’, following the release of lead single ‘New Normal’ last July. The record itself was originally due to land at the end of 2021, but is still yet to receive an official release date.  Khalid did, however, issue a mixtape titled ‘Scenic Drive’ in December. A month prior, he also linked up with Mariah Carey for a festive single titled ‘Fall In Love At Christmas’. Most recently, Khalid performed with Billie Eilish at this year’s Coachella, joining her to perform a duet of their 2018 track ‘Lovely’. "
        },
        "https://www.nme.com/news/music/graham-coxon-elinor-dougal-the-waeve-announce-second-london-show-3216910": {
            "title": "Graham Coxon and Elinor Dougal’s The Waeve announce second London show",
            "content": "Graham Coxon and Rose Elinor Dougall‘s new project The WAEVE have announced a second London show, due to high demand. The former Blur guitarist-turned-solo star and the former Pipettes member-turned-Mark Ronson collaborator previously shared details of an intimate launch show at The Lexington set for May 4. Following that gig selling out, The WAEVE have shared that they’ll be playing on May 6 as well. The new date will follow the release of their single ‘Something Pretty’ which is set to drop on May 5 via Transgressive Records. Tickets for the new date are available here. One week to go – The WAEVE will be performing a second show at @TheLexington, London on Friday 6th May. Limited tickets now remaining, don't miss out: https://t.co/oHUG4DsYAk pic.twitter.com/pjX0qzHXUS — The WAEVE (@The_Waeve) April 29, 2022  “We are greatly looking forward to unleashing our new sound live at the Lexington,” the band previously said in a statement. “We’ve been locked away, busy translating the varied sounds of our songs into a dynamic live show, with the help of some great musician friends. We invite you to surrender to the world of The WAEVE.” The duo came together after exchanging messages during the lockdown Christmas of 2020. They soon started writing songs before their collaboration “gave rise to an unexpected sonic universe”, a statement explains. Inspired by “a shared love of English folk music, storytelling and the associated landscapes of this beleaguered island,” their music soon turned into something of their own, with “a cinematic breadth whilst maintaining an honest intimacy” and “guitars, saxophones AND strings lifting the songs into other stratospheres”. Their upcoming music is said to speak to “themes of oblivion and surrender, juxtaposed with suggestions of hopefulness and light”.  Last year saw Coxon release the comic book score album ‘Superstate‘, as well as tease more activity from Blur. After bandmate Damon Albarn claimed that Blur had been in talks and “had an idea” of how to make their return, the guitarist told NME: “I was privy to that discussion. It started as a discussion, but didn’t really end as one.” Asked if he was too busy with various projects to pursue a Blur reunion, he told us: “Having a lot on your plate is a sort of chaos. It’s like a massive English breakfast at the moment. If someone snuck on a grilled tomato I probably wouldn’t notice. I’m up for it if everyone digs the idea.”  The WAEVE are also set to play The Great Escape Festival in Brighton on May 12. "
        },
        "https://www.nme.com/news/music/kacey-musgraves-will-cover-cant-help-falling-in-love-for-elvis-soundtrack-3217181": {
            "title": "Kacey Musgraves will cover ‘Can’t Help Falling In Love’ for ‘Elvis’ soundtrack",
            "content": "Kacey Musgraves is set to feature on the soundtrack for the upcoming Elvis Presley biopic Elvis, contributing a cover of Presley’s ‘Can’t Help Falling In Love’. The singer revealed her addition to the soundtrack on the red carpet of the 2022 Met Gala. Variety reports that Musgraves was in attendance alongside both Priscilla Presley and Elvis‘ director, Baz Luhrmann. While Luhrmann would only hint that Musgraves’ song on the soundtrack was “something to do with love”, Musgraves herself confirmed it would be her version of Presley’s best-known love song.  Musgraves is one of only two artists to have songs confirmed for the Elvis soundtrack. The other is Doja Cat, who will feature on the soundtrack with an original song entitled ‘Vegas’ that samples Presley’s 1956 single ‘Hound Dog’. The film will premiere at Cannes Film Festival this month, before its cinematic release in late June. Released in 1961 – fittingly, also as part of a soundtrack, for Presley’s Blue Hawaii – ‘Can’t Help Falling In Love’ hit Number One in the UK upon its release and peaked at Number Two in the US. It has been covered dozens of times in the decades since, most notably by UB40 in 1993 – which also went to Number One in the UK. The song has also been covered to feature on other film soundtracks, including Lilo & Stitch and Crazy Rich Asians. Musgraves is currently touring in support of her 2021 album, ‘Star-Crossed’. In a four-star review, NME described the album as “a powerfully honest depiction of heartbreak”. “This record, with its varied sounds and brutally honest lyrics, never finds Musgraves shying away from the uncomfortable,” it read. "
        },
        "https://www.nme.com/news/music/kehlani-loses-sleep-in-old-school-up-at-night-video-watch-3218657": {
            "title": "Kehlani loses sleep in choreography-filled ‘Up At Night’ video",
            "content": "Kehlani has shared the official video for their latest single ‘Up At Night’ – you can watch it below. The song appears on the Californian R&B artist’s third studio record ‘Blue Water Road’, which came out last Friday (April 29). Justin Bieber features on the album version of the track, but is notably absent from the new visuals. At the start of the clip, Kehlani – full name Kehlani Ashley Parrish – asks their phone to “play my sleep playlist” before getting into bed. She then sings ‘Up At Night’ with their eyes closed as sinister-looking silhouette figures are cast across the sheets. Suddenly, we switch to a scene that sees Kehlani and a crew of backup dancers unleash a ’00s girl group-style choreographed routine. The star appears in various other locations – including a glitzy black-and-white setting – but ultimately ends up back in bed. Explaining the meaning behind the song, Kehlani said: “It’s about having a healthily obsessed relationship. You’re telling someone, ‘I love you so much it keeps me awake at night’.” Tune in here:   Speaking to NME for last week’s Big Read cover feature, Kehlani criticised Noel Gallagher over his recent comments regarding authenticity in music. The singer recalled her own time on American Idol in 2011 while talking about Harry Styles‘ X Factor beginnings. Gallagher had said that such shows have “got nothing to do with music whatsoever”, before singling out Styles as an example. “That person [Gallagher] – whoever that is – can kiss my ass,” Kehlani told NME. “They might as well call me inauthentic and I’m about as authentic as it gets.” Elsewhere in the conversation, the artist said they were feeling “lighter, more mature [and] happy” after taking part in a year-long ritual cleanse. She embraced sobriety, only went out for work-related reasons, covered their hair and more as part of the “ceremony process”. In a four-star review of ‘Blue Water Road’, NME said that the album largely “finds Kehlani in spectacular form – softer, stronger and better than ever”. "
        },
        "https://www.nme.com/news/music/watch-fontaines-d-c-perform-three-tracks-cbs-saturday-morning-live-3216891": {
            "title": "Watch Fontaines D.C. perform three tracks on ‘CBS Saturday Morning’",
            "content": "Fontaines D.C. performed three tracks during an appearance on CBS Saturday Morning over the weekend (April 30) – check out the videos below. The Dublin band played live renditions of one track from each of their three studio albums – ‘Liberty Belle’ from ‘Dogrel’ (2019), ‘Oh Such A Spring’ from ‘A Hero’s Death’ (2020) and ‘Jackie Down The Line’, which features on their recent record ‘Skinty Fia’. For their latest US TV outing, Fontaines D.C. recorded the performance in a minimal black studio space. It came after the group recently appeared on Late Night With Seth Meyers while out on their 2022 North American headline tour, which wraps up in Los Angeles on May 19. You can find any remaining tickets for the current dates here. Watch Fontaines D.C.’s Saturday Sessions performances beneath:    Last Friday (April 29) saw the band bag their first Number One album in the UK and Ireland with ‘Skinty Fia’. The record outsold its closest competition in the Official UK Albums Chart, Ed Sheeran‘s ‘=’, two-to-one. Physical sales accounted for 87 per cent of the album’s total figures. “You gave us our first NUMBER 1 with ‘Skinty Fia’ in both the UK and in Ireland,” Fontaines D.C. tweeted. “Thanks to all who went out and got it. Thanks to everyone we work with. Love ye x.” In a five-star review of the LP, NME wrote: “No matter how tormented this album gets, you can feel ‘Skinty Fia”s wounded heart beating throughout. The fight for a better Ireland deserves songs that mirror the depth of the crisis, and in its endlessly captivating glory, ‘Skinty Fia’ rises triumphantly to the task.”  Fontaines D.C. will perform at various UK festivals over the summer, including Glastonbury, TRNSMT, Latitude and Reading & Leeds. In November, they’ll embark on their recently extended UK and Ireland headline tour – purchase any remaining tickets here. "
        },
        "https://www.nme.com/news/music/pete-davidson-addressed-kanye-wests-harassment-at-netflix-is-a-joke-festival-3216333": {
            "title": "Pete Davidson addressed Kanye West’s harassment at Netflix Is A Joke festival",
            "content": "During his back-to-back sets on the first night of the inaugural Netflix Is A Joke festival – which runs until Sunday (May 8) – Saturday Night Live star Pete Davidson addressed his long-running feud with Kanye West. Davidson appeared at the festival last Friday (April 29) to premiere his new show, Pete Davidson And Best Friends, which was filmed for release on Netflix later in the year. To a sold-out crowd at Los Angeles’ Fonda Theatre, he opened the set by nudging at the claims that West tried to spread rumours about Davidson – who is currently dating West’s ex-wife, Kim Kardashian – having AIDS. “I had an AIDS scare this year,” he quipped (per Variety), telling his audience that he got himself tested for the condition since West is a “genius”. He assured fans that he does not, in fact, have AIDS – he just looks like he does. Davidson reportedly went on to talk about feeling stuck when it came to responding to West’s harassment, with none of the people in his inner circle able to give him advice for the situation. Another joke in the set – for which Kardashian was in attendance – saw Davidson warn Jon Stewart about a violent curse he may be entangled in; the comedian recalled going to a basketball game with him and Chris Rock last December, teasing that “Chris got slapped [and] I got decapitated”. The line referenced West’s video for his recent collaboration with The Game, ‘Eazy’, in which the rapper kidnaps and kills a claymated version of Davidson.  A second video for ‘Eazy’, shared weeks after the first, also saw Davidson brutalised. In the clip, an animated version of the skinned money from the single’s cover art pins down a blurred-out avatar of Davidson, walloping him with a string of punches over West’s lyric: “God saved me from that crash / Just so I can beat Pete Davidson’s ass.” Though he initially kept quiet on the matter, Davidson responded to West’s attacks a few days after the second ‘Eazy’ video laded, writing to the rapper in a text: “I’ve decided I’m not gonna let you treat us like this anymore and I’m done being quiet.” When West responded and asked Davidson where he was, the comedian sent back a selfie and wrote that he was “in bed with your wife”. West then said he was “happy to see [Davidson] out of the hospital and rehab”, to which Davidson replied: “Same here. It’s wonders what those places do when you go get help. You should try it.” At the end of Davidson’s sets at Netflix Is A Joke: The Festival, Machine Gun Kelly – a close friend, former housemate and longtime collaborator of the comedian – came onstage to perform a surprise three-song set. The pair duetted on the ‘Mainsteam Sellout’ cut ‘ay!’, while MGK (real name Colson Baker) performed ‘Candy’ and ‘make up sex’ by himself. Take a look at Davidson introducing Baker’s mini-set below:  Later this month, Davidson will star in Baker’s directorial debut, Good Mourning, as an aggressive valet driver. The film will be out on May 20 – see the first trailer here. Later in the year – on August 5, to be exact – Davidson will star alongside Amandla Stenberg and Maria Bakalova in the comedy-horror film Bodies Bodies Bodies. "
        },
        "https://www.nme.com/news/music/alana-haim-covers-a-goofy-movie-track-at-fans-request-3217290": {
            "title": "Alana Haim covers ‘A Goofy Movie’ track at fan’s request",
            "content": "Alana Haim has performed a cover of the song ‘I2I’, which appears in the 1995 Disney animation A Goofy Movie, following an audience request. Haim has expressed her love of the film on multiple occasions, telling Vice in January: “People make fun of me, but my favourite movie is A Goofy Movie. “If you haven’t seen it, you need to watch A Goofy Movie. It’s the best movie of all time.” The musician and actor has now performed her own version of ‘I2I’, which is performed by Tevin Campbell as the character Powerline in the original film, during a Haim show in Phoenix, Arizona. You can take a look below. Alana Haim being the number 1 A Goofy Movie stan at their concert #haim #concert #alanahaim #phoenix #fyp  ♬ original sound – Joel    Haim kicked off their North American ‘One More Haim’ tour last month in support of their third studio album, 2020’s acclaimed ‘Women In Music Pt. III’. The opening show in Las Vegas featured the live debut of ‘Leaning On You’ – you can find fan footage, the setlist and full details here.  Haim are due to return to the UK this summer to play Glastonbury 2022 before embarking on their COVID-delayed ‘One More Haim’ stint on these shores in July. Any remaining tickets for those dates can be found here. Last month saw Haim release a new standalone song called ‘Lost Track’, which arrived with a video directed by Paul Thomas Anderson. The sisters described the finished track and its accompanying visuals as being “very collaborative” and “off the cuff”. "
        },
        "https://www.nme.com/news/music/morgan-wallen-performing-2022-billboard-music-awards-racial-slur-3216443": {
            "title": "Morgan Wallen to perform at Billboard Music Awards after being banned from 2021 ceremony due to racial slur",
            "content": "Morgan Wallen will perform at the 2022 Billboard Music Awards this month, a little over a year after footage of the country singer saying the N-word emerged. Set to take place on May 15 at the MGM Grand Garden Arena in Las Vegas, it will mark the first performance at a major awards ceremony for the artist since last year’s controversy saw him banned from that year’s Country Music Awards, American Music Awards and, indeed, the Billboard Music Awards. As Billboard points out, the decision was made by media conglomerate MRC, who own Billboard along with the Hollywood Reporter. In a statement to Billboard, a representative for MRC explained that the decision to invite Wallen to perform was made after extensive discussion by a diverse group of MRC staffers. “We oppose discrimination, harassment, or racism of any kind. We believe in treating everyone with dignity and respect,” MRC told the publication. “After a thorough review and robust discussions internally and with the artist’s team, in which we found a demonstrated and ongoing commitment to meaningful work and outreach, we extended an invitation to participate in this year’s show.” Video emerged of Wallen saying the racial slur back in February of 2021, just a month after the release of his second album, ‘Dangerous’. The musician was quickly dropped from radio stations and playlists, and suspended from his label Big Loud, but despite the controversy, Wallen saw a surge in album sales. “I used an unacceptable and inappropriate racial slur that I wish I could take back,” Wallen commented in a statement shortly after the footage was released. “There are no excuses to use this type of language, ever. I want to sincerely apologise for using the word. I promise to do better.” In May 2021, he returned to the stage for the first time since the controversy, performing at Kid Rock‘s Big Honky Tonky & Steakhouse bar in Nashville. His music returned to country radio the following month. In July 2021, Wallen appeared on Good Morning America to discuss the controversy. During the interview, he committed to making amends by donating $500,000 to Black-led organisations. In September, it was reported that Wallen had allegedly only donated a third of that money, but Billboard now reports that Wallen had made good on the pledge.  Earlier this year, Wallen kicked off a North American tour in support of ‘Dangerous’, selling out dozens of dates on the run. Last month, Wallen won Album of the Year at the Academy of Country Music Awards. The singer did not directly address the controversy during his acceptance speech, but did thank those who had “shown [him] grace along the way”. Other performers set to take the stage at this year’s Billboard Music Awards include Mary J. Blige, Megan Thee Stallion, Burna Boy, Red Hot Chili Peppers, Silk Sonic and Florence + the Machine. "
        },
        "https://www.nme.com/news/music/yard-act-billy-nomates-and-more-lead-glastonbury-2022s-left-field-line-up-3217274": {
            "title": "Yard Act, Billy Nomates and more lead Glastonbury 2022’s Left Field line-up",
            "content": "During his back-to-back sets on the first night of the inaugural Netflix Is A Joke festival – which runs until Sunday (May 8) – Saturday Night Live star Pete Davidson addressed his long-running feud with Kanye West. Davidson appeared at the festival last Friday (April 29) to premiere his new show, Pete Davidson And Best Friends, which was filmed for release on Netflix later in the year. To a sold-out crowd at Los Angeles’ Fonda Theatre, he opened the set by nudging at the claims that West tried to spread rumours about Davidson – who is currently dating West’s ex-wife, Kim Kardashian – having AIDS. “I had an AIDS scare this year,” he quipped (per Variety), telling his audience that he got himself tested for the condition since West is a “genius”. He assured fans that he does not, in fact, have AIDS – he just looks like he does. Davidson reportedly went on to talk about feeling stuck when it came to responding to West’s harassment, with none of the people in his inner circle able to give him advice for the situation. Another joke in the set – for which Kardashian was in attendance – saw Davidson warn Jon Stewart about a violent curse he may be entangled in; the comedian recalled going to a basketball game with him and Chris Rock last December, teasing that “Chris got slapped [and] I got decapitated”. The line referenced West’s video for his recent collaboration with The Game, ‘Eazy’, in which the rapper kidnaps and kills a claymated version of Davidson.  A second video for ‘Eazy’, shared weeks after the first, also saw Davidson brutalised. In the clip, an animated version of the skinned money from the single’s cover art pins down a blurred-out avatar of Davidson, walloping him with a string of punches over West’s lyric: “God saved me from that crash / Just so I can beat Pete Davidson’s ass.” Though he initially kept quiet on the matter, Davidson responded to West’s attacks a few days after the second ‘Eazy’ video laded, writing to the rapper in a text: “I’ve decided I’m not gonna let you treat us like this anymore and I’m done being quiet.” When West responded and asked Davidson where he was, the comedian sent back a selfie and wrote that he was “in bed with your wife”. West then said he was “happy to see [Davidson] out of the hospital and rehab”, to which Davidson replied: “Same here. It’s wonders what those places do when you go get help. You should try it.” At the end of Davidson’s sets at Netflix Is A Joke: The Festival, Machine Gun Kelly – a close friend, former housemate and longtime collaborator of the comedian – came onstage to perform a surprise three-song set. The pair duetted on the ‘Mainsteam Sellout’ cut ‘ay!’, while MGK (real name Colson Baker) performed ‘Candy’ and ‘make up sex’ by himself. Take a look at Davidson introducing Baker’s mini-set below:  Later this month, Davidson will star in Baker’s directorial debut, Good Mourning, as an aggressive valet driver. The film will be out on May 20 – see the first trailer here. Later in the year – on August 5, to be exact – Davidson will star alongside Amandla Stenberg and Maria Bakalova in the comedy-horror film Bodies Bodies Bodies. Yard Act, Billy Nomates and Billy Bragg are among the leading names on the line-up of Glastonbury‘s Left Field for 2022. The stage is celebrating “20 Years of Pop and Politics” at this year’s Worthy Farm festival, which runs from June 22-26. Left Field will host a mix of live music and debate next month, including the Bragg-hosted ‘Radical Round-Up’. The war in Ukraine, Black Lives Matter and “what’s next for the climate emergency” will be among the topics discussed by Left Field’s panels this year. Live music will come from the likes of Yard Act, Billy Nomates, Bragg, Jamie Webster, Brooke Combe, The Magic Numbers, Kam-Bu, Yola and The Regrettes. Speaking about this year’s Left Field line-up, stage co-curator Bragg said in a statement: “So much has happened in the three years since we last gathered under the Left Field big top. We’ve pulled together an amazing roster of activists and artists determined to make sense of it all. We're very pleased to announce @GlastoLeftField's 2022 line-up, celebrating 20 years of pop and politics. pic.twitter.com/XarYtTdLcs — Glastonbury Festival (@glastonbury) May 3, 2022  “Whether it’s radical perspectives or great music you want, come down to Left Field to recharge your activism in these challenging times.” Speaking to NME back in 2020, Bragg reflected on the “emotional solidarity of being in a crowd and all singing the same song together” while discussing Glastonbury’s coronavirus-enforced cancellation that year. “You come away feeling like you’ve been lifted up,” he continued. “That’s why people sing in church, that’s why people sing at football matches – because you’re sharing an emotion. Music doesn’t have agency to change the world but it can change how you feel. It’s about empathy. We can’t just dismiss it as entertainment. When we come out the other side of this, I think we’ll appreciate these things a lot more.”  Elsewhere at Glastonbury 2022, Arcadia will welcome DJ sets from the likes of Calvin Harris, Four Tet and Nia Archives, while Fatboy Slim, Romy and Mura Masa will perform in the Silver Hayes area. Sugababes and The Damned, meanwhile, are on the line-up for the Field Of Avalon. "
        },
        "https://www.nme.com/news/music/watch-lana-del-rey-make-surprise-appearance-stagecoach-festival-3216868": {
            "title": "Watch Lana Del Rey make surprise appearance at Stagecoach Festival",
            "content": "Lana Del Rey made a surprise appearance at Stagecoach Festival yesterday (May 1), joining Nikki Lane to perform two songs. The country festival took place at Indio, California’s Empire Polo Club this weekend for the first time since 2019. Del Rey appeared on stage with Lane, a country music singer-songwriter from South Carolina, for two songs. Together, they performed a version of their collaboration ‘Breaking Up Slowly’, which featured on Del Rey’s ‘Chemtrails Over The Country Club’ album. They also delivered a rendition of Lane’s own track ‘Look Away’, which was originally released in 2011 as part of her ‘Walk Of Shame’ album. You can watch fan-shot footage of the performances below now.  A post shared by LanaBoards (@lanaboards)   A post shared by LanaBoards (@lanaboards)  Stagecoach isn’t the first time the two artists have appeared on stage together. In January, Del Rey made a guest appearance during Lane’s show in Austin, Texas where they performed a new song, alongside country star Sierra Farrell. Del Rey told the crowd that the track, ’Prettiest Girl In Country Music’, was inspired by a story that Lane had told her about being hit on by an older man. “Nikki told me a little story about him about he had a little meeting with her and he crept a little too close to her, and he said, ‘How does it feel to be the prettiest girl in country music?’ and I was like, ‘Bleh!’,” she explained, adding, “So immediately I wrote a little chorus and then we expanded.”  In October 2020, the pair also gave a performance of ‘Breaking Up Slowly’ at another of Lane’s shows. Meanwhile, in January, Del Rey shared her first piece of new material since the release of her 2021 album ‘Blue Banisters’. ‘Watercolor Eyes’ appeared on the soundtrack to Euphoria season two and found the star singing: “I think that you taste like rock candy / Sweet like beaches leave me all sandy.” "
        },
        "https://www.nme.com/news/music/spinal-tap-drummer-ric-parnell-died-70-3216930": {
            "title": "Spinal Tap drummer Ric Parnell has died, aged 70",
            "content": "Ric Parnell, who played fictional drummer Mick Shrimpton in the film This Is Spinal Tap, has died at the age of 70. Harry Shearer, who also starred in the 1984 mock documentary on the fictional heavy metal band Spinal Tap, announced the news via Twitter before it was confirmed by Yahoo News. No cause of death has been reported at this time. Ric Parnell, our drummer in This is Spinal Tap, passed away today. No one ever rocked harder. — Harry Shearer (@theharryshearer) May 2, 2022  Fronted by actor-musicians Michael McKean (as David St. Hubbins), Christopher Guest (as Nigel Tufnel) and Shearer (as Derek Smalls), Spinal Tap was able to blur the line between fact and fiction thanks to their genuine musical ability. In the film, Parnell’s character spontaneously combusts at the end, following a running gag that all of the group’s previously drummers have died the same way. The musician also performed on the movie’s soundtrack, as well as a follow-up album ‘Break Like The Wind’ which was released in 1992. Born in London to jazz drummer and bandleader Jack Parnell, Ric played in the bands Atomic Rooster and Horse during the early 1970s. He also played in three Italian groups and was reported to have turned down offers to join Journey and Whitesnake in the ’80s, according to Variety.  At the time of his death, Parnell lived in Montana, where he co-hosted a weekly radio show called “Spontaneous Combustion.” Tributes have begun to flow in for Parnell, with his Spinal Tap bandmate McKean sharing on Twitter, “Rick Parnell was a great drummer. More to say tomorrow. Right now rest in peace will have to do.” Ric Parnell was a great drummer. More to say tomorrow. Right now rest in peace will have to do. — Michael McKean (@MJMcKean) May 2, 2022  Musician Michael Des Barres, who had previously collaborated with the drummer also shared a tribute, saying, “Some musicians are playing a role. Others are rock ‘n’ roll. Ric Parnell was the latter. The real thing. Lost and found in a rhythm that was both jarring and beautiful. His heart still beats. RIP.” Ric Parnell, Spinal Tap Drummer 'Mick Shrimpton,' Dead at 70Some musicians are playing a role. Others are rock ‘n’ roll. Ric Parnell was the latter. The real thing. Lost and found in a rhythm that was both jarring and beautiful.His heart still beats. RIP https://t.co/5f0GK70E3n — Michael Des Barres (@MDesbarres) May 2, 2022  A GoFundMe has also been shared today to help cover his funeral costs. The $3,500 (£2,803) goal has already been reached, with a total of $7,256 (£5,811) raised at the time of writing. "
        },
        "https://www.nme.com/news/film/jared-leto-joins-guccis-alessandro-michele-in-matching-suits-at-met-gala-3217408": {
            "title": "Jared Leto joins Gucci’s Alessandro Michele in matching suits at Met Gala",
            "content": "Jared Leto dressed in matching suits with Gucci creative director Alessandro Michele at the 2022 Met Gala. The actor and musician appeared alongside Michele at New York’s Metropolitan Museum of Art on Monday (May 2), wearing matching cream-coloured Gucci tuxedos with identical bow ties, clutch bags and hair styles for this year’s theme, ‘In America: An Anthology of Fashion’. Earlier in the night, Leto was mistaken by fans (and The New York Times) for Swedish entrepreneur Fredrik Robertsson, who wore a silver Iris Van Herpen jumpsuit and elaborate make-up. Back in 2019, Leto appeared at the Met Gala with a similar doppelganger theme, carrying a severed head of his likeness designed by Michele. Alessandro Michele and Jared Leto at the Met Gala 2022 CREDIT: Dimitrios Kambouris/Getty Images for The Met Museum/Vogue Leto portrayed Paolo in Ridley Scott film House Of Gucci last year, where he starred alongside Lady Gaga, Adam Driver, Al Pacino and Jeremy Irons. He most recently starred in Spider-Man spin-off film Morbius, where he plays a scientist who is afflicted with a form of vampirism. In a one-star review of the film, NME wrote: “Astoundingly, for a film about a mad doctor who turns into a vampire, it’s also very boring. Horror fans attracted by the sinister promo campaign will be disappointed. You’ll see more claret in your local off-licence.  “All this could be excused if there were a few jokes to pass the time or some stylishly shot sequences. Instead, what we end up with is drab, flat and humourless. Leto was unfairly maligned for his exuberant, ridiculous performance as Paolo in House of Gucci but that at least had life and energy. Morbius is dead on arrival.” "
        },
        "https://www.nme.com/news/music/jamie-t-the-old-style-raiders-single-listen-comeback-live-show-london-tickets-3218385": {
            "title": "Jamie T returns with ‘The Old Style Raiders’ and announces intimate London show",
            "content": "Jamie T has returned with a new single called ‘The Old Style Raiders’ and announced his first live show in five years. Watch the video below. The song serves as the first preview of the south London singer-songwriter’s fifth studio album ‘The Theory Of Whatever’, which comes out on July 29 via Polydor. Premiering on BBC Radio 1 as tonight’s ‘Hottest Record’ (May 4), the indie-rock anthem was produced by former Maccabees guitarist Hugo White, and contains the rousing chorus: “Toe the line!/ Hard to find!/ Told to fight for something you love in life.” “It’s got hope in it,” T explained of ’The Old Style Raiders’ in a statement. “It’s fighting to find something that means enough to you that you love. The fight to find that, and to carry on striving, to find something you love enough to hold on to. “Rather than kid love or movie love or gushy love or lust love, whatever you have when you’re younger – it’s actually trying to fight for something that means more than that. It’s the struggle to find that.”  As for how the single came to be on his long-awaited new album, T said: “I was struggling to find my direction with the record for a few years, really.” He continued: “I went home one day, and I found this track that I had recorded, pretty much fully finished. And I was really upset, because I realised that I’d spent the last six months asking other people to tell me if something was good. “Then I heard this track and I just immediately knew I’d kind of found my path.” The musician – real name Jamie Treays – has also confirmed that he’ll return to the stage for an intimate show at the Subterania venue in Ladbroke Grove, London next Wednesday (May 11). It’ll mark his first live appearance since 2017. Tickets will be available to fans who pre-order ‘The Theory of Whatever’ from Jamie T’s official store by 5pm BST tomorrow (May 5).  Treays announced the follow-up to 2016’s ‘Trick’ last Wednesday (April 27) by posting an “album trailer brief” video on his official social media channels. Earlier this year, Jamie T released a 15th anniversary reissue of his seminal debut, ‘Panic Prevention’. "
        },
        "https://www.nme.com/news/music/bts-share-release-date-and-track-details-for-new-anthology-album-proof-3218502": {
            "title": "BTS share release date and track details for new anthology album ‘Proof’",
            "content": "BTS have revealed the details for their next album, ‘Proof’. View the teaser video for their new anthology record below. The upcoming album was first teased at the last of the band’s recent four-night sold-out Las Vegas residency, when a date of “2022.06.10” – June 10 – came up on screen at the end of the show, alongside the tagline: “We are bulletproof.” According to BTS’ label Big Hit, the three-CD collection will feature three new tracks alongside songs from the band’s discography. “After ceaselessly springing forward since 2013, BTS is celebrating their ninth anniversary this coming June,” a statement on BTS’ Weverse fan community said. “The BTS anthology that embodies the history of BTS will be released as they begin a new chapter as an artist that has been active for nine years to look back on their past endeavours.” The statement went on to add that ‘Proof’ would “reflect the thoughts and ideas of the members of the past, present and future of BTS”.  Pre-order for the anthology begins tomorrow (May 5). The K-pop behemoth’s last studio album was 2020’s ‘BE‘. Since then, BTS has released multiple singles, including ‘My Universe’ with Coldplay,  ‘Permission To Dance’, and their Grammy-nominated track, ‘Butter’. In a four-star review of the deluxe album, NME’s Rhian Daly called it “the most accurate musical encapsulation of the rollercoaster that is pandemic life so far; one minute brimming with joy, the next listless and miserable, another swinging slowly back to a neutral baseline.” Daly added: “Much of ‘BE’ finds the band trying to find something to cling onto, clutching at small moments of happiness wherever it can find them”  Meanwhile, K-pop icon Psy recently credited BTS with having achieved the “unfulfilled dreams” of his 2012 hit single ‘Gangnam Style’. Psy became the highest-charting Korean pop act on the Billboard Hot 100 with the track peaking at Number Two. Since then, only BTS have gone on to best his record, hitting Number One six times since 2020. “If they continue like this, though they’re not doing music for the sake of raising national prestige, I think they’re giving [Korea] a lot of proud moments,” Psy said during a press conference. “I feel very proud that I had a role in being that trigger. BTS have thanked me for that part several times, so I’m proud of it.” "
        },
        "https://www.nme.com/news/music/maneskin-share-release-date-and-cover-art-for-new-single-supermodel-3218602": {
            "title": "Måneskin share release date and cover art for new single ‘Supermodel’",
            "content": "Jack Osbourne has given an update on his father Ozzy Osbourne‘s health following news that the rock star had contracted COVID-19. Last week, Ozzy’s wife Sharon shared that she’d be flying from the UK to the US after discovering that the singer had tested positive for the virus. “I am very worried about Ozzy right now,” Sharon said in an emotional interview with Talk TV. “We’ve gone two years without him catching COVID, and it’s just Ozzy’s luck he would get it now.” She continued: “It’ll take me a week to get my old man back on his feet again, and I will be back [on The Talk] in a week… We’re gonna get him a negative test by next week.” Now, Jack has shared a further update Ozzy’s condition while appearing on Tom Newton Dunn’s The News Desk (via Birmingham Mail). “He’s doing well,” Jack revealed. “I spoke to him shortly before coming in. He just says hello. I’ll save the colorful language, but he says it sucks.” (L-R) Jack, Sharon and Ozzy Osbourne. CREDIT: Chelsea Lauren/WireImage Back in 2020, as cases were rising, the Black Sabbath frontman said that catching the coronavirus would be risky for him due to his weak respiratory health. He told GQ at the time: “I’ve got emphysema, so if I get this virus, I’m fucked.” In February 2021, the icon shared that he’d received his COVID vaccine. Describing his experience getting the jab, Ozzy joked: “It was like being stabbed. No, my arm was a bit sore yesterday but I’m glad I got it, you know.” Asked if he was relieved to receive the jab,he replied:“Absolutely. As soon as I got it I felt relieved.” The rock legend has recovered from accidents and several bouts of illness over the past few years and in January of 2020, he confirmed a “challenging” diagnosis with Parkinson’s disease.  Meanwhile, Ozzy recently said he’s looking to host two families of Ukrainian refugees at his Buckinghamshire estate, according to Sharon. The couple palns to return to the UK permanently after living in Los Angeles for over 25 years. It comes after his wife landed a new job at TalkTV, while Ozzy has expressed a desire to “come home” amid  his series of health problems. Måneskin have shared details for an upcoming single called ‘Supermodel’. View the cover art below. Today (May 4) the band shared photos and clips on social media which featured a scantily dressed person floating in clear blue water. The group then shared a post, with the same imagery, this time with the caption: “SUPERMODEL New single. Out on May 13th.” You can pre-save the track here. SUPERMODEL New single. Out on May 13th. Pre-save it now: https://t.co/CCNLbS2hS7. pic.twitter.com/jdo8e7CHht — MåneskinOfficial (@thisismaneskin) May 4, 2022  Måneskin’s latest track follows last year’s blistering single, ‘MAMMAMIA’. The Italian band and Eurovision winners are currently on tour. Last week, they played in Verona, writing on Instagram: “Feels good to be home again. Verona last night felt magical.” The band also recently took the stage at Coachella, where they played their hits including ‘Zitti E Buoni’, their cover of ‘Beggin” and a new Britney Spears cover of ‘Womanizer’. Måneskin are set to kick off their massive rescheduled Loud Kids Get Louder tour later this year which spans until the beginning of 2023, and has dates across North America, Europe and the UK.  A post shared by Måneskin (@maneskinofficial)  “The Loud Kids Get Louder tour will actually see our very first headline tour in North America,” the band shared of their upcoming dates. “All our rescheduled European indoor dates have been upgraded due to demand + we’ve added some new ones for all of you who missed the chance to get their tickets.” They added: “We really want to thank you for being so understanding during this long period as we got this in place. We know you’ve been waiting patiently for this announcement, and we feel very grateful towards all our beloved fans for your love, support and understanding. We missed you and we missed performing, and we can not wait to play for you all again!”  The band previously postponed their Loud Kids tour “due to venue capacity issues amid the COVID pandemic”. Tickets for their North American tour tickets can be found here, European dates can be purchased here and tickets for the shows in the UK can be found here. "
        },
        "https://www.nme.com/news/music/pusha-t-calls-rumours-of-eminem-beef-a-misinterpretation-3217263": {
            "title": "Pusha T calls rumours of Eminem beef a “misinterpretation”",
            "content": "Pusha T has said that a supposed beef between him and Eminem is a “misinterpretation”, and paid respect to his fellow rapper. During an appearance on The Morning Hustle, Pusha was asked by host Lore’l if he had ever been pitted against other rappers. “I saw just recently on Twitter people saying myself and Eminem,” he responded. “I’m like, bro! It was a misinterpretation of something I don’t even remember. Something I said or whatever. But you know, people decode, and they have their own thing.” He went on to express his admiration for Eminem’s famous 1998 appearance in the Lyricist Lounge showcase. “He’s one of them people that I really like what he does because, after all of his success, I can still find Lyricist Lounge Eminem. That’s a goal for me, personally.”  It’s unclear what exactly sparked the rumours on social media that the two rappers are feuding with one another. Pusha’s comments come following the release of his latest album ‘It’s Almost Dry’. In a five-star review, NME said he “has managed to elevate his art to new heights, signalling that the artist is nowhere close to being done”. He also recently discussed the ongoing feud between Kanye West and Kid Cudi, both of whom contributed to the album.  “It fucking sucks. You know Cudi is my fucking brother to the end. Just navigating these relationships, this brotherhood, the arguing… it gets public,” he said. “It’s one thing for us to argue. We all argue – that’s not a problem. It gets out there, whether it’s Ye bickering first, or Cudi coming back with what he says. It’s super–fucked up.” "
        },
        "https://www.nme.com/news/music/bring-me-the-horizon-have-recorded-about-45-songs-for-their-next-project-3216232": {
            "title": "Bring Me The Horizon have recorded “about 45 songs” for their next project",
            "content": "Bring Me The Horizon have revealed that they’ve recorded “about 45 songs” for their next release. The band’s last project was their ‘Post Human: Survival Horror’ EP, released back in October 2020. The first of several releases, frontman Oli Sykes told NME last year they were “working on parts two, three and four simultaneously” and that they were hoping to “get songs out as soon as we can”. The Sheffield rock giants then gave fans a taste of what they can expect from ‘Post Human 2’, sharing new single ‘DiE4u’ in September 2021. Speaking in a new interview, Sykes has now shared an update on the record as well as their forthcoming schedule. “We’re doing lots of gigs hopefully, if the world goes alright,” he told BANG Showbiz (via Contact Music). “Lots of European festivals and we’re going to the States in September. And hopefully a new record.” He continued: “We’ve been working on it for about a year now, we’ve got lots of music we’re just being quite picky about what we want to release. We must have about 45 songs.” Bring Me The Horizon accepting the trophy for Best Band From The UK at the BandLab NME Awards 2022. CREDIT: Andy Ford for NME Last month, Bring Me The Horizon teamed up with Sigrid for a brand new track, ‘Bad Life’. The song marks the latest in a strong run of collaborations released by BMTH. Prior to ‘Bad Life’, earlier in the month, the band featured on the Masked Wolf single ‘Fallout’, while March marked another team up with Machine Gun Kelly with the release of ‘maybe’. Meanwhile, Charlie Simpson – former Busted member and Fightstar frontman – has hinted that a collaboration with BMTH could be on the cards. In the latest segment of NME‘s Does Rock ‘N’ Roll Kill Braincells?!, Simpson was quizzed on elements of his career. At one point he was asked about his former band Busted’s debut single, ‘What I Go To School For’. In his response, the musician mentioned that Bring Me The Horizon keyboardist Jordan Fish said to him: “Those Busted songs are fucking bangers man!” Later on, Simpson was asked: “Any chance of a collab with Busted banger-loving Bring Me the Horizon?” to which he replied: “So I spoke to Jordan [Fish] two weeks ago because we want to do a project together. We became buddies after doing Warped tour together years ago. “So we’re trying to think of something we can do together, and I’m trying to think of something I can get him on. Which would be awesome!” "
        },
        "https://www.nme.com/news/music/jack-harlow-responds-to-viral-clip-of-two-referees-having-no-idea-who-he-is-3216846": {
            "title": "Jack Harlow responds to viral clip of two referees having no idea who he is",
            "content": "Jack Harlow has responded to a clip of two referees trying to work out who the rapper is. Last night (May 1) Jack Harlow was watching an NBA basketball game between the Milwaukee Bucks and Boston Celtics when two of the referees were caught on camera trying to work out who the rapper was and what he did. “Who is Jack Harlow?” asked Scott Foster with fellow ref Ed Malloy replying “I have no idea. Who is he?” “I don’t know,” replied Foster. “Go ask him.” The footage was shared by Sports Centre and quickly went viral, with the studio commentators pointing out that Harlow’s recently released song ‘Nail Tech‘ was actually featured on the venue’s playlist. Scott Foster and Ed Malloy trying to figure out who Jack Harlow is 😂 pic.twitter.com/6C2ux5g381 — SportsCenter (@SportsCenter) May 1, 2022  Responding to the clip, Harlow said “Clearly these mfs have never seen Narnia,” referencing comparisons he gets to James McAvoy’s faun character of Mr Tumnus in the film Chronicles of Narnia: The Lion, the Witch and the Wardrobe. i will never forget jack harlow in narnia pic.twitter.com/RB1pkukYMc — Karanikolau 🌸 (@LaNattiqueen) May 1, 2022  Jack Harlow is set to release new album ‘Come Home The Kids Miss You’ later this week (May 6). The follow-up to 2020’s ‘That’s What They All Say’ has already been previewed with ‘Nail Tech’ and ‘First Class’. Speaking to Rolling Stone about the record, Harlow said his “new shit is much more serious. Right now, my message is letting muh’fuckers know I love hip-hop, and I’m one of the best in my generation. You can’t do that with nonchalant, like, ‘Eeey, I got the bitches,’ in clever ways over and over again. I got to dig deeper this time.”  Last month, Harlow discussed the legacy of his rap hero Eminem. “I think that shit is still forever immortal and we’re gonna get back to it,” Harlow said of Marshall Mathers’ music. “We’re a couple years away from everyone reviving that shit as a culture and being like, ‘Look at this shit.” He added: “Everyone’s gonna pay their rightful respects again. No matter how the production ages to people, he put so much into his words that it immortalised him, even though that shit aged as ‘circus music’ to [some] people.” "
        },
        "https://www.nme.com/news/music/dababy-charged-with-felony-battery-for-alleged-attack-on-rental-property-owner-3216235": {
            "title": "DaBaby charged with felony battery for alleged attack on rental property owner",
            "content": "DaBaby has been charged with felony battery for an alleged attack on the owner of a rental property he was using to shoot a music video. Gary Pagar claims he was physically assaulted when he tried to stop the rapper’s entourage from shooting the video on his Los Angeles property in December last year. According to TMZ, the incident occurred when DaBaby (real name Jonathan Kirk) and his team were renting out a mansion managed by Pagar, who says he was told Kirk and his friends would only be using the property for vacation purposes. Pagar has claimed that the rapper’s management team agreed to a 12-guest limit as outlined in the property’s rental agreement, but at one point during their week-long stay, Pagar said he noticed more than a dozen people were inside the house. On December 2, Pagar said he stopped by the property and found in the region of 40 people on site, including a film crew who appeared to be shooting a music video for ‘Play U Lay’, a track by DaBaby’s artist Stunna4Vegas.  Pagar then claims that after he approached Kirk to try and shut down the shoot, someone in the rapper’s crew attacked the property owner. Although Kirk allegedly ordered the crew member to stop, Pagar alleges that Kirk then punched him in the face, knocking out a tooth. Pagar filed a lawsuit against Kirk in February, which claims that he suffered serious injuries from the attack. Another member of the rapper’s team, Thankgod Awute, has also been charged with felony robbery. DaBaby took to Twitter to respond to Pagar’s claims, writing: “Y’all keep beliving [sic] these type of people & helping em assassinate my character y’all might as well get a rope & help him hang my black ass on a tree.” Y’all keep beliving these type of people & helping em assassinate my character y’all might as well get a rope & help him hang my black ass on a tree. ✊🏻 pic.twitter.com/miO6daOyQZ — DaBaby (@DaBabyDaBaby) April 30, 2022  This is the latest in a long line of legal woes the rapper has been involved in over the last year. Last week, Rolling Stone obtained security footage of a 2018 incident where Kirk shot and killed a man named Jaylin Craig at a Charlotte-area Walmart, which the rapper has consistently claimed was in self-defence. The newly published security footage shows the lead-up to the shooting and its aftermath and appears to potentially contradict the rapper’s version of events. He was then involved in another violent altercation last month, this time between himself and Charlotte rapper Wisdom, a recent signee to Kirk’s Billion Dollar Baby Entertainment roster. That same month, a shooting took place at DaBaby’s home in North Carolina, leaving one person injured. While the shooter and the victim have not been named, a spokesperson from the Troutman Police Department said it was an “isolated incident” and that there was no further threat to the community. In February, the brother of singer/rapper DaniLeigh sued DaBaby over an alleged unprovoked physical attack on him at a bowling alley in Los Angeles. "
        },
        "https://www.nme.com/news/music/avril-lavigne-puts-canadian-shows-on-ice-over-positive-covid-19-case-within-the-tour-3216263": {
            "title": "Avril Lavigne puts Canadian shows on ice over positive COVID-19 case “within the tour”",
            "content": "Avril Lavigne has alerted fans that three of her upcoming gigs in Canada won’t go ahead as scheduled, after a member of her touring crew tested positive for COVID-19. The affected dates include one at Place Bell in Laval – initially slated for tonight (May 2), but now set to go down on Saturday (May 7) – one at the Avenir Centre in Moncton, and one at the Scotiabank Centre in Halifax. Those last two gigs – which were booked in for tomorrow (May 3) and on Wednesday May 4, respectively – are yet to receive new dates, but in a statement posted on social media, Lavigne assured ticketholders that new details “will be announced shortly”. At the time of writing, Lavigne’s show at the Centre Vidéotron in Quebec City is still scheduled to ahead on Friday (May 6). In her post, the artist explained that she put the first three of this week’s shows on ice because of “a positive COVID case within the tour and subsequent exposures”. She did not confirm who in her touring party caught the virus, nor whether herself or any of her bandmates were among those exposed to it. “I/we sincerely apologize and want you to know that this was not a decision we made lightly,” Lavigne continued. “We remain focused on everyone’s safety and can’t wait to see you all very soon.” pic.twitter.com/88obaWnt1y — Avril Lavigne (@AvrilLavigne) May 1, 2022  Lavigne is currently on tour in support of her Green Day-inspired seventh album, ‘Love Sux’, which landed back in February via DTA / Elektra. In a three-star review of it, NME’s Ali Shutler wrote that “like Willow Smith’s ‘Lately I Feel Everything’ and everything Cleveland’s Kennyhoopla has put his name to, ‘Love Sux’ is a progressive pop-punk album that eschews the old rules – but not at the expense of maximalist, joyful guitar anthems.”  Last week, Lavigne joined Olivia Rodrigo onstage to perform her debut single ‘Complicated’, which the latter has been performing on every night of her ‘Sour’ world tour. It was also revealed last week that ‘Love Sux’ is doing impressively well on cassette, being the year’s third-highest selling release on the format thus far. Later in the year, Lavigne will release a 20th anniversary edition of her acclaimed debut album, 2002’s ‘Let Go’. "
        },
        "https://www.nme.com/news/music/wales-more-about-nothing-finally-added-to-streaming-3216252": {
            "title": "Wale’s ‘More About Nothing’ finally added to streaming",
            "content": "Wale has finally added his Seinfeld-inspired mixtape ‘More About Nothing’ to streaming platforms – check it out below. The sequel to the rapper’s 2008 project The Mixtape About Nothing, and precursor to 2015’s The Album About Nothing, features the likes of Wiz Khalifa, Daniel Merriweather, Fat Trel and Brooklyn Nets basketball player Kevin Durant. The 17-track project hits streaming in its original format, with all of its samples in tact, many of which Jerry Seinfeld was instrumental in helping Wale clear. You can listen to the mixtape on streaming below:   Wale is among several rappers who have added their old mixtapes to streaming services in recent years. Wiz Khalifa added ‘Kush & Orange Juice’ to DSPs a couple of years ago, followed soon after by Big K.R.I.T.‘s ‘K.R.I.T. Wuz Here’,  Lil Wayne‘s ‘No Ceilings’ and Big Sean’s ‘Detroit’. A 10th anniversary edition of A$AP Rocky‘s acclaimed debut mixtape ‘LIVE.LOVE.A$AP’ arrived on streaming back in October. ‘LIVE.LOVE.A$AP’ arrived after Rocky famously signed a $3million deal with RCA Records and Polo Grounds Music after a bidding war was launched for him. In January 2013, he released his debut studio album ‘Long. Live. A$AP’. Earlier in the same month as the Rocky’s 10th anniversary mixtape, Mac Miller‘s 2014 mixtape ‘Faces’ arrived on streaming services. Originally released as a free project on May 11, 2014 (Mother’s Day in the US that year), the tape features appearances from Schoolboy Q, Rick Ross, Thundercat, Vince Staples, Mike Jones, Earl Sweatshirt and more.  Earlier this year, Lil Wayne released his ‘Sorry 4 The Wait’ mixtape on streaming services, featuring four new tracks. Originally released in 2011 as an apology to fans for the various delays that plagued the release of ‘Tha Carter IV’ (which eventually came in August of that year), ‘Sorry 4 The Wait’ was Lil Wayne’s first full-length project after serving eight months at New York’s Rikers Island for possessing a loaded gun on a tour bus. The record saw Lil Wayne rap over some of 2011’s biggest tracks, from Adele’s ‘Rolling In The Deep (Sorry 4 The Wait)’ to Drake’s ‘Marvin’s Room’ (Tunechi’s Room)’. Meanwhile, The Weeknd‘s second mixtape, ‘Thursday’, landed on streaming services for the first time in August for its 10th anniversary. "
        },
        "https://www.nme.com/news/music/lewis-mclaughlin-wins-glastonburys-emerging-talent-competition-2022-radar-3216249": {
            "title": "Lewis McLaughlin wins Glastonbury’s Emerging Talent Competition 2022",
            "content": "Glastonbury has announced Lewis McLaughlin as the winner of the festival’s 2022 Emerging Talent Competition. The annual contest offers rising acts the chance to win a slot on one of the festival’s main stages, as well as a £5,000 Talent Development prize from the PRS Foundation. Over the course of last night (April 30), the top three acts from the previously-announced longlist of acts were unveiled on the official Glastonbury Twitter account. Rapper Crae Wolf and Leeds band English Teacher took third and second place respectively, each securing a slot at Glastonbury 2022 and £2,500 from PRS. Taking the top prize was Scottish singer-songwriter. In response, he wrote on Twitter: “Madness,” before adding in a separate tweet: “Honestly so stunned, all the other acts were incredible. Big thanks to all the judges and everyone involved in the competition.” Sharing the news on social media, Glastonbury organiser Emily Eavis said: “What a night, so many great bands, all playing in the final of our ETC. Congratulations to @LewisSings and @CraeWolf as well as @englishteac_her As the standard was so high all night long, we are giving every finalist a gig at this years festival!” Our two runners up on a fantastic night of live music are @CraeWolf and @Englishteac_her. They both get a £2,500 Talent Development prize from @PRSFoundation and will be given a slot at this year’s Festival. 👏👏 — Glastonbury Festival (@glastonbury) April 30, 2022  What a night, so many great bands, all playing in the final of our ETC. Congratulations to @LewisSings and @CraeWolf as well as @englishteac_her As the standard was so high all night long, we are giving every finalist a gig at this years festival! https://t.co/Kqw21ou3Js — Emily Eavis (@emilyeavis) May 1, 2022  The last Emerging Talent Competition took place in 2020, with R.A.E being announced as the winner. West London singer-songwriter Matilda Mann and Newcastle’s AJIMAL took third and second place respectively. As the 2020 and 2021 festivals were both cancelled due to the coronavirus pandemic, R.A.E is now scheduled to make an appearance on the 2022 bill instead. Glastonbury organisers said: “The winner of the 2020 competition – which had its entry window before that year’s Festival was cancelled – was the incredible south-east Londoner R.A.E, who wowed the judges with her radiant, pin-sharp hip-hop and R&B. R.A.E will play on one of the main stages at this year’s Festival as part of her prize.” Other past finalists of the Emerging Talent Competition include the likes of Marie White, Flohio, Izzy Bizu, Declan McKenna, Josh Barry and She Drew The Gun.  In March, Glastonbury announced their line-up for 2022. Paul McCartney and Kendrick Lamar were confirmed as the festival’s final two headliners, joining previously announced headliner Billie Eilish. Diana Ross was previously confirmed for this year’s ‘Legends’ slot. You can see the full-line up so far here, with more names to be added. "
        },
        "https://www.nme.com/news/music/ozzy-osbourne-health-update-hes-doing-well-3216228": {
            "title": "Ozzy Osbourne health update: “He’s doing well”",
            "content": "Jack Osbourne has given an update on his father Ozzy Osbourne‘s health following news that the rock star had contracted COVID-19. Last week, Ozzy’s wife Sharon shared that she’d be flying from the UK to the US after discovering that the singer had tested positive for the virus. “I am very worried about Ozzy right now,” Sharon said in an emotional interview with Talk TV. “We’ve gone two years without him catching COVID, and it’s just Ozzy’s luck he would get it now.” She continued: “It’ll take me a week to get my old man back on his feet again, and I will be back [on The Talk] in a week… We’re gonna get him a negative test by next week.” Now, Jack has shared a further update Ozzy’s condition while appearing on Tom Newton Dunn’s The News Desk (via Birmingham Mail). “He’s doing well,” Jack revealed. “I spoke to him shortly before coming in. He just says hello. I’ll save the colorful language, but he says it sucks.” (L-R) Jack, Sharon and Ozzy Osbourne. CREDIT: Chelsea Lauren/WireImage Back in 2020, as cases were rising, the Black Sabbath frontman said that catching the coronavirus would be risky for him due to his weak respiratory health. He told GQ at the time: “I’ve got emphysema, so if I get this virus, I’m fucked.” In February 2021, the icon shared that he’d received his COVID vaccine. Describing his experience getting the jab, Ozzy joked: “It was like being stabbed. No, my arm was a bit sore yesterday but I’m glad I got it, you know.” Asked if he was relieved to receive the jab,he replied:“Absolutely. As soon as I got it I felt relieved.” The rock legend has recovered from accidents and several bouts of illness over the past few years and in January of 2020, he confirmed a “challenging” diagnosis with Parkinson’s disease.  Meanwhile, Ozzy recently said he’s looking to host two families of Ukrainian refugees at his Buckinghamshire estate, according to Sharon. The couple palns to return to the UK permanently after living in Los Angeles for over 25 years. It comes after his wife landed a new job at TalkTV, while Ozzy has expressed a desire to “come home” amid  his series of health problems. "
        },
        "https://www.nme.com/news/music/watch-the-linda-lindas-deliver-punchy-performance-of-oh-on-fallon-3217191": {
            "title": "Watch The Linda Lindas deliver punchy performance of ‘Oh!’ on Fallon",
            "content": "Tove Lo has announced details of a UK and European tour which will take place later this year. The Sweden-born, Los Angeles-based artist has returned with new music today (May 3) in the form of ‘No One Dies From Love’. Accompanying the new single, Lo has now confirmed a host of UK, Ireland and European headline tour dates for October and November. “I’m so happy I feel CRAZY to announce my headline tour in the UK and Europe this autumn,” Lo said in a statement. “We had to cut our tour there short in March of 2020, which meant missing out on seeing most of your beautiful faces. Now the wait is officially (almost) over!” I’m so happy I feel CRAZY to announce my headline tour in the UK and Europe this autumn. 🧨❤️‍🔥⚔️💔 We had to cut our tour there short in March of 2020, which meant missing out on seeing most of your beautiful faces.  Now the wait is officially (almost) over! pic.twitter.com/OrVdVnVYzR — Tove Lo (@ToveLo) May 3, 2022  You can see Tove Lo’s upcoming headline tour dates below. October29 – 3Olympia Theatre, Dublin November1 – SWG3 Galvanizers, Glasgow2 – Academy, Manchester3 – O2 Institute, Birmingham5 – The Roundhouse, London8 – La Madeleine, Brussels9 – Live Music Hall, Cologne10 – Bataclan, Paris12 – Den Atelier, Luxembourg13 – Melkweg, Amsterdam15 – Astra Kulturhaus, Berlin16 – Stodola, Warsaw18 – Vega, Copenhagen19 – Sentrum Scene, Oslo21 – Berns, Stockholm Tickets for the UK dates of the tour go on general sale on Friday (May 6) at 10am, and you’ll be able to find them here.  Lo has also announced the launch of Pretty Swede Records, her own record label with mtheory. “I have a lot of freedom, and it’s been fun to work with mtheory,” she said in a statement. “This will be the first release under my label. I’m a pop girl, but I like to make things weird and be in full control of the whole vision. This is the perfect way to put out exactly what I want.” The Linda Lindas appeared on The Tonight Show Starring Jimmy Fallon last night (May 2), performing the track ‘Oh!’ from their recently released debut album. After finding viral success for the track ‘Racist, Sexist Boy’, the band have appeared on a slew of late night US TV performances, beginning with a performance of their breakout track on Jimmy Kimmel Live last summer. Two months ago, they played ‘Growing Up’ on The Late Late Show With James Corden. ‘Oh!’ was first released as a single last year following the band’s signing to Epitaph, and also appears on their debut album.  In a four star review of the record, NME said that “Tracks on here like ‘Fine’ and the aforementioned ‘Racist, Sexist Boy’ are vital, powerful bursts of punk fury. Yet when they let their pop music imaginations run free it’s equally impressive, with tracks like ‘Growing Up’, ‘Talking To Myself’ and ‘Magic’ showcasing a gift for catchy, singalong choruses. Speaking to NME last month about the making of the album, 15-year-old drummer Lucia de la Garza said: “We’ve learned that music can do anything, and it can get you through anything. It’s really fun to see how we’re growing as musicians.  “Even from the [self-titled] EP which we wrote only about a year before, you can see how we’ve grown as songwriters, and see how we were trying to figure out what our sound is. We hope there are many more to come and that they keep showing how we’re progressing.” Meanwhile, The Linda Lindas have also been revealed as one of many bands involved in a covers album of Sleater-Kinney‘s 1997 album ‘Dig Me Me Out’, to celebrate its 25th birthday. Courtney Barnett, St. Vincent, Wilco, TV On The Radio’s Tunde Adebimpe and others will also appear. "
        },
        "https://www.nme.com/news/music/tove-lo-announces-2022-uk-and-european-tour-tickets-3217380": {
            "title": "Tove Lo announces 2022 UK and European tour",
            "content": "Tove Lo has announced details of a UK and European tour which will take place later this year. The Sweden-born, Los Angeles-based artist has returned with new music today (May 3) in the form of ‘No One Dies From Love’. Accompanying the new single, Lo has now confirmed a host of UK, Ireland and European headline tour dates for October and November. “I’m so happy I feel CRAZY to announce my headline tour in the UK and Europe this autumn,” Lo said in a statement. “We had to cut our tour there short in March of 2020, which meant missing out on seeing most of your beautiful faces. Now the wait is officially (almost) over!” I’m so happy I feel CRAZY to announce my headline tour in the UK and Europe this autumn. 🧨❤️‍🔥⚔️💔 We had to cut our tour there short in March of 2020, which meant missing out on seeing most of your beautiful faces.  Now the wait is officially (almost) over! pic.twitter.com/OrVdVnVYzR — Tove Lo (@ToveLo) May 3, 2022  You can see Tove Lo’s upcoming headline tour dates below. October29 – 3Olympia Theatre, Dublin November1 – SWG3 Galvanizers, Glasgow2 – Academy, Manchester3 – O2 Institute, Birmingham5 – The Roundhouse, London8 – La Madeleine, Brussels9 – Live Music Hall, Cologne10 – Bataclan, Paris12 – Den Atelier, Luxembourg13 – Melkweg, Amsterdam15 – Astra Kulturhaus, Berlin16 – Stodola, Warsaw18 – Vega, Copenhagen19 – Sentrum Scene, Oslo21 – Berns, Stockholm Tickets for the UK dates of the tour go on general sale on Friday (May 6) at 10am, and you’ll be able to find them here.  Lo has also announced the launch of Pretty Swede Records, her own record label with mtheory. “I have a lot of freedom, and it’s been fun to work with mtheory,” she said in a statement. “This will be the first release under my label. I’m a pop girl, but I like to make things weird and be in full control of the whole vision. This is the perfect way to put out exactly what I want.” "
        },
        "https://www.nme.com/news/music/watch-father-john-misty-perform-kiss-me-i-loved-you-on-jimmy-fallon-3218647": {
            "title": "Watch Father John Misty perform ‘Kiss Me (I Loved You)’ on ‘Fallon’",
            "content": "Father John Misty delivered a live rendition of ‘Kiss Me (I Loved You)’ on US TV last night (May 3). Check out the video below. The singer-songwriter – aka Joshua Tillman – appeared as the musical guest on the latest episode of The Tonight Show Starring Jimmy Fallon in support of his fifth album ‘Chloë And The Next 20th Century’, which came out last month. Having recently shared its David Raboy-directed video, FJM played ‘Kiss Me…’ in Fallon’s New York City studio with the help of a small orchestra. Tillman and co. performed in front of a draped red curtain and purple lights, treating viewers to an intimate version of the romantic ballad. Tune in here:  In a five-star review of Father John Misty’s new album, NME wrote: “Besides its flirtations with big band-style instrumentals, ‘Chloë And The Next 20th Century’ serves as a gorgeously crafted highlight reel of the singer’s many previous styles and guises, rather than a complete reinvention. “Much of it is delivered with a wink, and is as dramatically brooding as his past work; every track is vivid yet still quietly dark as it conjures various kinds of lamentation.” Father John Misty will showcase the record on a run of UK and European headline concerts in 2023, which includes a stop-off at the O2 Academy Brixton in London. You can find any remaining tickets here.  Meanwhile, it’s been revealed that Joshua Tillman assisted Arcade Fire during the writing stages of the Canadian band’s upcoming sixth album, ‘WE’. "
        },
        "https://www.nme.com/news/music/psy-bts-achieved-gangnam-style-unfulfilled-dreams-3216886": {
            "title": "Psy says BTS have achieved ‘Gangnam Style’’s “unfulfilled dreams”",
            "content": "Psy has credited BTS with having achieved the “unfulfilled dreams” of his 2012 hit single ‘Gangnam Style’. The K-pop icon became the highest-charting Korean pop act on the Billboard Hot 100 with the track peaking at Number Two. Since then, only BTS have gone on to best his record, hitting Number One six times since 2020. Speaking at a press conference for his new album ‘PSY 9th’ – which includes the single ‘That That’, featuring and produced by BTS’ Suga – Psy reflected on the success of ‘Gangnam Style’ almost a decade ago. “It was so exhausting at the time of its success [because] the song got popular so it wasn’t a ‘healthy hit’,” he said, per fan translations. “There were even people who thought my name was ‘Gangnam Style’,” he explained of the track’s meme status in the West. “Some people overseas who would say ‘Hi, Gangnam Style’.”  Discussing the success that other Korean artists have experienced in the 10 years since ‘Gangnam Style’ was released, Psy said acts like BTS and BLACKPINK have achieved the “opposite” of his viral fame because they have gained “permanence and persistence”. “There are cases where the song increases in popularity and cases when the [artist] increases in popularity, and longevity is that much longer in the latter,” he said. He also noted that even BTS and BLACKPINK still face barriers in the West, particularly in terms of radio play. “The wall of American radio is very high because the songs are in a foreign language,” he explained. “Our biggest weapon is YouTube.” Singling out BTS, the star described the band as having “achieved unfulfilled dreams” – such as scoring a Number One hit in the US. “If they continue like this, though they’re not doing music for the sake of raising national prestige, I think they’re giving [Korea] a lot of proud moments,” Psy added. “I feel very proud that I had a role in being that trigger. BTS have thanked me for that part several times, so I’m proud of it.” In a recent interview discussing his involvement with Psy’s new single ‘That That’, BTS’ Suga revealed he wasn’t initially aware how much he would be involved with the release. “I seriously didn’t expect to be dancing with Psy,” he said. “Ah… I thought I was only writing the song.”  Psy, meanwhile, explained: “At the beginning, we met because he wanted to produce my music. Then he ended up featuring on the track. Then he ended up learning the intense choreo[graphy]. Then he ended up starring in the music video. Step by step, he got involved more and more deeply.” In other BTS news, the group will return on June 10 with a new album. It will be their first full-length record since November 2021, when they released ‘BE’. "
        },
        "https://www.nme.com/news/music/astroworld-documentary-to-be-released-this-week-despite-lawyers-concern-3217186": {
            "title": "Astroworld documentary to be released this week, despite lawyers’ concern",
            "content": "A new documentary about the 2021 Astroworld tragedy – where 10 people died and hundreds more were injured during Travis Scott‘s set at the festival – will be released this week, despite receiving pushback from promoter Live Nation. Concert Crush: The Travis Scott Festival Tragedy is an independent film helmed by documentarian Charlie Minn. In a recent interview with the Associated Press, the director said his aim was not to create a “hit piece toward Travis Scott” when making the film. “My job is to make the most truthful, honest, sincere documentary from the victims’ point of view,” he said. “We need to know about these stories to prevent it from happening again.” Live Nation, however, has not approved the film’s release. The company is currently facing multiple lawsuits over its role in promoting Astroworld, while it has also been subject to a bipartisan investigation launched by US’ House Oversight and Reform Committee. In a letter addressed to Texas state District Judge Kristen Hawkins – who, Billboard notes, is handling all pre-trial matters in the Astroworld lawsuits – Neal Manne and Kevin Yankowsky, two of the attorneys working on behalf of Live Nation, shared concerns that Concert Crush could have an impact on the outcome of the ongoing lawsuits. “The involvement of plaintiffs’ lawyers in the film, and the publicity the filmmakers and producers are trying to generate for it raise significant issues about efforts to taint the jury pool,” Manne and Yankowsky wrote. The pair have not, however, taken any legal action against Minn, nor have they made any formal effort to block to block the release of Concert Crush. Beginning this Friday (May 6), the film will screen in cinemas across 11 cities in Texas – including Houston, where the tragedy took place. A full list of the cities screening Concert Crush is available to view on the film’s website. The film will include interviews with people who survived the crowd surge at Astroworld, as well as footage from the night that shows attendees repeatedly screaming for help. In a statement to the Associated Press, Frank Alvarez – who was in attendance at Astroworld, but does not appear in Concert Crush – supported the film’s release. “It’s hard to explain to friends and family what we saw and what we actually went through,” he said, “and I think [Concert Crush] will give a lot of people the opportunity, if you weren’t there, to understand.” Last month, Scott released his first song since Astroworld – a collaboration between himself, Future and 808 Mafia producer Southside titled ‘Hold That Heat’. The rapper has been making a slow comeback since the tragedy took place – he reportedly performed a short set at a private pre-Oscars party, and a brief DJ set at a Coachella afterparty. Last month, he announced the launch of his multi-million dollar Project HEAL initiative, and said he would “always honor the victims of the Astroworld tragedy”. The rapper was, however, accused of violating a gag order by announcing the initiative. Scott is currently facing hundreds of combined lawsuits over the events that unfolded at Astroworld. "
        },
        "https://www.nme.com/news/music/new-bad-bunny-album-un-verano-sin-ti-is-arriving-this-friday-3217137": {
            "title": "New Bad Bunny album ‘Un Verano Sin Ti’ is arriving this Friday",
            "content": "Bad Bunny has revealed his fourth studio album, ‘Un Verano Sin Ti’, will be released this coming Friday (May 6). The announcement follows on from Bad Bunny’s unique reveal of the album’s title last month, when he announced ‘Un Verano Sin Ti’ via a classified car advert. The ad, which was posted under his real name of Benito A. Martinez Ocasio, listed the 2019 Bugatti Chiron 110 for $3.5million (£2.7m) and left a phone number. When fans dialed the number in the listing, a voicemail played a snippet of an unreleased track and a text message was then sent. Translated into English, it read: “Hello! Thank you for calling. There’s little time left until the album comes out. I can’t say the date yet. But I can tell you the name: ‘Un Verano Sin Ti’.” Watch Bad Bunny’s new announcement video for ‘Un Verano Sin Ti’ below:  A post shared by @badbunnypr  ‘Un Verano Sin Ti’ will reportedly feature 23 tracks. Its title translates to the phrase “a summer without you” in English. It follows on from the rapper’s multi-platinum 2020 album ‘El Último Tour Del Mundo’, which achieved Number One on the Billboard 200 – the first album entirely in Spanish to do so. Back in January, Bad Bunny announced a North and South American stadium tour. The run of dates will begin in Orlando, Florida on August 5 before continuing along throughout North America, and heading to South America in October. In addition to music, Ocasio has been dipping further into his acting career. In March, the rapper appeared in the first trailer for Bullet Train, a forthcoming action thriller directed by David Leitch and starring Brad Pitt.  Last month, it was revealed that Ocasio will star as the Marvel hero El Muerto – a wrestler with superhuman strength – in a new Spider-Man spin-off film that was announced during Sony’s panel at this year’s CinemaCon. He reportedly landed the role after Sony executives saw footage of him in Bullet Train. It’s not the only wrestling-related role Bad Bunny has taken this year, either – in January, the rapper was a surprise entrant in WWE’s Royal Rumble match and went toe-to-toe with pro-wrestlers such as Brock Lesnar, Dolph Ziggler and Sheamus. "
        },
        "https://www.nme.com/news/music/paul-weller-madness-suggs-new-collaboration-single-ooh-do-u-fink-u-r-listen-3218496": {
            "title": "Paul Weller and Suggs team up on stomping new single, ‘Ooh Do U Fink U R’",
            "content": "Paul Weller has teamed up with Suggs from Madness for a new collaborative single called ‘Ooh Do U Fink U R’ – listen below. The stomping ’60s R&B-inspired number delves into Suggs and Weller’s upbringing in Britain’s ’70s comprehensive school system in London and Woking respectively, according to a press release. “Me and Suggs have been talking about doing something together for the last few years so to see it finally happen is amazing! I love the tune and working with him,” Weller explained. “He’s truly a man of many talents. We wanted to do something special and I really think this track is.” Suggs added: “I think teachers are the best people in the world, I love them with all my heart. But you know all those great teachers you read about who dragged their pupils up, and encouraged them and made them into the best possible version of themselves they could be? Well, unfortunately, I didn’t have one of those! “‘Ooh Do U Fink U R’ was a phrase I heard more often than I wished and sums up my school years – constantly being told to know my place and keep in my box, being given no encouragement but still never giving in, and never giving up.”  He continued: “Chatting to Paul reminded me of those experiences. We both found enthusiasm and a purpose in music, and that pulled us through.” ‘Ooh Do U Fink UR’ arrives with an animated montage-style official video by longtime Madness collaborator DNO – tune in above. A limited edition numbered 7″ vinyl edition of the joint single will arrive on June 17 – you can pre-order it here. Weller and Suggs have known each on-and-off for the last four decades but began speaking regularly about music and their other shared interests during the early days of lockdown in 2020. Later, ‘Ooh Do U Fink U R’ emerged after the pair started exchanging half-finished songs, demos and lyric ideas. The track was subsequently recorded at Weller’s Black Barn Studio in Surrey.  Weller appeared on Suggs’ BBC Radio Four radio series Love Letters To London in 2019. Earlier this year, Paul Weller opened for Madness at their show at London’s Royal Albert Hall in aid of the Teenage Cancer Trust. "
        },
        "https://www.nme.com/news/music/florence-the-machine-announce-2023-australian-and-new-zealand-tour-3216255": {
            "title": "Florence + The Machine announce 2023 Australian and New Zealand tour",
            "content": "TXT have the tracklist and a preview medley for their upcoming mini-album ‘minisode 2: Thursday’s Child’. The group have also shared the production and writing credits for the new record, which will feature creative contributions from four of the five members. Yeonjun is credited on the title track ‘Good Boy Gone Bad’, ‘Trust Fund Baby’ and ‘Lonely Boy’, while Taehyun contributed to ‘Trust Fund Baby’ and ‘Thursday’s Child Has Far To Go’. Hueningkai worked on the lyrics for ‘Lonely Boy’ and Beomgyu co-produced ‘Thursday’s Child Has Far To Go’. minisode 2: Thursday's Child – Tracklist#투모로우바이투게더 #TOMORROW_X_TOGETHER #TXT #minisode2 #Thursdays_Child #GOOD_BOY_GONE_BAD pic.twitter.com/HpDmCbzWxa — BIGHIT MUSIC (@BIGHIT_MUSIC) April 30, 2022  ‘Opening Sequence’‘Good Boy Gone Bad’‘Trust Fund Baby’‘Lonely Boy’‘Thursday’s Child Has Far To Go’ TXT have also shared a preview medly of the mini-album’s five tracks, set to moody visuals that capture the dark feelings captured in the record’s songs. ‘Opening Sequence’ and ‘Thursday’s Child Has Far To Go’ are accompanied by scenes bathed in red light, while ‘Trust Fund Baby’ is based in a beautiful garden. ‘Lonely Boy’ features Yeonjun and Hueningkai in blurry bathroom scenes, while ‘Good Boy Gone Bad’ finds the whole band lighting a spark under the night sky.  On April 19 at midnight KST, the group’s label Big Hit Music uploaded a 13-second concept concept teaser for TXT’s forthcoming fourth mini-album, titled ‘minisode 2: Thursday’s Child’. The visual contains a clip of a single rose on fire, accompanied by ominous background music, before it begins to glitch out while occasionally switching to negative colour. The highly-anticipated record is due out on May 9 at 6pm KST. minisode 2: Thursday's Child – Concept Teaser#투모로우바이투게더 #TOMORROW_X_TOGETHER #TXT #minisode2 #Thursdays_Child pic.twitter.com/8LVGFEV7sw — BIGHIT MUSIC (@BIGHIT_MUSIC) April 18, 2022  The boyband previously unveiled the mini-album’s release schedule, which dates all the important drops between now and the record’s arrival. Various music video teasers will be released from May 6 to May 8. minisode 2: Thursday's Child – Promotion Scheduler#투모로우바이투게더 #TOMORROW_X_TOGETHER #TXT #minisode2 #Thursdays_Child pic.twitter.com/ca0wZOH50t — BIGHIT MUSIC (@BIGHIT_MUSIC) April 14, 2022  TXT had previously introduced their refreshed logo through a special clip in light of their forthcoming comeback. It features a dynamic animation of the logo adopted for TXT’s last album, ‘The Chaos Chapter: Freeze’, which then morphs into a rougher-looking version in red and black.  ‘minisode 2: Thursday’s Child’ will arrive approximately nine months after the release of ‘The Chaos Chapter: Fight Or Escape’, a repackaged version of their sophomore album ’The Chaos Chapter: Freeze’. Since then, the members of TXT have released several collaborations and solo covers. In February, Taehyun and Yeonjun lent their vocals to American singer-songwriter Salem Ilese’s ‘PS5’, a cut from her ‘Unsponsored Content’ EP. Notably, Ilese had co-written TXT’s viral 2021 track ‘Anti-Romantic’ from ‘The Chaos Chapter: Freeze’.  In the same month, Hueningkai released a cover of Canadian singer Avril Lavigne’s early-2000s hit ‘Sk8er Boi’, shortly after Lavigne responded to a tweet by the idol, where he referenced the track. Lavigne has since shared his rendition of her song on Twitter, where she praised it as “amazing”. Hueningkai’s version of ‘Sk8er Boi’ is the latest cover song he has released on the official TXT YouTube channel. Florence + The Machine have shared details for a five-date Australian and New Zealand tour, taking their upcoming ‘Dance Fever’ album Down Under in the first quarter of 2023. The run will start in Perth on Saturday March 4, when Florence Welch and co. take to the stage at the RAC Arena. They’ll head to Melbourne next, playing Rod Laver Arena on Wednesday March 8, before jetting up to Sydney for a gig at Qudos Bank Arena the following Monday (March 13). The last Australian show will go down at the Brisbane Entertainment Centre that Friday (March 17), with a sole Aotearoan gig pencilled in for Tuesday March 21 at Auckland’s Spark Arena. Joining the group for all five dates will be indie-pop star King Princess, who is currently hard at work on the follow-up to her 2019 debut, ‘Cheap Queen’. That record, tentatively titled ‘Hold On Baby’, is due for release later this year, with the recent singles ‘Little Brother’ and ‘For My Friends’ expected to appear on it. Tickets for all five dates of the tour go on sale at 11am local time this Friday (11am) – find Australian tickets here, and New Zealand tickets here. There will be a presale for members of Frontier Touring’s mailing list, running from 11am on Wednesday (May 4). ‘Dance Fever’ is due out on May 13 via Polydor. Announced back in March – and described by Welch as sounding like their 2009 debut ‘Lungs’ with “more self-knowledge” – the band have shared four singles from it thus far: ‘King’, ‘Heaven Is Here’, ‘My Love’ and ‘Free’. It’ll be their fifth full-length album, following 2018’s ‘High As Hope’. Last month, Welch opened up about the creation of ‘Dance Fever’, saying: “I had this drive underneath me and I was like if these songs want to get out, I have to get them out fast, because I do have other desires. The thing I’ve always been sure of is my work, but I do start to feel this shifting of priorities, this sense of like…maybe I want something different.”  The band debuted tracks from the album live in Newcastle last month, performing a series of new cuts including the unreleased ‘Girls Against God’. They’ll embark on an arena tour of the UK and Europe later this year, taking in 11 shows between Paris and Dublin this November. It’ll follow an expansive tour throughout North America, where the band will play shows with Arlo Parks, Sam Fender, King Princess, Yves Tumor, Japanese Breakfast and Wet Leg on select dates. MARCHSaturday 4 – Perth, RAC ArenaWednesday 8 – Melbourne, Rod Laver ArenaMonday 13 – Sydney, Qudos Bank ArenaFriday 17 – Brisbane, Entertainment CentreTuesday 21 – Auckland, Spark Arena "
        },
        "https://www.nme.com/news/music/watch-portishead-perform-live-for-the-first-time-since-2015-3216974": {
            "title": "Watch Portishead perform live for the first time since 2015",
            "content": "Portishead performed live last night (May 2) for the first time in seven years as part of a War Child UK benefit gig for Ukraine at O2 Academy in Bristol. Marking the first time the trio had played a show since their 2015 appearance at Benicàssim Festival, Portishead performed five songs – ‘Mysterons’, ‘Wandering Star’ and ‘Roads’ from 1997’s ‘Dummy’, and ‘Magic Doors’ and ‘The Rip’ from 2008’s ‘Third’. Elsewhere on the bill were headliners IDLES along with sets by Billy Nomates, Katy J Pearson, Heavy Lungs, Willie J Healy and Wilderman. Watch snippets of Portishead’s set below: .@Portisheadinfo are LIVE right now for the first time since 2015! There's still time to tune in. Donate £5 to watch > https://t.co/0AKyp8FJEu #WarChild @o2academybris pic.twitter.com/Dw9oRN7Hpg — War Child UK (@WarChildUK) May 2, 2022  PORTISHEAD – Roads 02/05/2022 #Portishead #WarChild @Portisheadinfo @o2academybris pic.twitter.com/pi5CylhxAv — KID A (@KID_A_OK) May 2, 2022  Portishead pic.twitter.com/EyfkFcBoru — Dan Grabham (@dangrabham) May 2, 2022  A very special performance from #Portishead Reunited for Ukraine Charity gig @WarChildUK @Portisheadinfo pic.twitter.com/QOkIj4gJtC — Rhian Chase (@DrRhianFuge) May 2, 2022  Tickets for the benefit gig, which was announced last month, were only made available through a £10 donation prize draw, with winners selected at random. All proceeds from the concert will go to War Child UK to assist with the crisis in Ukraine. Matched funding from the UK government will also go to humanitarian efforts in Yemen. “We are really pleased to be able to support the people of Ukraine by performing a few songs at this event in collaboration with the amazing War Child charity,” Portishead commented upon the show’s announcement. The show is one of many benefit concerts that have been organised to help the people of Ukraine amid Russia’s ongoing invasion of the country. ITV’s Concert for Ukraine benefit show aired in support of Disasters Emergency Committee‘s Ukraine Humanitarian Appeal in March, featuring performances from Ed Sheeran, Manic Street Preachers and more. The concert raised over £12million, with the figure expected to rise.  Arcade Fire, meanwhile, recently performed benefit concerts for Ukraine in New Orleans and New York. The latter, a series of four gigs in March, raised over $100,000 for the PLUS1 Ukraine Relief Fund. "
        },
        "https://www.nme.com/news/music/watch-axl-rose-and-carrie-underwood-perform-guns-n-roses-songs-at-stagecoach-festival-3216245": {
            "title": "Watch Axl Rose and Carrie Underwood perform Guns N’ Roses songs at Stagecoach Festival",
            "content": "Axl Rose stopped by this year’s Stagecoach Festival to perform a pair of Guns N’ Roses songs with Carrie Underwood – see footage below. The 2022 edition of the country music festival began on Friday (April 29) at Indio, California’s Empire Polo Club – the same venue as Coachella – and ends tonight (May 1). During Underwood’s Saturday (April 30) headline slot, Rose joined the country singer to perform his band’s classic songs ‘Sweet Child O’ Mine’ and ‘Paradise City’. Underwood started by performing the opening verse and chorus of ‘Sweet Child O’ Mine’ with her band before introducing Rose. “Welcome to the greatest night of my life. Give it up for Axl Rose!” she told the crowd. The pair then immediately launched into ‘Paradise City’. “You thought we were finished?” Underwood told the audience. See footage from their Stagecoach performance below. Sweet Child O' Mine & Paradise CityCarrie Underwood with Axl Roseat the Stagecoach Festival pic.twitter.com/DcXDWimhQl — Suicide Shift (@ss_info) May 1, 2022  Axl Rose joined Carrie Underwood last night during her headlining set at Stagecoach to perform Guns N Roses' hits 'Paradise City' and 'Sweet Child O'Mine.' pic.twitter.com/jkpx7J1kZb — Bops And Bangers (@bopsandbangers) May 1, 2022  That was pretty epic! @carrieunderwood @axlrose @Stagecoach #Day2 #GenXer pic.twitter.com/rar7kRvcaK — Nora E. Vargas (@NoraVargasSD) May 1, 2022  Watch Carrie Underwood and Axl Rose perform Sweet Child O' Mine together at Stagecoach!! Did you enjoy it?Retweet if you did!! pic.twitter.com/s886GWxU51 — Metalhead Marv🇨🇦 (@MetalheadMarv) May 1, 2022  “Welcome to the greatest night of my life, give it up for Axl Rose!” – Carrie Underwood “Sweet Child O’ Mine” Axl Rose & Carrie Underwood ao vivo no Stagecoach Country Music Festival em Indio, ontem a noite, 30/04/22. #stagecoach2022#carrieunderwood #axlrose #GunsNRoses pic.twitter.com/Fn5ImygVc3 — gunsnroses (eterno) (@gnreternobr) May 1, 2022  @stagecoach day 2 was a \"Paradise City\". Epic performance by @carrieunderwood with the legendary Axl Rose. This was by far her best set at Stagecoach. Such a great night. #Stagecoach2022 #ParadiseCity #GunsNRoses pic.twitter.com/UaH4T8HWtm — Ramil Sales (@Ramilds89) May 1, 2022  Underwood, a longtime GNR fan, told E! in 2015 that she really wanted to sing with Rose at some point in her life. “I’ve covered enough Guns N’ Roses stuff, and it was people like him who taught me how to sing,” she said. “I look at people like him and Freddie Mercury, those people who were doing all these crazy runs. It was so different,” Underwood added. In 2013, Underwood performed a cover of ‘Paradise City’ at the CMA Music Festival in Nashville. Elsewhere during her Stagecoach set, Underwood dedicated her performance of ‘See You Again’ to Naomi Judd – one half of country duo The Judds – who died this weekend at the age of 76, her family confirmed. ‘Last Name’‘Undo It’‘Cowboy Casanova’‘Good Girl’‘Denim & Rhinestones’‘Wasted’‘Church Bells’‘Ghost Story’‘Two Black Cadillacs’‘Blown Away’‘Crazy Angels’‘Cry Pretty’‘Jesus, Take The Wheel’/’How Great Thou Art’‘See You Again’‘If I Didn’t Love You’‘Flat On The Floor’‘Sweet Child O’ Mine’ (with Axl Rose)‘Paradise City’ (with Axl Rose)‘Smoke Break’‘Something In The Water’ ENCORE:‘Before He Cheats’  Meanwhile, this year’s edition of Stagecoach has banned “divisive symbols” including Confederate flags. A section on the festival’s rules page lists things that are prohibited from being brought into the event, including “Confederate flags and racially disparaging or other inappropriate imagery/public displays”. "
        },
        "https://www.nme.com/news/music/oliver-tree-says-the-kid-larois-thousand-miles-videos-copies-multiple-shots-from-his-own-3216979": {
            "title": "Oliver Tree says The Kid LAROI’s ‘Thousand Miles’ video copies multiple shots from his own",
            "content": "American artist Oliver Tree has called out Christian Breslauer, the director of The Kid LAROI‘s video for new single ‘Thousand Miles’, accusing Breslauer of copying multiple shots from his own videos. Last week, Tree took to Instagram, sharing a video that compared scenes from LAROI’s ‘Thousand Miles’ with sections from the clips for his songs ‘Miracle Man’, ‘Hurt’, ‘Alien Boy’ and his Lil Yachty collaboration ‘A$$hole’. “Kid LAROI’s new music video copies multiple shots from my videos. As an underground indie artist who writes and directs their own music videos, I am so sick of big artists ripping me off,” Tree says during the Instagram video. “Now, I know it’s not Kid LAROI’s fault, so I looked into the director, and it turns out this dude follows me on Instagram. Coincidence? I think not.” It is not known if Breslauer has seen Tree’s video.  A post shared by Oliver Tree (@olivertree)  Since uploading the comparison clip to Instagram and TikTok, The Kid LAROI’s posts about the ‘Thousand Miles’ video have been flooded with comments from fans accusing the singer of stealing concepts for the video from Tree. Now, speaking to Rolling Stone, Tree has since elaborated on the similarities between the videos. “The exact same frame, the exact same ambulance, the exact same thing. It just seemed a little bit odd that even the framing is exactly the same,” the he told the publication. “It’s all about taking something that exists and flipping it and doing something new, but you got to be smart about it,” Tree added. The songwriter continued that he had decided not to pursue legal action against Breslauer or LAROI, and that while he wasn’t “trying to ruin the guy’s career”, he did want to raise awareness around the issue of smaller artists having their work used as inspiration for more prominent acts.  Neither Breslauer nor The Kid LAROI have commented on the perceived similarities. NME has reached out to a representative for LAROI. "
        },
        "https://www.nme.com/news/music/bauhaus-announce-exclusive-london-brixton-academy-show-3218595": {
            "title": "Bauhaus announce London Brixton Academy show",
            "content": "Bauhaus have announced a show at London’s O2 Academy Brixton. The news follows the band releasing their track ‘Drink New Wine’ in March, which was the band’s first new music in 14 years. Their upcoming London gig is set for August 19, with tickets available starting at 10am BST Friday (May 6). Tickets will be available here. The band also recently announced their first US tour in more than 16 years, with headline shows in Portland, Seattle, San Francisco, Denver, and New York.  A post shared by Bauhaus (@bauhausthebandofficial)  Bauhaus will also join Morrissey and Blondie on the line-up for Cruel World festival. It will take place on May 14 and 15 this year at Brookside at The Rose Bowl in Pasadena, California. Other names on the bill include Devo, Echo & The Bunnymen, The Psychedelic Furs, Violent Femmes, Public Image Ltd and more. Their latest track, ‘Drink New Wine’, was recorded during lockdown with the band sharing audio files without hearing what their other bandmates had recorded, utilising the Surrealist “exquisite corpse” method to compose the song.  Back in 2018, Murphy and J hit the road in the UK for a string of shows celebrating 40 years of Bauhaus. The December run concluded with a performance at London’s O2 Forum in Kentish Town. Following their 1980 debut record ‘In The Flat Field’, Bauhaus released a further four studio albums – ‘Mask’ (1981), ‘The Sky’s Gone Out’ (1982), ‘Burning From The Inside’ (1983) and ‘Go Away White’ (2008). Speaking to NME upon the release of their latest effort, David J said that the band’s “chemistry was so volatile” during its recording that they decided to go their separate ways once again. “The record definitely feels like a final statement,” he explained. "
        },
        "https://www.nme.com/news/music/billie-eilish-announces-climate-focused-event-overheated-in-london-3217206": {
            "title": "Billie Eilish announces climate-focused event ‘Overheated’ in London",
            "content": "Billie Eilish has announced details of Overheated, a multi-day climate-focused event that is set to take place at The O2 in London next month. The six-day event will take place on June 10-12, 16 and 25-26 to coincide with the UK and Ireland leg of the singer’s ‘Happier Than Ever’ world tour (you can find any remaining tickets to the tour here). Overheated will bring together climate activists, musicians and designers at venues across The O2 to “discuss the climate crisis and the work they are doing to make a difference”, according to a press release. Subjects such as developing greening practices in the music industry, the benefits of a plant-based diet and sustainable fashion are set to be explored during panel discussions. Live performances, screenings of the Overheated documentary (which features appearances from Yungblud, Glastonbury‘s Emily Eavis and Girl In Red) and climate action opportunities are also promised. Billie Eilish’s ‘Overheated’ (Picture: Press) Eilish and her brother and collaborator Finneas are set to give introductions during the event on June 10, while a special keynote speaker is also set to be confirmed. Sigrid will perform live during Overheated‘s ‘Music Climate Session’ on June 16. All profits from ticket sales for Overheated will be donated to the organisations Support + Feed and REVERB. Maggie Baird, founder of Support + Feed, said in a statement: “We are thrilled to be in London and to have this opportunity to connect and discuss different ways we can take action to mitigate the climate crisis.” Pre-sale tickets, which are available for The O2, Priority and Live Nation customers as well as fans who opted in when purchasing ‘Happier Than Ever’ UK tickets, will go on sale tomorrow (May 4) at 9am. General sale will then follow on Friday (May 6) at 9am. You can find out more information about Overheated by heading here.  Eilish was among the artists who supported the recent launch of the “US chapter” of Music Declares Emergency, which is dedicated to guiding the music industry’s response to the global climate and ecological emergency. "
        },
        "https://www.nme.com/news/music/sammy-hagar-and-the-circle-cover-my-hero-to-honour-taylor-hawkins-3217168": {
            "title": "Sammy Hagar And The Circle cover ‘My Hero’ to honour Taylor Hawkins",
            "content": "Former Van Halen singer Sammy Hagar – who’s currently touring with his supergroup project, The Circle – has performed a cover of the Foo Fighters‘ 1997 hit ‘My Hero’, in honour of the band’s late drummer Taylor Hawkins. Sammy Hagar And The Circle were brought on-board to headline the Beale Street Music Festival – which took place in Memphis last Friday (April 29) – after Hawkins died on March 25, just hours before the band were due to headline a festival in Bogotá, Columbia. Foo Fighters later cancelled their entire slate of upcoming gigs in the wake of Hawkins’ passing, which included an appearance at Beale Street. In a message shared alongside a video of his cover, Hagar wrote that he initially refused the offer to fill the Foo Fighters’ spot, but came around after a meeting with the rest of The Circle. He explained: “We came up with, ‘Why not! Let’s just go play music… you’re at a big ass Circle party for those people, [let’s] just do what we do!’ “With Dave Grohl’s blessings, we decided to do a broken-down version of one of my favorite songs from one of my favorite bands. It felt appropriate. No rehearsal – after all, this is rock & roll and that’s what it’s all about.” Have a look at Sammy Hagar And The Circle covering ‘My Hero’ below:  Hagar and co.’s cover of ‘My Hero’ adds to the dozens of tributes shared in Hawkins’ honour since his passing. Others have come from the likes of Coldplay, Liam Gallagher, Stereophonics, Stevie Nicks, Sir Elton John, Slash, Joan Jett, the surviving members of Rush, Yungblud, Sir Paul McCartney and Royal Blood. The drummer was also paid tribute at the 2022 Grammy Awards ceremony. Yesterday (May 3), Warpaint‘s Stella Mozgawa recalled the time her teenage band opened for Foo Fighters in an interview with Hot Press. She hailed the late musician as a “titan of the drumming world,” and described the experience as “invaluable and unexplainable”.  Hawkins’ first posthumous release – a cover of Johnny Winter’s 1970 track ‘Guess I’ll Go Away’, which he recorded with Johnny’s brother Edgar – was released last month. It came as part of a tribute album, ‘Brother Johnny’, that Edgar released in his sibling’s memory; the Texan blues-rocker died in 2014 at the age of 70. Hagar, meanwhile, is continuing to tour with The Circle – which features his former Van Halen and Chickenfoot bandmate Michael Anthony – for most of 2022, including several shows with blues guitarist and ‘Bad To The Bone’ singer George Thorogood. "
        },
        "https://www.nme.com/news/music/yeah-yeah-yeahs-preview-new-music-as-they-confirm-new-york-and-los-angeles-3216853": {
            "title": "Yeah Yeah Yeahs announce new music and confirm New York and LA shows",
            "content": "Yeah Yeah Yeahs have shared a snippet of new music while announcing headline shows in New York and Los Angeles. The band also announced that they’ve signed to Secretly Canadian ahead of releasing new music this Fall. After teasing the gigs over the weekend, the Karen O-led trio have confirmed they’ll take to the stage at NYC’s Forest Hills Stadium on October 1 before visiting the Hollywood Bowl in Los Angeles, California on October 6. The Linda Lindas will open for the band on both dates, with Japanese Breakfast also appearing as a special guest in LA. An additional support act for the New York concert is still to be announced. It’ll mark the first time be the first time Yeah Yeah Yeahs have played headline shows in New York and Los Angeles since 2017 and 2018 respectively. “It’s with true life affirming pleasure to announce our two headline shows in our two hometowns NYC AND LA supported by two wildly gifted bands Japanese Breakfast and The Linda Lindas at the Hollywood Bowl, with The Linda Lindas supporting in Forest Hills and our other support TBA soon!” O said of the band’s latest news. “Representin’ a few generations yo! “Cannot wait to see you there! New music! New Era! And New Home with Secretly Canadian! Much to celebrate!” YYY US DATES!  It's with true life affirming pleasure to announce our two headline shows in our two hometowns NYC AND LA! pic.twitter.com/PQehIatfdV — Yeah Yeah Yeahs (@YYYs) May 2, 2022  Tickets go on general sale at 10am local time this Friday (May 6) – buy yours here. Fans can access a pre-sale at the same time on Wednesday (May 4) by using the password DressUP22. YYYs shared the news of their US live comeback in a video featuring a slice of new material. Reminiscent of their acclaimed third album ‘It’s Blitz!’, the ’80s-sounding and synth-heavy instrumental plays over a filtered close-up of Karen O’s eyes. The clip then fades out to reveal all of Yeah Yeah Yeahs’ 2022 headline shows, which include next month’s appearances in Manchester and London as well as Melbourne and Sydney dates in July. See the video here: pic.twitter.com/XoDvEVdUXS — Yeah Yeah Yeahs (@YYYs) May 2, 2022  Upon announcing their first UK headline shows in nine years in March, Yeah Yeah Yeahs revealed that they had “some tunes so fresh and so NEW to try out” on the tour. Any remaining tickets for those dates are available here. Yeah Yeah Yeahs’ most recent studio album, ‘Mosquito’, came out back in 2013. They last performed in the UK as part of London’s All Points East festival in 2018. NME described that set as “a tight and tumultuous hour without an ounce of flab in sight”. Back in February 2020, Karen O said she felt “ready to make some music” with YYYs following the group’s lengthy hiatus. “It feels like time to have something new out there,” the frontwoman explained. “But that’s yet to happen, so we’ll see how this year goes.”  Yeah Yeah Yeahs are also scheduled to perform at Primavera Sound 2022 in Barcelona next month. "
        },
        "https://www.nme.com/news/music/blossoms-share-video-for-stripped-back-version-of-everything-about-you-watch-listen-3216834": {
            "title": "Blossoms share video for new stripped-back version of ‘Everything About You’",
            "content": "Blossoms have shared a special version of ‘Everything About You’ from their new film Ribbon Around The Bomb – watch below. Directed by Edwin Burdis (who worked with Arctic Monkeys on the visuals for ‘Tranquility Base Hotel & Casino’ and ‘AM’), the project serves as a companion piece to the Stockport band’s fourth album of the same name. Tomorrow (May 3) Blossoms will premiere the Ribbon Around The Bomb film at Stockport Plaza Theatre in their hometown before performing their new record in its entirety. Ahead of the event, the group have today (May 2) offered a preview in the form of ‘Everything About You’. In the clip, frontman Tom Odgen sits alone in Stockport Plaza as we hear a stripped-back acoustic take on the aforementioned song. Tune in here:  ‘Everything About You’ a special version of the track taken from ‘Ribbon Around The Bomb’ a film directed by Edwin Burdis @DahDitDit1. Watch the video now at the following link https://t.co/jhUuy909cI pic.twitter.com/k9FUjZgek4 — B L O S S O M S (@BlossomsBand) May 2, 2022  Speaking of the film previously, Ogden explained: “We created a script for this film so that we could rip it up…It was an absolute pleasure to collaborate with Blossoms and such diversely talented practitioners and performers on this project. “The Stockport Plaza was a joy to work in and it very much became an unexpected central character of the piece. Whilst a lot of time and care went into crafting the script, the cast and crew had full permission to improvise, which really allowed creativity to flow.” Blossoms are due to showcase their latest album at a string of UK live shows this summer, including headline appearances at Y Not and Truck Festival, as well as support dates with The Killers.  In a four-star review of ‘Ribbon Around The Bomb’, NME wrote: “It’s a coming-of-age moment for the band, and there’s no question Blossoms have levelled up with this release, sealing their status as giants of the game with more earnest and open songwriting.” It added: “Whatever this Stockport gang do next, they won’t falter as long as they do it in their own indelible and charming way.” "
        },
        "https://www.nme.com/news/music/txt-minisode-2-thursdays-child-release-date-details-tracklist-teaser-3204578": {
            "title": "TXT share tracklist and preview medley for ‘minisode 2: Thursday’s Child’",
            "content": "TXT have the tracklist and a preview medley for their upcoming mini-album ‘minisode 2: Thursday’s Child’. The group have also shared the production and writing credits for the new record, which will feature creative contributions from four of the five members. Yeonjun is credited on the title track ‘Good Boy Gone Bad’, ‘Trust Fund Baby’ and ‘Lonely Boy’, while Taehyun contributed to ‘Trust Fund Baby’ and ‘Thursday’s Child Has Far To Go’. Hueningkai worked on the lyrics for ‘Lonely Boy’ and Beomgyu co-produced ‘Thursday’s Child Has Far To Go’. minisode 2: Thursday's Child – Tracklist#투모로우바이투게더 #TOMORROW_X_TOGETHER #TXT #minisode2 #Thursdays_Child #GOOD_BOY_GONE_BAD pic.twitter.com/HpDmCbzWxa — BIGHIT MUSIC (@BIGHIT_MUSIC) April 30, 2022  ‘Opening Sequence’‘Good Boy Gone Bad’‘Trust Fund Baby’‘Lonely Boy’‘Thursday’s Child Has Far To Go’ TXT have also shared a preview medly of the mini-album’s five tracks, set to moody visuals that capture the dark feelings captured in the record’s songs. ‘Opening Sequence’ and ‘Thursday’s Child Has Far To Go’ are accompanied by scenes bathed in red light, while ‘Trust Fund Baby’ is based in a beautiful garden. ‘Lonely Boy’ features Yeonjun and Hueningkai in blurry bathroom scenes, while ‘Good Boy Gone Bad’ finds the whole band lighting a spark under the night sky.  On April 19 at midnight KST, the group’s label Big Hit Music uploaded a 13-second concept concept teaser for TXT’s forthcoming fourth mini-album, titled ‘minisode 2: Thursday’s Child’. The visual contains a clip of a single rose on fire, accompanied by ominous background music, before it begins to glitch out while occasionally switching to negative colour. The highly-anticipated record is due out on May 9 at 6pm KST. minisode 2: Thursday's Child – Concept Teaser#투모로우바이투게더 #TOMORROW_X_TOGETHER #TXT #minisode2 #Thursdays_Child pic.twitter.com/8LVGFEV7sw — BIGHIT MUSIC (@BIGHIT_MUSIC) April 18, 2022  The boyband previously unveiled the mini-album’s release schedule, which dates all the important drops between now and the record’s arrival. Various music video teasers will be released from May 6 to May 8. minisode 2: Thursday's Child – Promotion Scheduler#투모로우바이투게더 #TOMORROW_X_TOGETHER #TXT #minisode2 #Thursdays_Child pic.twitter.com/ca0wZOH50t — BIGHIT MUSIC (@BIGHIT_MUSIC) April 14, 2022  TXT had previously introduced their refreshed logo through a special clip in light of their forthcoming comeback. It features a dynamic animation of the logo adopted for TXT’s last album, ‘The Chaos Chapter: Freeze’, which then morphs into a rougher-looking version in red and black.  ‘minisode 2: Thursday’s Child’ will arrive approximately nine months after the release of ‘The Chaos Chapter: Fight Or Escape’, a repackaged version of their sophomore album ’The Chaos Chapter: Freeze’. Since then, the members of TXT have released several collaborations and solo covers. In February, Taehyun and Yeonjun lent their vocals to American singer-songwriter Salem Ilese’s ‘PS5’, a cut from her ‘Unsponsored Content’ EP. Notably, Ilese had co-written TXT’s viral 2021 track ‘Anti-Romantic’ from ‘The Chaos Chapter: Freeze’.  In the same month, Hueningkai released a cover of Canadian singer Avril Lavigne’s early-2000s hit ‘Sk8er Boi’, shortly after Lavigne responded to a tweet by the idol, where he referenced the track. Lavigne has since shared his rendition of her song on Twitter, where she praised it as “amazing”. Hueningkai’s version of ‘Sk8er Boi’ is the latest cover song he has released on the official TXT YouTube channel. "
        },
        "https://www.nme.com/news/music/megan-thee-stallion-day-houston-3216625": {
            "title": "May 2 has officially been declared Megan Thee Stallion Day in Houston",
            "content": "May 2 has officially been declared Megan Thee Stallion Day in Houston, where the rapper grew up. Megan Pete was honoured at a ceremony on Sunday (May 1) in which Houston Mayor Sylvester Turner along with members of Houston City Council celebrated her philanthropic achievements, which include launching the Pete and Thomas Foundation in 2021. The non-profit, set up to honour Pete’s late mother and father, focuses on programs that address education, housing, health and wellness in Houston, Texas, and elsewhere. “Megan Thee Stallion has an extraordinary entertainment career, but we wanted to honor her for what she does offstage to lift people’s lives in underserved communities,” Turner said while presenting Megan with the key to the city. “She assisted people after the 2021 winter storm, during the pandemic, and helped those struggling with homelessness. I look forward to watching her grow as an artist and humanitarian.”  May 2 is a significant date for Meg, whose mother and grandmother were both born on the date. During her speech, Megan acknowledged both, saying they helped her “grow into the woman that I am today”. “I don’t know what kind of lady I would be if granny didn’t raise me to be so kind and so giving. You could walk by these ladies’ house and they givin’ out dollars, candy — whatever they’ve got, they’re givin’ it out the door. “And I always wanted to be just like that. I wanted to be nice like them. They made me feel so beautiful and so loved, and they made everybody they met feel just like that. So I was like, ‘When I grow up, I wanna be just like them.'”  Following the ceremony, Megan took to Instagram to share photos from the event, adding that she plans to “continue to give back to the city that made me who I am today”.  A post shared by Megan Thee Stallion (@theestallion)  Last month, Meg released her latest single ‘Plan B’ after debuting it live during her performance at this year’s Coachella Festival. It followed on from her Dua Lipa collaboration ‘Sweetest Pie’ in March – both tracks are set to feature on her forthcoming second studio album. "
        },
        "https://www.nme.com/news/music/lady-gaga-snippet-preview-hold-my-hand-listen-tom-gun-maverick-soundtrack-3216795": {
            "title": "Listen to a snippet of Lady Gaga’s ‘Top Gun: Maverick’ track, ‘Hold My Hand’",
            "content": "Lady Gaga has shared a brief snippet of her upcoming Top Gun: Maverick song ‘Hold My Hand’ – check it out below. The pop star announced the track last week, revealing that she had been working on it “for years”. Due to arrive tomorrow (May 3), ‘Hold My Hand’ was produced by Gaga along with BloodPop and Benjamin Rice. It also features production and score music by Harold Faltermeyer and Hans Zimmer. Gaga has now shared a 10-second clip of the single’s official video. In the snippet, we hear the singer deliver the line “I won’t let go ’til the end” ahead of a dramatic, thunderous drum break. The accompanying black-and-white visuals find Gaga sitting beneath the wing of a plane in an aircraft hanger. Tune in here:  A post shared by Lady Gaga (@ladygaga)  Speaking previously about her contribution to the Top Gun: Maverick soundtrack, Gaga explained: “When I wrote this song for Top Gun: Maverick, I didn’t even realise the multiple layers it spanned across the film’s heart, my own psyche, and the nature of the world we’ve been living in. “I’ve been working on it for years, perfecting it, trying to make it ours. I wanted to make music into a song where we share our deep need to both be understood and try to understand each other – a longing to be close when we feel so far away and an ability to celebrate life’s heroes.” Gaga went on to describe ‘Hold My Hand’ as “a love letter to the world during and after a very hard time”, adding: “I’ve wanted you to hear it for so long. And I’m so excited to give it to you on May 3.”  Top Gun: Maverick hits cinemas on May 27 after the project faced numerous delays, including some due to COVID restrictions. The film was initially scheduled for release on July 12, 2019. Alongside Tom Cruise, the cast includes Miles Teller, Jennifer Connelly, Jon Hamm, Glen Powell, Ed Harris and Val Kilmer, the latter of whom reprises his role as Iceman. "
        },
        "https://www.nme.com/news/music/harry-styles-announces-special-one-night-only-london-gig-3217248": {
            "title": "Harry Styles announces special ‘One Night Only’ London gig",
            "content": "Harry Styles has announced details of a special ‘One Night Only’ show in London to celebrate the release of his new album ‘Harry’s House’. The artist’s third studio album, the follow-up to 2019’s ‘Fine Line’, is set for release on May 20 via Columbia. After recently announcing a ‘One Night Only’ gig in New York to celebrate the arrival of ‘Harry’s House’, Styles has now confirmed that he will also perform at London’s O2 Academy Brixton on May 24 to welcome the new LP. The gig will see Styles performing songs from the new album for the first time, according to a press release. Harry’s House Live From London. May 24th. pic.twitter.com/Ld7GpJVLig — Harry Styles. (@Harry_Styles) May 3, 2022  Tickets for Styles’ ‘One Night Only’ London gig will be available in a pre-sale (available to American Express Card Members, O2 Priority members and fans who pre-order ‘Harry’s House) on May 10, before a general sale begins at 10am on May 11. Tickets will be available to buy here next week. Styles recently debuted two tracks from ‘Harry’s House’ during his Coachella 2022 headline set. His performance at the first weekend of the festival last month saw him premiere ‘Boyfriends’ and ‘Late Night Talking’, while also giving his chart-topping single ‘As It Was’ its first live airing.  The first trailer for Don’t Worry Darling, which features Styles in his first lead movie role, was released yesterday (May 2). The musician will play Jack in the film, husband of Florence Pugh’s housewife Alice, who begins to question the experimental utopian community the couple live in. "
        },
        "https://www.nme.com/news/music/new-glastonbury-2022-map-revealed-3218413": {
            "title": "New Glastonbury map revealed for 2022",
            "content": "Glastonbury has revealed the new and updated map for this year’s festival – check it out below. The Worthy Farm event is set to take place between June 22-26 following a two-year COVID-enforced hiatus, with Billie Eilish, Paul McCartney and Kendrick Lamar set to top the bill over the weekend. Today (May 4) festival organisers shared the official Glastonbury 2022 map, which offers ticketholders a preview of what’s changed on the site since the festival last took place in 2019. As previously confirmed, Glasto’s iconic giant spider has returned to the late-night area Arcadia. It comes after Arcadia Spectacular Ltd. was denied planning permission to keep the Pangea crane on the site all year round following its introduction three years ago. Elsewhere, the Beat Hotel has been replaced by a new venue called San Remo, while the Silver Hayes dance area has been extended to accommodate a new venue, the Lonely Hearts Club. Did someone say NEW MAP?! Exciting!https://t.co/pFqjDSv7WT#twisto #Glastonbury #glasto pic.twitter.com/Jh60oKOI6K — GlastoTwisto (@GlastoTwisto) May 4, 2022  Firmly Rooted, the recently confirmed Silver Hayes addition, is, however, currently absent from this latest map. Elsewhere, Glasto’s BBC Introducing Stage is located in a different spot for 2022. The Common venue Samula, meanwhile, has seemingly been replaced by Totem. You can check out an image of the Glastonbury 2022 map above, and find a high-resolution version on the festival’s official website. In other news, festival organisers are continuing to drip-feed individual line-up posters for Glastonbury’s multitude of areas and stages. The full bill for Shangri-La arrived earlier today, while Left Field’s programme of music and debate landed yesterday (May 3). Elsewhere at Glastonbury 2022, Arcadia will welcome DJ sets from the likes of Calvin Harris, Four Tet and Nia Archives, while Fatboy Slim, Romy and Mura Masa will all perform in Silver Hayes. Sugababes and The Damned appear on the eclectic line-up for the Field Of Avalon.  Last weekend saw Lewis McLaughlin win Glastonbury’s Emerging Talent Competition 2022, with Crae Wolf and English Teacher finishing as runners-up. All seven of the finalists at this year’s competition will play at next month’s festival. "
        },
        "https://www.nme.com/news/music/the-locust-drummer-gabe-serbian-has-died-aged-44-3216628": {
            "title": "The Locust drummer Gabe Serbian has died, aged 44",
            "content": "Gabe Serbian, longtime drummer for San Diego grindcore band The Locust, has died at the age of 44. The news was confirmed via the band’s social media channels, with a statement sharing that Serbian passed on April 30. “This world will miss Gabe as a friend, family member, musician, and artist,” the statement reads. “He will continue to live on in so many ways and through everyone he has connected with during his time with us. May 1st is his birthday, and we hope that you can find a way to celebrate his life. During this difficult time we ask that you give Gabe’s family privacy.” The Locust frontman Justin Pearson paid tribute to Serbian on Instagram, writing, “I wish I understood even a fraction of why things are the way they are in this world. Gabe Serbian passed away yesterday, and today would have been his 45th birthday. He was unlike any other human being I have encountered. He was the rarest of the rare. “I like to think he and I had shared telepathy through music. He will be with me every single time I am on stage for the rest of my life. I am grateful for every second we shared together on this planet. I already miss him more than imaginable. I will miss him forever.”  A post shared by The Locust (@the_locust_official)   A post shared by Justin Pearson (@justinpearson31g)  Serbian joined The Locust in 1998, playing guitar on the band’s eponymous debut album that year. He switched to drums in 2001, a role he continued to play in the band up until his death. The Locust released two more full-length albums – 2003’s ‘Plague Soundscapes’ and 2007’s ‘New Erections’ – along with multiple EPs, a rarities compilation and live album. Outside of The Locust, Serbian performed as part of Cattle Decapitation from 1996 to 2001, and played with Le Butcherettes, Zu and more. He also performed in numerous side projects with other members of The Locust, such as Retox, Holy Molar and Head Wound City, which also featured members of the Blood Brothers and Nick Zinner of the Yeah Yeah Yeahs. "
        },
        "https://www.nme.com/news/music/poet-hanif-abdurraquib-on-curating-brooklyn-academy-of-musics-spring-series-3218358": {
            "title": "Poet Hanif Abdurraqib on curating  at Brooklyn Academy of Music: “We’re building a world around the vastness of Black performance”",
            "content": "Poet Hanif Abdurraqib has spoken to NME about curating Brooklyn Academy of Music’s spring 2022 music series to “build a world around the vastness of Black performance”. Through multiple books, including Go Ahead in the Rain: Notes on A Tribe Called Quests and A Little Devil in America: Notes in Praise of Black Performance, the National Book Award finalist and MacArthur “Genius Grant” recipient has built a career focused on extending the “understanding of the multitudinous and global nature of Black performance.” With the intention of highlighting Black musicianship, celebrating the return of in-person communal experiences, and “expanding my imagining of what a live music concert can be”, the essayist and critic organised America’s oldest performing arts centre’s first foray into live music since the start of the COVID pandemic. The intimate and creative shows, which kicked off on February 25 and run until June 11, have featured Abdurraqib’s hand-picked selection of artists, including Moses Sumney, Bartees Strange, Devonté Hynes, and L’Rain, with performances from Mavis Staples, and the premiere of Omar Offendum’s hip-hop musical, Little Syria taking place later this month, and a show featuring Nikki Giovanni set for June. Hanif Abdurraqib introduces BAM performances CREDIT: Edwina Hay “It’s interesting to be in a position where you can do anything, because my initial response was, ‘Well I don’t wanna do anything’,” Abdurraqib told NME. When BAM reached out and said, “We’ll give you Howard Gilman Opera House and this budget and the rest is up to you,” he found the proposition exciting – but also daunting – because, “That kind of freedom comes with an expectation that you will not mess it up.” However, once he “took that freedom and offered it to artists”, he wanted to see perform, asking them: “What would you do if you had time and a space to build something creative and challenge yourself without the constraints of a typical touring schedule or a touring set list?” he was able to shake himself “free of anxieties”. For Abdurraqib, putting on the series of shows was his “wildest dream”, and he wanted to “live up to the enormity of that dreaming” once BAM gave him the opportunity to make it a reality. BAM audience during intermission CREDIT: Edwina Hay “I remember the first show, I was so nervous,” he recalled of the February 25 performance, which featured Mdou Moctar and Bartees Strange. “It had sold out, but part of me was still like, are people going to come to this? I also hadn’t been to a show of that scale in a long time and had been slowly easing myself back into live music.” During the performance, he decided to stand side stage for Strange’s “wonderful” set, before heading to the box seats for the rest of the show. “I kind of looked down on the entire crowd and there was a point where they started playing the album in acoustic, and then moved to electric and he asked people to stand up,” he said, noting how that moment in the show stood out to him. “It wasn’t a demand or a command but people were so eager to move, to stand and dance in the aisles.” The author also told us that each evening had been a “singular” experience, adding that for Moses Sumney’s two-hour ‘Blackalachia in Brooklyn’ performance on March 30, which saw him playing music amid projections of his live concert film, the audience was “sitting in awe and in reverence of what was happening.” Moses Sumney performs at BAM CREDIT: Ellen Maurer On April 4, Devonté Hynes [AKA Blood Orange] did something he’d “never done before”, according to Abdurraqib. Through a night of solo and collaborative performances from Third Coast Percussion, pianist Adam Tendler, and the String Orchestra of Brooklyn, Hynes relied completely on instrumentals, without adding any lyrics or even spoken words to his songs. Between each selection, the audience would erupt into clapping. Hynes would clap towards the attendees thanking them as well. “These audience reactions have been a real delight for me to be a witness to,” Abdurraqib told us. “My hope was always that these shows would act as an exchange between artists and audience.” Devonté Hynes aka Blood Orange performs at BAM CREDIT: Edwina Hay He continued: “I believe live music, or any kind of live performance to be an active exchange. Not just a place where people take from the performer or the performer takes from the audience. We all have a duty within that exchange, even if the exchange is being transported and being in awe of that transportation.” For singer-songwriter, L’Rain, who took the stage before Sumney’s performance, playing at BAM with artists she admires was “something so incredible I never even thought to include a show like this on my dream list.” She added: “It would have seemed too out of reach.” L’Rain CREDIT: Ellen Maurer Last year, the Brooklyn-raised artist (born Tara Cheek) released her second album ‘Fatigue’ where she experimented with ambient noise and leaned into lush orchestration among her hushed vocals. “I never would have thought that this strange music, some of which I made in my literal bed, could make sense on a stage this epic and historied,” the songwriter and multi-instrumentalist told NME. For Cheeks, the “show, in particular, felt like such a beautiful full-circle moment,” for her music and a city coming back to life. “In general, the L’Rain live show is intense,” Cheek told us. “Sometimes it feels like I’ve absorbed the energy of the city over the past few years and poured it back out all at once. It’s like my music is a vessel for all of the anxiety, the frustration, and the fear, but also the hope and sense of togetherness, all at once.” L’Rain CREDIT: Ellen Maurer When asked about working with Abdurraqib, L’Rain said she admired him because, “Sometimes it feels like there are a lot of people in the music industry who don’t actually like music” but that “talking to Hanif it becomes extremely clear that he comes to music, first and foremost, from a place of love and deep study.” According to Abdurraqib, that deep love and study, is what led him to curate a show that answered the question, “What can I be a witness to that will surprise me?” “I’ve been to so many shows in my life,” the music critic said. “Honestly, even before the pandemic, my enthusiasm about going to shows dwindled. Not because people aren’t putting on incredible live shows, but, there was a point in my late teens and early 20s where I was going to six shows a week.” Hanif Abdurraqib introduces performance at BAM CREDIT: Edwina Hay He added: “I’m at a point now where I would like to see someone willing to take a risk. How can someone do something that pushes them beyond a place of comfort? Not in a way that’s unsettling, but in a way that breaks through to the other side. I believe live performance is an exchange, so we all breakthrough that side together.” The series of curated concerts continue from May 19 – June 11 with Omar Offendum’s musical Little Syria, followed by a performance from Mavis Staples joined by Amy Helm on May 20, and a performance by Nikki Giovanni on June 11. You can view ticket more details and ticket information here. "
        },
        "https://www.nme.com/news/music/watch-fka-twigs-catch-a-night-bus-in-intimate-thank-you-song-video-3218429": {
            "title": "Watch FKA Twigs catch a night bus in intimate ‘Thank You Song’ video",
            "content": "FKA Twigs has shared the intimate new music video for her track ‘Thank You Song’ – you can watch the clip below. The video is the final part of the artist’s ‘CAPRIVIDS’ series, a collection of “short and punchy” visuals to accompany the tracks on her January mixtape ‘CAPRISONGS’. Directed by Aidan Zamiri, the London night bus-set video for ‘Thank You Song’ has been released this afternoon (May 4) to round off the ‘CAPRIVIDS’ series. “The ‘CAPRIVID’ for ‘Thank You Song’ is incredibly intimate,” Twigs explained in a statement about the clip, which you can watch below. “To me, it’s about embracing ones demons and finding things that are individual about one’s self, to make your life better.  “The song to me is very personal – it’s really about thanking the person or even the aspect of yourself that’s got all of us through a really challenging couple of years… socially, financially, culturally.” Twigs added: “I guess in a nutshell, ‘Thank You Song’ is about riding with one’s inner demons and embracing them. Those demons can become your angel if you let it.”  The video for ‘Thank You Song’ follows on from recent Twigs clips for the songs ‘Which Way’, ‘Honda’ and ‘Oh My Love’. Twigs, who was presented with the award for Godlike Genius at this year’s BandLab NME Awards, has been nominated for Best Contemporary Song at The Ivors, which will take place on May 19 in London. "
        },
        "https://www.nme.com/news/music/michael-eavis-has-been-honoured-with-the-freedom-of-glastonbury-3218300": {
            "title": "Michael Eavis has been honoured with the Freedom of Glastonbury",
            "content": "Glastonbury Festival founder and co-organiser Michael Eavis has been honoured with the Freedom of Glastonbury. Glastonbury Town Council voted unanimously back in March to make Eavis a Freeman of Glastonbury after he was nominated by the town’s mayor, Councillor Jon Cousins, and deputy mayor, Councillor Serena Roney-Dougal, “in appreciation of his services to the town and the local economy”. Eavis was formally made a Freeman of Glastonbury during a ceremony last night (May 3) at Glastonbury Town Hall. As the festival site notes, “in the past, a Freeman held various privileges, but these days the award is mostly symbolic”.  A post shared by Glastonbury Festival (@glastofest)  “However, according to tradition, as a Freeman of Glastonbury Michael has now been conferred the right to run his sheep through the centre of the town,” they added. In a statement issued back in March, Cllr. Cousins said: “I can think of no one more fitting of receiving this honour. This is an opportunity to acknowledge that, as founder of the Glastonbury Festival, Michael has helped to promote Glastonbury for over 50 years – both nationally and internationally – a true life-time’s work.” Speaking back in February, Eavis said that this year’s event, which will take place next month, will “be the best show ever”.  Earlier today (May 4), the festival’s Shangri-La area announced its line-up for 2022. Last weekend Lewis McLaughlin won Glastonbury’s Emerging Talent Competition 2022, with Crae Wolf and English Teacher finishing as runners-up. All seven of the finalists at this year’s competition will perform at the 2022 festival. "
        },
        "https://www.nme.com/news/music/harry-styles-announces-one-night-only-in-new-york-album-release-gig-3216965": {
            "title": "Harry Styles announces ‘One Night Only In New York’ album release gig",
            "content": "Harry Styles has announced a special ‘One Night Only In New York’ gig to celebrate the release of his new album, ‘Harry’s House’. The pop star will release his third album, featuring the recent single ‘As It Was’, on May 20, via Erskine Records. The special concert will take place at the UBS Arena at Belmont Park, in Long Island’s Elmont, on May 20. According to a press release, the show will see Styles perform tracks from ‘Harry’s House’ for the first time ever. Tickets for the gig will cost $25 all-in (£20), including taxes and fees. A Verified Fan pre-sale will open on Ticketmaster between 9am and 11am ET on Thursday (May 5) – fans can register for access here until 7pm ET tomorrow (May 3).  A post shared by @harrystyles  Due to the limited number of tickets available, Ticketmaster has confirmed there will not be a general sale for tickets. “We expect the demand for tickets to see Harry Styles – One Night Only In New York to be overwhelming,” a message on Styles’ Ticketmaster landing page reads. Styles recently debuted two tracks from ‘Harry’s House’ during his Coachella 2022 headline set. His performance at the first weekend of the festival saw him premiere ‘Boyfriends’ and ‘Late Night Talking’, while also giving his chart-topping single ‘As It Was’ its first live airing.  “First, is the folky ‘Boyfriends’, which Styles introduces by declaring: ‘This is for boyfriends everywhere – fuck you,’” NME wrote in a four-star review of his Coachella set. “It’s a rare moment of stillness from the star during the set, as he gently delivers a song about a troubled relationship where “it gets hard to know what he’s thinking”. Later, he debuts ‘Late Night Talking’, a funk-tinged ‘70s groove longing to make a partner “happy again” that confirms his third album ‘Harry’s House’ will have at least two solid gold bops on it.” Meanwhile, earlier today (May 2), the first trailer for Don’t Worry Darling, which features Styles in his first lead movie role, was released. The musician will play Jack in the film, husband of Florence Pugh’s housewife Alice, who begins to question the experimental utopian community the couple live in. "
        },
        "https://www.nme.com/news/music/watch-red-hot-chili-peppers-pay-tribute-to-taylor-hawkins-at-new-orleans-jazz-festival-3216635": {
            "title": "Watch Red Hot Chili Peppers pay tribute to Taylor Hawkins at New Orleans Jazz Festival",
            "content": "Red Hot Chili Peppers have paid tribute to Foo Fighters’ Taylor Hawkins during their headline set at New Orleans Jazz & Heritage Festival – watch footage below. The ‘Unlimited Love’ group stepped in to replace Foo Fighters at the event following the tragic death of their drummer Hawkins on March 25. Dave Grohl and co. subsequently cancelled all of their scheduled dates for 2022. During their Sunday night headline set at New Orleans Jazz & Heritage Festival, Red Hot Chili Peppers used a drum kit with “Taylor” written on it and at the end of their 17-song set, drummer Chad Smith made a speech dedicating their performance to Hawkins. The ‘Taylor’ on @ChiliPeppers drummer Chad Smith’s bass drum @jazzfest salutes @foofighters drummer Taylor Hawkins pic.twitter.com/p5rceRsJsm — Keith Spera (@KeithSpera) May 1, 2022  “We just found out about this two weeks ago, because Foo Fighters were supposed to play here tonight,” Smith said. “We love Foo Fighters, and we love our brother Taylor Hawkins. This means a lot to us to be able to play for them.” “The guys in the band are here, they’re supporting. Taylor’s wife Alison and his whole family are here, we love them, we love Taylor,” continued Smith before getting the crowd to chant “we love Taylor.”  A post shared by Foo Fighters Live (@foofighterslive)  Talking about the show beforehand, Smith said the band were had spoken to Hawkins’ wife Alison and that “it’s going to be a celebration.” “That’s what she wants. She doesn’t want it to be anything other than, ‘Let’s celebrate music, let’s celebrate our friends, let’s celebrate Taylor. This is what he would want and he would be very happy that you guys are playing and he would want it [to] be nothing but a positive experience’.” Smith continued: “So we’re going to do all that and she’s going to be part of that and I’m very honoured that we can do that with her. We’re going to play our hearts out.”  Foo Fighters supported the Chilis on the latter’s ‘Californication’ tour in 1999, and the two bands have remained friends since. While receiving RHCP’s star on the Hollywood Walk Of Fame recently, Smith said: “I have to give a shout out to my brother Taylor Hawkins, who I love and we’ll all miss so much.” Earlier this month, Chad Smith shared a tribute video in which he described Hawkins as “my good buddy, who I’ve known forever”. "
        },
        "https://www.nme.com/news/music/eminem-duran-duran-dolly-parton-and-lionel-richie-to-be-inducted-into-rock-roll-hall-of-fame-3218338": {
            "title": "Eminem, Duran Duran, Dolly Parton and Lionel Richie to be inducted into Rock & Roll Hall Of Fame",
            "content": "Eminem, Duran Duran, Dolly Parton and Lionel Richie are all set to be inducted into the Rock & Roll Hall Of Fame in 2022. Eurythmics, Carly Simon, Judas Priest and Pat Benatar will also be inducted into the Hall Of Fame this year. Kate Bush, Beck, DEVO, Fela Kuti, MC5, New York Dolls, Rage Against The Machine and Dionne Warwick made the initial shortlist for 2022, but didn’t make the final cut. The honourees — voted on by more than 1000 artists, historians and music industry professionals — each “had a profound impact on the sound of youth culture and helped change the course of rock ’n’ roll,” said John Sykes, the chairman of the Rock Hall, in a statement. The 2022 event, which will be the Hall’s 37th annual induction ceremony, will be held on November 5 at the Microsoft Theater in Los Angeles. Dolly Parton (Picture: Stacey Huckeba / Butterfly Records) The announcement comes after Parton initially refused the honour on the grounds that she didn’t feel that she had “earned the right”. But she reversed her stance last month to confirm she will accept the honour should she be voted in. Parton continued to explain that, at the time she made her statement bowing out, she hadn’t realised that the institution already included numerous artists from other genres outside the world of rock. “When I said that, it was always my belief that the Rock & Roll Hall Of Fame was for the people in rock music,” she said. “And I have found out lately it’s not necessarily that. But if they can’t go there to be recognised, where do they go? And so I felt like I would be taking away from someone that maybe deserved it, certainly more than me since I never considered myself a rock artist. But obviously, there’s more to it than that.”  Eminem, Duran Duran and Pat Benatar were among the artists to recently top this year’s Rock & Roll Hall Of Fame fan ballot. Last year’s inductees included Tina Turner, Carole King, The Go-Go’s, JAY-Z, Foo Fighters and Todd Rundgren in the Performers category; Kraftwerk, Charley Patton, Gil Scott-Heron, in the Early Influence category; LL Cool J, Billy Preston, Randy Rhoads, in the Musical Excellence category; and Clarence Avant received the Ahmet Ertegun Award. "
        },
        "https://www.nme.com/news/music/abba-share-new-images-of-their-voyage-digital-avatars-3218453": {
            "title": "ABBA share new images of their ‘Voyage’ digital avatars",
            "content": "Cyndi Lauper is set to be the subject of an upcoming documentary called Let The Canary Sing. According to a press release, the film will cover the singer’s rise from her childhood in Queens, New York to the top of the pop charts in the 1980s and beyond. It’s directed by Alison Ellwood, who helmed 2020’s The Go-Go’s. A release date is not yet confirmed, but the documentary is said to be currently in production via Sony Music Entertainment’s Premium Content Division. “Like many people, I assumed when Cyndi Lauper burst onto the music scene in the early ’80s, that she was another young star experiencing a meteoric rise to fame and success thanks to MTV,” Ellwood said in a statement. “Her music videos were wild and colourful, her songs like ‘Girls Just Want to Have Fun’ [1983] were infectious. But as it turns out, her story is one of hard knocks, hard work and dogged determination.” Cyndi Lauper performing live from Times Square during New Year’s Eve celebrations on December 31, 2020 in New York City. CREDIT: Gary Hershorn-Pool/Getty Image She continued: “Cyndi wanted her voice not just to be listened to, but a voice to be heard. The documentary will be a full portrait of Cyndi Lauper – her ‘True Colors’ shining through.” In 2014, Lauper’s party classic ‘Girls…’ featured in NME‘s list of ’35 amazing Number Two singles that were scandalously beaten to the top spot’. Her signature hit reached Number Two in both the US, where it was beaten to the top spot by Van Halen’s ‘Jump’, and in the UK, where it lost out to UB40’s ‘Red Red Wine’. Additionally, Lauper bagged a top 10 single in the UK with ‘Time After Time’ (Number Three) and ‘I Drove All Night’ (Number Seven). She’s also had two UK top 10 albums: ‘A Night To Remember’ and ‘Twelve Deadly Cyns…And Then Some’ (via the Official Chart Company). Cyndi Lauper is an active advocate for LGBTQIA+ causes, having founded the True Colors United non-profit organisation in 2008. Back in 2019, she received a UN award in recognition of her longstanding fight for human rights. EXIT Festival organisers have announced a new NFT collection ahead of this year’s main event. The collection, which will start minting at this year’s Tomorrow conference on May 14, will include headphones featuring EXIT’s first logo from 2001 in 3D as well as the Tribe gift collection, intended for the earliest members of the the festival’s Discord community. Owners of EXIT’s NFT art will also have the opportunity to hang out with some of EXIT’s headliners this year, as well as being granted exclusive access to the Dance Arena stage and secret parties at hidden locations across the festival site. For more information on the NFT collection, as well as how to purchase and mint, head here. Nick Cave & The Bad Seeds will headline this year’s bash at the Petrovaradin Fortress in Serbia from July 7-10, alongside acts which include Calvin Harris, Napalm Death, Jax Jones, Honey Dijon, Maceo Plex, ZHU, James Arthur and Marky Ramone. You can view the full line-up so far below. Getting closer to #EXIT2k22 and our stellar acts! Let's welcome @Noisia_nl & other #XBass names joining @CalvinHarris, @nickcave, @IGGYAZALEA, @JamesArthur23, @maskedwolfmusic, @BB_BORISBREJCHA, @MaceoPlex, @sepulturacombr & more! On 7-10 July at https://t.co/sNb0VZlM8W! pic.twitter.com/CPH5HsY0C5 — EXIT Festival (@ExitFestival) April 22, 2022  Tickets are on sale now and can purchased here. For more information, head to EXIT’s official website here. Last year’s event was the first major festival to be held in Europe since the coronavirus pandemic began. The Health Centre Novi Sad and the association Project Lab, under the leadership of epidemiologist Marija Milić MD, conducted a COVID study at the festival, where they divided a total of 345 visitors into two groups: vaccinated and those who entered the festival with a negative test. They reportedly resulted in zero coronavirus infections.  Calvin Harris is also set to headline Creamfields South alongside David Guetta later this year, while he will perform alongside Carl Cox, Chase & Status, DJ EZ and Four Tet as part of the 2022 line-up for Glastonbury‘s Arcadia stage. ABBA have previewed their upcoming ‘Voyage’ shows by sharing a series of official images – check them out below. The Swedish pop icons returned with their first album in 40 years, ‘Voyage’, last November and are due to host a string of “revolutionary” concerts at London’s Queen Elizabeth Olympic Park from May 27. After sharing a dazzling first trailer for the production late last year, ABBA have now revealed four new photos – one for each “digital” member of the band: Agnetha Fältskog, Björn Ulvaeus, Benny Andersson and Anni-Frid Lyngstad. You can see the impressively lifelike avatars here:   Last September, the ‘Voyage’ show producers spoke to NME about what to expect from what they described as a “magical space circus”. “It’s a concert on steroids, basically,” explained Ludwig Andersson. “However technically advanced these avatars are, this can never only be about technology. Like all music, you need to keep that open highway into your soul. We need to work on that emotion. “It needs to always be about the audience feeling something. We’re just trying to enhance that feeling and crank it up to 11 with everything we have at our disposal.” The upcoming ‘Voyage’ gigs will see the so-called ‘ABBAtars’ performing alongside a 10-piece live band (put together with the help of Klaxons’ James Righton and featuring Little Boots) at a new purpose-built 3,000-capacity venue called ABBA Arena. Speaking to NME about her involvement in the ambitious project, Little Boots (aka Victoria Hesketh) said it had been “absolutely mind-blowing” to work with ABBA, describing herself as a “mega-fan” of the group. “I’m a big disco fan so I’m glad that’s gone full circle to be recognised for its songwriting,” she explained. “ABBA are a legendary part of the fabric of our artistic history now.” In a separate interview, Righton told NME: “It was a challenge, but a fun one. I care as a fan of their band. If I was going to be a part of it, I wanted to get it right. This band had to step up as being as good as the original line-up.” Björn Ulvaeus recently said that he thinks ABBA’s comeback is an “immense risk”, adding: “Sometimes I wake up at four in the morning and think, ‘What the hell have we done?'” Ulvaeus told The Sunday Times that he expected other musicians to be watching the ‘Voyage’ show closely. “Lots of artists are going to be studying us, definitely,” he said. “I won’t name names, but I can think of a few. “I wonder who’s going to be first. I couldn’t possibly comment.”  ‘ABBA Voyage’ kicks off on May 27 at the Queen Elizabeth Olympic Park in London – you can find tickets and further information here. "
        },
        "https://www.nme.com/news/music/exit-festival-announce-2022-nft-collection-3218372": {
            "title": "EXIT Festival announce 2022 NFT collection",
            "content": "Cyndi Lauper is set to be the subject of an upcoming documentary called Let The Canary Sing. According to a press release, the film will cover the singer’s rise from her childhood in Queens, New York to the top of the pop charts in the 1980s and beyond. It’s directed by Alison Ellwood, who helmed 2020’s The Go-Go’s. A release date is not yet confirmed, but the documentary is said to be currently in production via Sony Music Entertainment’s Premium Content Division. “Like many people, I assumed when Cyndi Lauper burst onto the music scene in the early ’80s, that she was another young star experiencing a meteoric rise to fame and success thanks to MTV,” Ellwood said in a statement. “Her music videos were wild and colourful, her songs like ‘Girls Just Want to Have Fun’ [1983] were infectious. But as it turns out, her story is one of hard knocks, hard work and dogged determination.” Cyndi Lauper performing live from Times Square during New Year’s Eve celebrations on December 31, 2020 in New York City. CREDIT: Gary Hershorn-Pool/Getty Image She continued: “Cyndi wanted her voice not just to be listened to, but a voice to be heard. The documentary will be a full portrait of Cyndi Lauper – her ‘True Colors’ shining through.” In 2014, Lauper’s party classic ‘Girls…’ featured in NME‘s list of ’35 amazing Number Two singles that were scandalously beaten to the top spot’. Her signature hit reached Number Two in both the US, where it was beaten to the top spot by Van Halen’s ‘Jump’, and in the UK, where it lost out to UB40’s ‘Red Red Wine’. Additionally, Lauper bagged a top 10 single in the UK with ‘Time After Time’ (Number Three) and ‘I Drove All Night’ (Number Seven). She’s also had two UK top 10 albums: ‘A Night To Remember’ and ‘Twelve Deadly Cyns…And Then Some’ (via the Official Chart Company). Cyndi Lauper is an active advocate for LGBTQIA+ causes, having founded the True Colors United non-profit organisation in 2008. Back in 2019, she received a UN award in recognition of her longstanding fight for human rights. EXIT Festival organisers have announced a new NFT collection ahead of this year’s main event. The collection, which will start minting at this year’s Tomorrow conference on May 14, will include headphones featuring EXIT’s first logo from 2001 in 3D as well as the Tribe gift collection, intended for the earliest members of the the festival’s Discord community. Owners of EXIT’s NFT art will also have the opportunity to hang out with some of EXIT’s headliners this year, as well as being granted exclusive access to the Dance Arena stage and secret parties at hidden locations across the festival site. For more information on the NFT collection, as well as how to purchase and mint, head here. Nick Cave & The Bad Seeds will headline this year’s bash at the Petrovaradin Fortress in Serbia from July 7-10, alongside acts which include Calvin Harris, Napalm Death, Jax Jones, Honey Dijon, Maceo Plex, ZHU, James Arthur and Marky Ramone. You can view the full line-up so far below. Getting closer to #EXIT2k22 and our stellar acts! Let's welcome @Noisia_nl & other #XBass names joining @CalvinHarris, @nickcave, @IGGYAZALEA, @JamesArthur23, @maskedwolfmusic, @BB_BORISBREJCHA, @MaceoPlex, @sepulturacombr & more! On 7-10 July at https://t.co/sNb0VZlM8W! pic.twitter.com/CPH5HsY0C5 — EXIT Festival (@ExitFestival) April 22, 2022  Tickets are on sale now and can purchased here. For more information, head to EXIT’s official website here. Last year’s event was the first major festival to be held in Europe since the coronavirus pandemic began. The Health Centre Novi Sad and the association Project Lab, under the leadership of epidemiologist Marija Milić MD, conducted a COVID study at the festival, where they divided a total of 345 visitors into two groups: vaccinated and those who entered the festival with a negative test. They reportedly resulted in zero coronavirus infections.  Calvin Harris is also set to headline Creamfields South alongside David Guetta later this year, while he will perform alongside Carl Cox, Chase & Status, DJ EZ and Four Tet as part of the 2022 line-up for Glastonbury‘s Arcadia stage. "
        },
        "https://www.nme.com/news/music/hear-lady-gagas-emotive-new-single-hold-my-hand-in-full-3217176": {
            "title": "Listen to Lady Gaga’s emotive new single ‘Hold My Hand’ in full",
            "content": "Lady Gaga has shared the full version of her new single ‘Hold My Hand’, which was recorded as part of the soundtrack for Top Gun: Maverick. You can stream the emotive power ballad below, which Gaga said she has been working on “for years” when she announced it last week.  A ten-second preview followed yesterday, along with black-and-white visuals that see Gaga sitting beneath the wing of a plane in an aircraft hanger. She shared further Top Gun themed imagery today (May 3), along with the full single, which was produced by Gaga along with BloodPop and Benjamin Rice. It also features production and score music by Harold Faltermeyer and Hans Zimmer. #HOLDMYHAND ✈️🖤 OUT NOW, from the film #TopGun: Maverick.  Written by me and BloodPop, produced by me and BloodPop, with additional production from Benjamin Rice. https://t.co/6W12QOJ1ax pic.twitter.com/g9DLZy4Hzb — Lady Gaga (@ladygaga) May 3, 2022  In a subsequent social media post, Gaga added of the track: “I wanted to say that I wrote the song for the INCREDIBLE movie […] but also for people who feel like they’re not gonna be ok or WE ARE never gonna be ok and that life taught me through hard ties to have faith in humanity when it’s hard to have faith in yourself  A post shared by Lady Gaga (@ladygaga)  “When you feel lonely, sad, removed from the world, far away from yourself and others #holdmyhand One day you may even be strong enough to hold your own.”  Speaking previously about her contribution to the soundtrack, Gaga explained: “When I wrote this song for Top Gun: Maverick, I didn’t even realise the multiple layers it spanned across the film’s heart, my own psyche, and the nature of the world we’ve been living in.” Top Gun: Maverick hits cinemas on May 27 after the project faced numerous delays, including some due to COVID restrictions. The film was initially scheduled for release on July 12, 2019. "
        },
        "https://www.nme.com/news/music/cyndi-lauper-documentary-let-the-canary-sing-is-in-the-works-3218568": {
            "title": "Cyndi Lauper documentary ‘Let The Canary Sing’ is in the works",
            "content": "Cyndi Lauper is set to be the subject of an upcoming documentary called Let The Canary Sing. According to a press release, the film will cover the singer’s rise from her childhood in Queens, New York to the top of the pop charts in the 1980s and beyond. It’s directed by Alison Ellwood, who helmed 2020’s The Go-Go’s. A release date is not yet confirmed, but the documentary is said to be currently in production via Sony Music Entertainment’s Premium Content Division. “Like many people, I assumed when Cyndi Lauper burst onto the music scene in the early ’80s, that she was another young star experiencing a meteoric rise to fame and success thanks to MTV,” Ellwood said in a statement. “Her music videos were wild and colourful, her songs like ‘Girls Just Want to Have Fun’ [1983] were infectious. But as it turns out, her story is one of hard knocks, hard work and dogged determination.” Cyndi Lauper performing live from Times Square during New Year’s Eve celebrations on December 31, 2020 in New York City. CREDIT: Gary Hershorn-Pool/Getty Image She continued: “Cyndi wanted her voice not just to be listened to, but a voice to be heard. The documentary will be a full portrait of Cyndi Lauper – her ‘True Colors’ shining through.” In 2014, Lauper’s party classic ‘Girls…’ featured in NME‘s list of ’35 amazing Number Two singles that were scandalously beaten to the top spot’. Her signature hit reached Number Two in both the US, where it was beaten to the top spot by Van Halen’s ‘Jump’, and in the UK, where it lost out to UB40’s ‘Red Red Wine’. Additionally, Lauper bagged a top 10 single in the UK with ‘Time After Time’ (Number Three) and ‘I Drove All Night’ (Number Seven). She’s also had two UK top 10 albums: ‘A Night To Remember’ and ‘Twelve Deadly Cyns…And Then Some’ (via the Official Chart Company). Cyndi Lauper is an active advocate for LGBTQIA+ causes, having founded the True Colors United non-profit organisation in 2008. Back in 2019, she received a UN award in recognition of her longstanding fight for human rights. "
        },
        "https://www.nme.com/news/music/new-brian-eno-documentary-in-works-3216959": {
            "title": "A new Brian Eno documentary is in the works",
            "content": "Judy Henske, an influential and charismatic figure in the American folk scene of the 1960s, has died at the age of 85. Her husband and collaborator, the keyboardist Craig Doerge, said that Henske passed away on April 27 in a Los Angeles hospice after a long illness (per Variety). She is survived by Doerge, her daughter and granddaughter. Plans for a memorial are set to be announced soon. Dubbed ‘The Queen Of The Beatniks’, a nickname given to her by the producer Jack Nitzsche, Henske’s live sets combined traditional and original material that spanned folk, blues, show tunes and jazz. She was also known for her sarcastic and comedic stage presence. Henske was reportedly the inspiration for the title character in Annie Hall, whose director Woody Allen shared a stage with her in the 1960s. Judy Henske circa 1970 (Picture: Michael Ochs Archives/Getty Images) One of her best known songs, 1963’s ‘High Flying Bird’, was particularly influential in folk-rock, and was notably covered by Jefferson Airplane. It was also the inspiration behind the name of Noel Gallagher‘s post-Oasis project. After finding early success with a slot on the early 1960s variety show Hootenanny, Henske joined The Whiskeyhill Singers with whom she recorded her first album. Among her most acclaimed releases was 1969’s psychedelic ‘Farewell Aldebaran’, recorded with her then-husband Jerry Yester and released via Frank Zappa‘s Straight Records. They went on to form a short-lived band Rosebud, and released an eponymous follow-up in 1971. Henske then largely retired from public life, focussing on songwriting and raising her daughter. In the 1990s she returned to live performance, and released two final albums – 1999’s ‘Loose In The World’ and 2004’s ‘She Sang California’. She was reportedly working on her memoirs before her death. A new documentary about Brian Eno is in the works by director Gary Hustwit, it has been announced. Hustwit has previously worked on films about Mavis Staples (Mavis!) and Wilco (I Am Trying to Break Your Heart: A Film About Wilco). The filmmaker’s official website now features a page for a documentary called Eno, which is described as “the definitive career-spanning, multi-platform documentary about visionary musician and artist Brian Eno”. Hustwit was given access to hundreds of hours of previously unseen footage and unreleased music from Eno’s archive to make the doc, which will be released in multiple versions and “will employ groundbreaking generative technology in its creation and exhibition”. Brian Eno. CREDIT: Cecily Eno The director and his team have digitised and restored approximately 400 hours of material spanning 50 years, including interviews, early video art projects, lectures, performances, behind-the-scenes footage of recording sessions and more – most of which have not been released publicly before. Eno represents the latest collaboration in the legendary musician and filmmakers’ creative relationship. Eno previously created the score for the documentary Rams in 2017, which explored the life of the German designer Dieter Rams. The film will, according to Hustwit’s website, “offer a deep dive into subjects that Eno has been notably passionate about, such as sustainability, social equity, and the future of civilisation, while centring above all on the nature of creativity”. “Much of Brian’s career has been about enabling creativity in himself and others, through his role as a producer but also through his collaborations on projects like the Oblique Strategies cards or the music app Bloom,” Hustwit said. “I think of Eno as an art film about creativity, with the output of Brian’s 50-year career as its raw material. “You can’t make a conventional, by-the-numbers bio-doc about Brian Eno. That would be antithetical and a missed opportunity. What I’m trying to do is to create a cinematic experience that’s as innovative as Brian’s approach to music and art.”  Last year, Eno spoke out about his feelings on the current NFT craze, saying it allows artists to be “little capitalist assholes”. “I’ve been approached several times to ‘make an NFT,’” he said in an interview. “So far nothing has convinced me that there is anything worth making in that arena. ‘Worth making’ for me implies bringing something into existence that adds value to the world, not just to a bank account.” "
        },
        "https://www.nme.com/news/film/atticus-ross-says-score-for-new-luca-guadagnino-film-is-finished-3218589": {
            "title": "Atticus Ross says score for new Luca Guadagnino film is “finished”",
            "content": "Nine Inch Nails‘ Atticus Ross and Trent Reznor have wrapped up their recording of the forthcoming Luca Guadagnino film Bones & All. It had been reported that the pair would score the new project late last year. Now, writing on the official Nine Inch Nails Discord chat, Ross has confirmed that the soundtrack is done. “How about this for ‘soon’,” the musician wrote in response to a fan. “we have finished the score to Luca Guadagnino’s ‘Bones & All’ starring Timothée Chalamet and Taylor Russel.” “We had a great experience. Luca is a true artist,” he added. Just announced by Atticus on the official NIN discord, new soundtrack coming for the upcoming Luca Guadagnino movie pic.twitter.com/YmO7As8fvI — F Yeah Atticus Ross (@fyeahatticus) May 3, 2022  The award-winning duo have a number of hit movie scores under their belts, with previous projects including The Social Network, Bird Box, Gone Girl and Pixar’s Soul. Bones & All is based on the book of the same name by Camille DeAngelis, with the plot reportedly based around a young woman’s cannibalistic desires. Last week (April 28), Nine Inch Nails covered two David Bowie songs as they kicked off their 2022 tour in the US. The performance at Red Hat Amphitheatre in Raleigh, North Carolina, marked the first time the band has taken the stage since 2018.  The band have released both ‘Ghosts V: Together’ and ‘Ghosts VI: Locusts’ since their last run of live shows. Reviewing the albums, NME‘s James McMahon wrote: “Much like Trent Reznor and Atticus Ross said last time Ghosts swung round, ‘Ghosts: V-VI’ is music for daydreams. But it’s only fair and decent for us to let you know that it’s also music for nightmares too.” "
        },
        "https://www.nme.com/news/music/influential-folk-singer-songwriter-judy-henske-dies-aged-85-3217201": {
            "title": "Influential folk singer-songwriter Judy Henske dies, aged 85",
            "content": "Judy Henske, an influential and charismatic figure in the American folk scene of the 1960s, has died at the age of 85. Her husband and collaborator, the keyboardist Craig Doerge, said that Henske passed away on April 27 in a Los Angeles hospice after a long illness (per Variety). She is survived by Doerge, her daughter and granddaughter. Plans for a memorial are set to be announced soon. Dubbed ‘The Queen Of The Beatniks’, a nickname given to her by the producer Jack Nitzsche, Henske’s live sets combined traditional and original material that spanned folk, blues, show tunes and jazz. She was also known for her sarcastic and comedic stage presence. Henske was reportedly the inspiration for the title character in Annie Hall, whose director Woody Allen shared a stage with her in the 1960s. Judy Henske circa 1970 (Picture: Michael Ochs Archives/Getty Images) One of her best known songs, 1963’s ‘High Flying Bird’, was particularly influential in folk-rock, and was notably covered by Jefferson Airplane. It was also the inspiration behind the name of Noel Gallagher‘s post-Oasis project. After finding early success with a slot on the early 1960s variety show Hootenanny, Henske joined The Whiskeyhill Singers with whom she recorded her first album. Among her most acclaimed releases was 1969’s psychedelic ‘Farewell Aldebaran’, recorded with her then-husband Jerry Yester and released via Frank Zappa‘s Straight Records. They went on to form a short-lived band Rosebud, and released an eponymous follow-up in 1971. Henske then largely retired from public life, focussing on songwriting and raising her daughter. In the 1990s she returned to live performance, and released two final albums – 1999’s ‘Loose In The World’ and 2004’s ‘She Sang California’. She was reportedly working on her memoirs before her death. "
        },
        "https://www.nme.com/news/music/ed-sheeran-noel-gallagher-the-who-acdc-depeche-mode-donate-teenage-cancer-trust-auction-3216941": {
            "title": "Ed Sheeran, Noel Gallagher, The Who, AC/DC, Depeche Mode donate to Teenage Cancer Trust auction",
            "content": "Ed Sheeran, Noel Gallagher, The Who, AC/DC, and Depeche Mode are among the more than 35 musicians supporting the Teenage Cancer Trust auction. The artists have donated items for the charity’s Star Boot Sale fundraiser, which started on April 29 and will continue for two weeks before ending on May 12. View more details and items for auction here. Some of the goods up for grabs include flights to New York and a VIP experience at The Who’s Madison Square Garden gig, a Jake Bugg-signed Ibiza Rocks drumhead, a signed Depeche Mode Guitar, Noel Gallagher’s signed trainers, Stereophonics‘ signed drumsticks, an AC/DC-signed poster and rare guitar plectrums donated by Ed Sheeran. Star Boot Sale is back ⭐ Don’t miss your chance to get your hands on some star-studded items from our amazing supporters!This year we’ve got items from @edsheeran @TheWho @Vicky_McClure @paulwellerHQ and many more!Take a look 👇https://t.co/UhH0ee5l3v pic.twitter.com/q5Vtc3AALG — Teenage Cancer Trust (@TeenageCancer) April 29, 2022  Take That, Paul Weller, Jools Holland, and The Vaccines are also contributing to the auction. “The last two years have been really tough for Teenage Cancer Trust and the young people we support,” Roger Daltrey, Teenage Cancer Trust Honorary Patron and Who frontman, said. “But the unconditional support myself and the charity have received from the music and entertainment industry throughout this time has been unwavering and I cannot thank them enough for that.” Daltrey continued: “It’s only because of this support that we were able to get back to the Royal Albert Hall for Teenage Cancer Gigs after a two-year hiatus last month. The Star Boot Sale is another brilliant way for people across music, film, television and sport to get behind the charity and make sure Teenage Cancer Trust can keep funding its specialist units and staff who offer world-class care and support. “Some of the amazing headliners from our shows this year and previously have donated items, so it is a great chance to own a piece of unique entertainment history.” Items are expected to sell from £10 to the thousands, though some select items will be in the £5-ticket raffle so everyone has a chance to bid on music memorabilia while supporting a good cause. This is the second year the sale has taken place, with its first year raising enough to fund a specialist cancer nurse for six months.  In March, The Cure, Johnny Marr, Blossoms and more contributed to a Teenage Cancer Trust co-produced book featuring 19 song lyrics performed on stage for the charity over the past 20 years. It included handwritten lyrics from Paul Weller, Noel Gallagher, Amy MacDonald, Suede and more. Yungblud, Liam Gallagher and Sheeren were among the acts that performed at the Teenage Cancer Trust’s annual gig series at London’s Royal Albert Hall earlier this year. "
        },
        "https://www.nme.com/news/music/fka-twigs-gets-trial-date-shia-labeouf-sexual-assault-case-3216942": {
            "title": "FKA Twigs gets trial date in Shia LaBeouf sexual assault case",
            "content": "Pete Davidson discussed his time living with Machine Gun Kelly in his mother’s basement during the Netflix Is A Joke: The Festival. Watch a clip of the moment below. Davidson shared the story during his first stand-up gig in three years, at Los Angeles live  Netflix comedy festival on Friday (April 29). The Saturday Night Live comedian was introducing the rapper to the stage, and first shared an antidote about the time they both lived at his “mom’s house”. “This next guy that’s coming to the stage, we celebrated Christmas together in 2018 and we both looked at each other from across the table,” Davidson said, adding: “We were at my mom’s house, we were living together at my mom’s house, in her basement.” He continued: “I remember we were looking at each other like, ‘It’s OK, our careers are fucking over it’s fine.’ We had fun it’s all good who would have thought we could do anything, right?'” Pete went on to say that “this guy now has two No. 1 albums in a row, he’s I think one of the biggest names you can get,” before welcoming Machine Gun Kelly to the stage.  At another point during his set, Davidson brought up claims that Kanye West tried to spread rumours about Davidson – who is currently dating West’s ex-wife, Kim Kardashian – having AIDS. “I had an AIDS scare this year,” he quipped (per Variety), telling his audience that he got himself tested for the condition since West is a “genius”. He assured fans that he does not, in fact, have AIDS – he just looks like he does. Davidson reportedly went on to talk about feeling stuck when it came to responding to West’s harassment, with none of the people in his inner circle able to give him advice on the situation.  Later this month, Davidson will star in MGK’s directorial debut, Good Mourning, as an aggressive valet driver. The film will be out on May 20 – see the first trailer here. Later in the year – on August 5, to be exact – Davidson will star alongside Amandla Stenberg and Maria Bakalova in the comedy-horror film Bodies Bodies Bodies. Meanwhile, Kelly recently hinted he could return to rap on his next album after a successful pivot to becoming a pop-punk star. 2020’s ‘Tickets To My Downfall’ gave him his first US Number One album and his first within the pop-punk genre after appearing to ditch his rap career. It was followed up by his album ‘Mainstream Sellout’, which was released in March. FKA Twigs’ lawsuit against Shia LaBeouf, alleging sexual battery, assault and infliction of emotional distress, has been given a date to go to trial. In December 2020, the musician – real name Tahliah Barnett – sued the actor, accusing him of “relentless abuse” during their relationship. Now, the case will be heard before a jury in a Los Angeles court next year, with the trial currently set to start on April 17, 2023, Rolling Stone reports. A remote hearing in the case was heard in June 2021. At that time, Barnett’s lawyer told a Los Angeles County Superior Court judge that “the parties have been engaged in productive settlement negotiations and are in the process of arranging for an early mediation”. The judge then allowed time for the musician and the actor to work out a settlement out of court, setting a follow-up court date for December 2021. FKA Twigs on the BandLab NME Awards 2022 red carpet. Credit: Eva Pentel “The gaslighting has gone on long enough here and it’s time to hold Shia LaBeouf accountable,” Barnett’s lawyer Bryan Freedman told Rolling Stone today (May 2). “My client wants a trial date.” Neither Barnett nor LaBeouf have commented publicly on the trial date being set at the time of writing. Barnett has claimed that, during a relationship lasting just over a year, LaBeouf abused her physically, emotionally and mentally multiple times. “I’d like to be able to raise awareness on the tactics that abusers use to control you and take away your agency,” she told the New York Times when her allegations were first made public. LaBeouf initially responded to claims from Barnett and another former partner, Karolyn Pho, in an email to the New York Times. “I’m not in any position to tell anyone how my behaviour made them feel,” he wrote. “I have no excuses for my alcoholism or aggression, only rationalisations. I have been abusive to myself and everyone around me for years. I have a history of hurting the people closest to me. I’m ashamed of that history and am sorry to those I hurt. There is nothing else I can say.” Shia LaBeouf CREDIT: Emma McIntyre/Getty Images for HFA He added that “many of these allegations are not true” but said that he owed the women “the opportunity to air their statements publicly and accept accountability for those things I have done”. In February 2021, he denied Barnett’s allegations, stating through his lawyers that he denied “each and every” claim from the musician, including causing her “any injury or loss”. He added that she is not “entitled to any relief or damages whatsoever”. "
        },
        "https://www.nme.com/news/music/rod-stewart-surprises-pub-goers-by-pulling-pints-behind-the-bar-3217395": {
            "title": "Rod Stewart surprises pub-goers by pulling pints behind the bar",
            "content": "Death Cab For Cutie have revealed that they’ve finished their 10th album, confirming that new music will arrive next week. The Washington band released their latest studio record, ‘Thank You For Today’, back in 2018. A five-track collection of covers titled ‘The Georgia EP’ came out in 2020 via Bampcamp and was later made available on streaming platforms. Tonight (May 4) Death Cab took to social media to post a photograph of themselves in a large recording studio. “New album done,” the group wrote as the caption, telling fans that the first slice of new music from the full-length project will arrive next Wednesday (May 11). They also added a link to pre-save the as-yet-untitled track. Check out the post below.  A post shared by Death Cab for Cutie (@deathcabforcutie)  Speaking to NME in March 2021, frontman Ben Gibbard explained that his then-new signature Fender Mustang guitar had been inspiring Death Cab’s next LP. “We’ve got a lot of songs and I’m really happy with the material,” he said. “I’m sure a lot of musicians say that their new material is the best thing they’ve ever done and try to hype it up. I don’t want to give it that weight, but I can say that I’m really excited about it. I think it’s going to be a really good record.” The musician went on to say that the music that the band were working on at that time saw him reflect on his own life and mortality amid the COVID-19 pandemic. “There is a theme of the loss of time and the finite amount of it that we all have,” Gibbard told NME. “This last year of our lives has put a fine point on the fact that we are all mortal and only here for a brief period of time. It goes by quicker than you think.” He added: “Love and death are always big things for me, but there’s a new component about how quickly time moves and how impermanent our existence here truly is.”  Death Cab For Cutie are due to play a run of US headline shows this summer, with an additional date scheduled for New York’s Forest Hills Stadium on September 30. You can purchase any remaining tickets here. Gibbard and co. recently performed at the New Orleans Jazz & Heritage Festival and Shaky Knees 2022. Upcoming festival appearances include Corona Capital in Mexico and Summerfest in Milwaukee, Wisconsin. Rod Stewart surprised drinkers at a pub in Glasgow on Sunday, by stepping behind the bar to serve pints to locals. “Great to have spare bartender Rod ‘the mod’ Stewart tonight!” said a post on the pub’s social media channels, along with a photo of the veteran musician speaking to locals. Stewart, a superfan of Glasgow football team Celtic, had been to see his team’s draw with Rangers in the Old Firm Derby hours earlier along with Scottish singer-songwriter John McLaughlin.  A post shared by The Dirty Duchess (@thedirtyduchessglasgow)      Stewart had also been joined by two of his sons, Alastair and Aiden, but not his son Sean, with whom he recently pleaded guilty to battery over an altercation with a security guard at a Florida hotel in 2019. The musician and his son, Sean, entered guilty pleas to a misdemeanour count of “simple battery” but will not face jail, pay a fine nor go on probation. The judge withheld adjudication, which means the pair have not been formally convicted. Rod and Sean were accused of assault on New Year’s Eve 2019 when they were refused access to a private event at Breakers Palm Beach Hotel, according to a police report. Sean, 41, allegedly shoved the security guard and Rod, 76, struck his chest “with a closed fist”.  Elsewhere, Stewart recently revealed why he was absent from the Live Aid line-up in 1985, stating that he had “only just found out” the real reason. “We actually were supposed to do it,” he told the BBC, “but a few guys in the band told me that our ex-manager turned it down because I wasn’t getting the right news coverage. "
        },
        "https://www.nme.com/news/music/death-cab-for-cutie-reveal-their-new-album-is-finished-new-single-3218621": {
            "title": "Death Cab For Cutie reveal they’ve finished their new album",
            "content": "Death Cab For Cutie have revealed that they’ve finished their 10th album, confirming that new music will arrive next week. The Washington band released their latest studio record, ‘Thank You For Today’, back in 2018. A five-track collection of covers titled ‘The Georgia EP’ came out in 2020 via Bampcamp and was later made available on streaming platforms. Tonight (May 4) Death Cab took to social media to post a photograph of themselves in a large recording studio. “New album done,” the group wrote as the caption, telling fans that the first slice of new music from the full-length project will arrive next Wednesday (May 11). They also added a link to pre-save the as-yet-untitled track. Check out the post below.  A post shared by Death Cab for Cutie (@deathcabforcutie)  Speaking to NME in March 2021, frontman Ben Gibbard explained that his then-new signature Fender Mustang guitar had been inspiring Death Cab’s next LP. “We’ve got a lot of songs and I’m really happy with the material,” he said. “I’m sure a lot of musicians say that their new material is the best thing they’ve ever done and try to hype it up. I don’t want to give it that weight, but I can say that I’m really excited about it. I think it’s going to be a really good record.” The musician went on to say that the music that the band were working on at that time saw him reflect on his own life and mortality amid the COVID-19 pandemic. “There is a theme of the loss of time and the finite amount of it that we all have,” Gibbard told NME. “This last year of our lives has put a fine point on the fact that we are all mortal and only here for a brief period of time. It goes by quicker than you think.” He added: “Love and death are always big things for me, but there’s a new component about how quickly time moves and how impermanent our existence here truly is.”  Death Cab For Cutie are due to play a run of US headline shows this summer, with an additional date scheduled for New York’s Forest Hills Stadium on September 30. You can purchase any remaining tickets here. Gibbard and co. recently performed at the New Orleans Jazz & Heritage Festival and Shaky Knees 2022. Upcoming festival appearances include Corona Capital in Mexico and Summerfest in Milwaukee, Wisconsin. "
        },
        "https://www.nme.com/news/music/pete-davidson-talks-living-with-machine-gun-kelly-in-his-mothers-basement-3218554": {
            "title": "Pete Davidson talks living with Machine Gun Kelly in his mother’s basement",
            "content": "Pete Davidson discussed his time living with Machine Gun Kelly in his mother’s basement during the Netflix Is A Joke: The Festival. Watch a clip of the moment below. Davidson shared the story during his first stand-up gig in three years, at Los Angeles live  Netflix comedy festival on Friday (April 29). The Saturday Night Live comedian was introducing the rapper to the stage, and first shared an antidote about the time they both lived at his “mom’s house”. “This next guy that’s coming to the stage, we celebrated Christmas together in 2018 and we both looked at each other from across the table,” Davidson said, adding: “We were at my mom’s house, we were living together at my mom’s house, in her basement.” He continued: “I remember we were looking at each other like, ‘It’s OK, our careers are fucking over it’s fine.’ We had fun it’s all good who would have thought we could do anything, right?'” Pete went on to say that “this guy now has two No. 1 albums in a row, he’s I think one of the biggest names you can get,” before welcoming Machine Gun Kelly to the stage.  At another point during his set, Davidson brought up claims that Kanye West tried to spread rumours about Davidson – who is currently dating West’s ex-wife, Kim Kardashian – having AIDS. “I had an AIDS scare this year,” he quipped (per Variety), telling his audience that he got himself tested for the condition since West is a “genius”. He assured fans that he does not, in fact, have AIDS – he just looks like he does. Davidson reportedly went on to talk about feeling stuck when it came to responding to West’s harassment, with none of the people in his inner circle able to give him advice on the situation.  Later this month, Davidson will star in MGK’s directorial debut, Good Mourning, as an aggressive valet driver. The film will be out on May 20 – see the first trailer here. Later in the year – on August 5, to be exact – Davidson will star alongside Amandla Stenberg and Maria Bakalova in the comedy-horror film Bodies Bodies Bodies. Meanwhile, Kelly recently hinted he could return to rap on his next album after a successful pivot to becoming a pop-punk star. 2020’s ‘Tickets To My Downfall’ gave him his first US Number One album and his first within the pop-punk genre after appearing to ditch his rap career. It was followed up by his album ‘Mainstream Sellout’, which was released in March. "
        },
        "https://www.nme.com/news/music/win-vip-tickets-to-wireless-festival-2022-3217351": {
            "title": "Win VIP tickets to Wireless Festival 2022",
            "content": "Wireless Festival is set to return bigger and better than ever this summer – and you could be in with a chance of winning VIP tickets. See details below. Europe’s biggest celebration of contemporary Black culture – delivered by GoPuff – will this year be offering fans seven headliners, across three locations over two weekends, with the party heading to London’s Crystal Palace Park as well as London Finsbury Park and Outdoor at the Birmingham NEC. With 2021’s acclaimed event headlined by Future, Skepta and Migos (along with a surprise appearance of Drake) the massive line-up this year includes A$AP Rocky, J. Cole, and Cardi B‘s only performances in the UK this year – while Tyler, The Creator will be playing his only London show and Nicki Minaj and SZA will be gracing Wireless with their only dates in Europe. Elsewhere across the three bills celebrating the best in hip-hop, rap, R&B, Afrobeats, trap and grime are the likes of Dave, Playboi Carti, Megan Thee Stallion, Summer Walker, Burna Boy, Roddy Ricch, Doja Cat, Little Simz, Polo G, Rico Nasty, H.E.R., Lil Baby, Mahalia, D-Block Europe and many more. Megan Thee Stallion. CREDIT: Kevin Winter/Getty Images The festival will be at London’s Crystal Palace Park from Friday 1 – Sunday 3 July, before heading to the capital’s Finsbury Park and Birmingham’s NEC simultaneously on the weekend of Friday 8 – Sunday 10 July. Visit here for information on each venue’s different line-up and head here to buy tickets. You can also be in with a chance of winning one of three sets of four VIP tickets to a Wireless 2022 day of your choice – giving you: A$AP Rocky. CREDIT: Taylor Hill/Getty Images for Governors Ball To be in with a chance of winning, just answer the below question correctly.  The competition closes at 11.59PM GMT on May 31, 2022. Check out our competition rules here. "
        },
        "https://www.nme.com/news/music/beach-bunny-karaoke-video-bob-odenkirk-3218355": {
            "title": "Watch Bob Odenkirk star in Beach Bunny’s galactic video for ‘Karaoke’",
            "content": "Better Call Saul and Breaking Bad star Bob Odenkirk has a starring role in Beach Bunny‘s new video for their song ‘Karaoke’ – you can watch the clip below. The track is taken from the Lili Trifilio-led band’s forthcoming new album ‘Emotional Creature’, which is set for release on July 22 via Mom+Pop Music. Speaking about ‘Karaoke’, Beach Bunny said: “‘Karaoke’ is a song about having a crush – it’s about infatuation, fleeting feelings, and the bittersweet nature of uncertainty. It’s about learning pieces of who someone is and liking them before even knowing the whole story.” The Eliza Chance-directed video for ‘Karaoke’ has gone live this afternoon (May 4), starring Odenkirk as a captain of a spaceship.  The clip is the first in an “adventure visual series” of Star Wars-meets-Star Trek-inspired videos from Beach Bunny, according to a press release. Beach Bunny will embark on a UK and European tour in October and November. You can find tickets for the UK dates here and see all of their scheduled shows below. October31 – Paradiso Noord, Amsterdam, NL November1 – Hole44, Berlin, Germany2 – Logo, Hamburg, Germany 4 – Gebaude 9, Cologne, Germany 5 – Botanique, Brussels, Belgium 6 – La Maroquinerie, Paris, France 8 – O2 Forum Kentish Town, London11 – SWX, Bristol12 – O2 Ritz, Manchester14 – The Empire Music Hall, Belfast15 – Vicar Street, Dublin16 – SWG3, Glasgow  Last year Beach Bunny performed their viral single ‘Cloud 9’ during their debut appearance on The Tonight Show Starring Jimmy Fallon. The band also teamed up with Tegan and Sara in 2021 for a reworked version of the track. "
        },
        "https://www.nme.com/news/music/oliver-sim-rehearses-new-version-of-the-xxs-i-dare-you-debut-solo-tour-watch-3218542": {
            "title": "Oliver Sim rehearses new version of The xx’s ‘I Dare You’ ahead of debut solo tour",
            "content": "The xx‘s Oliver Sim has shared footage of himself rehearsing a new version of the trio’s single ‘I Dare You’ ahead of his first solo tour. Watch the video below. The musician is set to play five headline shows this month after recently releasing two solo singles, ‘Romance With A Memory’ and ‘Fruit’, both of which were produced and co-written by his bandmate Jamie xx. Sim’s first gig will take place at Shoreditch Town Hall in London next Tuesday (May 10) ahead of further dates in Paris (11), Berlin (13), New York (15) and Los Angeles (17). You can find any remaining tickets here. As he prepared for the tour, The xx took to their official Instagram page to post a clip of their singer/bassist “covering his favourite band for next week’s shows”. Sim is seen delivering a stripped-back solo rendition of ‘I Dare You’, which appears on the group’s third album ‘I See You’ (2017). His bandmate Romy expressed her approval in the comments section, replying with a love heart-eyes emoji. Watch the footage here:  A post shared by The xx (@thexx)  Upon announcing his upcoming tour, Sim teased that he would be “joined by some very talented new friends” at the shows. “I’ll be playing my extensive back catalogue of two songs and something extra,” he wrote. “Come see me.” The xx, meanwhile, are yet to release the follow-up to ‘I See You’. Last December, the band shared footage of themselves working together in what appeared to be a rehearsal or recording space. The clip came almost two years after the band first hinted at their return with an Instagram post on New Year’s Eve 2019.  Meanwhile, Romy and Jamie xx are both due to perform solo sets at Primavera Sound 2022 in Barcelona next month. The latter artist shared his first single in two years, the anthemic ‘Let’s Do It Again’, last month. "
        },
        "https://www.nme.com/news/music/chester-bennington-band-grey-daze-share-first-episode-documentary-3216950": {
            "title": "Chester Bennington’s band Grey Daze share first episode of documentary",
            "content": "Chester Bennington‘s pre-Linkin Park band, Grey Daze, have shared the first episode of their documentary series. Watch the first episode below. The four-part series, called Grey Daze: Creation of the Phoenix, follows the band from their origins in the ’90s up to their yet-to-be-released LP, ‘The Phoenix’. The record, which is set to come out on June 17, features re-mastered vocals from Bennington. The Linkin Park frontman left Grey Daze back in 1998, but had reunited with them and was in the middle of re-recording music for a new album when he died in 2017. The band have shared the first episode of the docu-series, which features footage of Bennington and his bandmates playing together at their start, before getting into their experience of making ‘The Phoenix’, a follow-up to their 2020 album ‘Amends‘, which also featured re-mastered vocals from Bennington’s.  ‘The Phoenix’ will be a 10-song collection intended to honour the late singer, with contributions from Dave Navarro, Richard Patrick and Bennington’s daughters, Lily and Lila Bennington. “’Amends’ was more emotional and reflective,” Graze drummer Sean Dowdell said about the band’s coming release. “We felt sad when we were writing it. Now that we’re a couple of years removed, it’s very clear what we were going through. We were at a different stage of grief. We went through the shock and the sadness. Now, we’re back to gratitude.” Dowdell added: “‘The Phoenix’ is more of a celebration of our friend, his talent, and the music. It captures Chester’s angst and energy that people fell in love with. It’s much more aggressive. If you love Chester’s scream, you’ll love this record.”  In a four-star review of ‘Amends’ NME said, “rather than dwell on loss, ‘Amends’ celebrates the wild extremes of living” adding that it is “a great modern rock record fronted by one of the best vocalists in the game.” “‘Amends’ echoes the raw angst that made Chester a superstar with those early Linkin Park albums but also leans into his desire to speak to as many people as possible. Adding to his legacy but dealing in more than cheap nostalgia, ‘Amends’ is a powerful record that offers comfort, motivation and a sense of belonging.” "
        }
    }
}