{
    "web": {
        "https://www.pinkvilla.com/entertainment/song-joong-ki-amid-discussions-host-26th-busan-international-film-festival-taking-place-date-887608": {
            "title": "\n    Song Joong Ki amid discussions to host the ‘26th Busan International Film Festival’ taking place on THIS date  ",
            "content": "Good news for Song Joong Ki fans! On September 8, Sports Seoul reported that Song Joong Ki has been approached to host the opening ceremony of the 26th Busan International Film Festival happening from October 6 to 15. Song Joong Ki's management confirmed that the talented actor has indeed received the offer and is positively considering it.  Besides the offer to host the prestigious film festival, Song Joong Ki's record-breaking sci-fi movie 'Space Sweepers' is one of the many films to premiere at the 26th Busan International Film Festival. For those unversed, The Busan International Film Festival also known as BIFF is one of the most significant film festivals in Asia. The first festival, held from 13 to 21 September 1996, was also the first international film festival in Korea. The main focus of the BIFF is to introduce new films and first-time directors, especially those from Asian countries to a global audience. Another notable feature is the appeal of the festival to young people, both in terms of the large youthful audience it attracts and through its efforts to develop and promote young talent. This is the 26th year of the prestigious film festival. Meanwhile, on the work front, Song Joong Ki resumed filming his forthcoming movie 'Bogota,' which got postponed due to Covid 19. The actor is also confirmed to star in a new revenge drama, JTBC's 'The Youngest Son of Chaebol Family' alongside Shin Hyun Been. Join the biggest community of K-Pop fans live on Pinkvilla Rooms to get one step closer to your favourite K-Celebs! Click here to join. ALSO READ: Dear Oppa: An Indian fan of Song Joong Ki admires all the beloved characters he took on over the years Are you excited? Share your thoughts with Pinkvilla in the comments below. "
        },
        "https://www.pinkvilla.com/entertainment/build-your-perfect-weekend-we-ll-reveal-your-blackpink-bestie-out-jisoo-jennie-ros-lisa-914027": {
            "title": "\n    Build your perfect weekend & we’ll reveal your BLACKPINK bestie out of Jisoo, Jennie, Rosé & Lisa  ",
            "content": "From their debut in 2016 to 5 years ahead now, BLACKPINK has come a long way. Jisoo, Jennie, Rosé and Lisa have all carved their individual personalities and as a group. Be it fashion, music or influence on social media the group is acing in all fields. Over the years they’ve collaborated with stars like Selena Gomez, Lady Gaga, Dua Lipa and so many more. They’ve had their own Netflix show and even made history at Coachella 2018!    The group also has garnered love and cult-like following from their die-hard fans all across the world, BLINKS. If you’re a true BLINK and wondering who your BFF from the band is, scroll down and take the quiz below.    ALSO READ: BTS' Jungkook, BLACKPINK's Jisoo, GOT7's Jackson: Which Kpop idol would have a crush on you? Take QUIZ "
        },
        "https://www.pinkvilla.com/entertainment/throwback-when-exo-alum-do-opened-about-difficulties-he-faced-while-making-his-solo-album-994928": {
            "title": "\n    THROWBACK: When EXO alum D.O. opened up about the ‘difficulties’ he faced while making his solo album  ",
            "content": "We are looking back at July 2021, when EXO alum D.O. was just on the brink of releasing his first solo mini-album “Empathy” which featured six new songs and two bonus tracks! While talking to Naver about the track on the day of its release, D.O. was asked how he feels about the album, to which he said: “It feels really new. I used to sing with my members, but I had to sing alone, so there were some difficulties. However, it was nice to have a unique and fun experience. I’m curious what people will think of my album.”   When asked why he named his album Empathy, the idol said: “There were times when I couldn’t relate to the word ’empathy,’ but I felt that there was a lot of energy in it. So, just like I had experienced good and influential energy, I decided to go with the theme of ’empathy’ with the desire to give that to others.”   D.O. also shared why he was keen on exploring with acoustic music for this album, he said: “Since it’s my first solo album, I think I focused on doing music that I wanted to do. Personally, I really like the sound of acoustic guitar, and I felt comfortable listening to it, so I decided to go in that direction.”   D.O. also turned lyricist for the songs “Rose” and “I’m Fine” on the album, said: “After deciding the theme of the album would be ’empathy,’ one of the things I thought of was love, an emotion that anyone could feel, and I felt that it would be nice if my songs could comfort others like my previous song ‘That’s Okay,’ so I tried to write the lyrics myself.”   Also read: EXO alum Kai is inspiring these gender-fluid fashion trends to take centre stage "
        },
        "https://www.pinkvilla.com/entertainment/kim-so-hyun-lee-do-hyun-sung-si-kyung-are-selected-host-2021-kbs-drama-awards-date-948186": {
            "title": "\n    Kim So Hyun, Lee Do Hyun & Sung Si Kyung are selected to host the '2021 KBS Drama Awards' on THIS date  ",
            "content": "Some good news for K-drama fans! The '2021 KBS Drama Awards' will be taking place on New Year's Eve this year on December 31! The event will be hosted by veteran MC Sung Si Kyung, joined this year by actress Kim So Hyun and actor Lee Do Hyun. In light of various entertainment activities returning to in-person status, the '2021 KBS Drama Awards' will be held as an in-person event this year, while following all safety guidelines. The KBS Drama Awards is an annual awards ceremony presented by the Korean Broadcasting System or KBS for outstanding achievements in Korean dramas aired on its network. It is held annually on 31 December. The highest honour of the ceremony is the 'Grand Prize' aka 'Daesang', awarded to the best actor or actress of the year. The KBS award first started in the year 1987 and actor Im Dong-Jin won the Grand Prize for 'The Land'. Veteran actor Chun Ho Jin won the Grand Prize for the popular weekend family drama 'Once Again' in 2020.  Kim So Hyun charmed viewers as Princess Pyeonggang in KBS' 'River Where The Moon Rises'. She was born as a princess but raised an assassin. Upon learning the truth of her origins, she fights to win back her country and rightful throne from the corruption that has taken over. Lee Do Hyun greeted viewers as Hwang Hee Tae in 'Youth Of May', a medical student who has a sly and mischievous side but is determined and goal-oriented underneath. Although Hwang Hee Tae entered Seoul University’s medical school with top scores, he postpones his graduation due to trauma. Join the biggest community of K-Drama fans live on Pinkvilla Rooms to get one step closer to your favourite K-Celebs! Click here to join. ALSO READ: Melancholia: Lee Do Hyun and Im Soo Jung enjoy each other’s presence in the highlight preview What are your thoughts? Share your thoughts with Pinkvilla in the comments below. "
        },
        "https://www.pinkvilla.com/entertainment/kim-yoo-jung-and-shin-dong-yup-host-2021-sbs-drama-awards-962388": {
            "title": "\n    Kim Yoo Jung and Shin Dong Yup to host the 2021 SBS Drama Awards  ",
            "content": "Shin Dong Yup and Kim Yoo Jung will be hosting the 2021 SBS Drama Awards! The two celebrities were MCs last year, and they will once again present great teamwork for this year’s ceremony. The 2021 SBS Drama Awards is scheduled to take place on December 31 at 9 pm KST (5:30 pm IST).  Shin Dong Yup is one of the most prominent MCs of the South Korean entertainment industry and currently the MC of many SBS shows, including 'My Little Old Boy' and 'TV Animal Farm.' This year marks his fifth year hosting the event. Kim Yoo Jung, who made a mark with the hit SBS drama 'Lovers of the Red Sky.' This is her second time hosting the ceremony with Shin Dong Yup.  The 2021 SBS Drama Awards, which is scheduled to take place at the end of the year, will take measures to prevent the spread of Covid 19 and ensure the safety of its participants. Like last year, tables will not be set up in the audience area. Instead, the actors will wait in their respective waiting areas and come up to the stage when the presenter calls their name.  For safety purposes, the trophy will be placed on a table for the award winner to take it themselves. The MCs will use their personal microphones, and the microphones on stage will be disinfected and have their covers replaced after each award is presented. All personnel entering the building will have to pre-register and confirm their vaccination status. The people who have not been vaccinated yet will have to submit a negative Covid 19 test result. Join the biggest community of K-Drama fans live on Pinkvilla Rooms to get one step closer to your favourite K-Celebs! Click here to join.  ALSO READ: Kim Yoo Jung and Giriboy to collaborate on a new track by Dingo Music project single What are your thoughts? Share your thoughts with Pinkvilla in the comments below. "
        },
        "https://www.pinkvilla.com/entertainment/throwback-when-gidle-alum-jeon-soyeon-opened-about-her-solo-debut-935252": {
            "title": "\n    THROWBACK: When GIDLE alum Jeon Soyeon opened up about her solo debut   ",
            "content": "We are looking back at July 2021 when (G)I-DLE alum Jeon Soyeon spoke to Arena Homme Plus and opened up about her solo music career and much more. Talking about her solo mini-album WIndy, the idol said: “It captures the story I want to tell as the human Jeon Soyeon rather than as a team leader. I always say that I want to live like the wind. I want to live each and every day with excitement, and I want to go where my heart is drawn towards regardless of where that is. ‘Windy’ is an album that tells the story that my alter ego ‘Windy’ wants to tell.”   When talking about producing and performing on stage, the idol shared: “It’s really thrilling to stand on the stage, but the feeling of satisfaction when the project I produced comes out well overall is really great. I’m working hard to fulfill the wishes of Jeon Soyeon on stage as well as the producer Jeon Soyeon. I can work really hard. Rather than giving just the song, I want to be a producer that creates the general concept together.”   When asked if she had any doubts or fears before making her solo debut, the singer said: “I trust in my intuition. I originally had doubts since everything I want to do can’t all be right. However, the company CEO supported me by saying, ‘Soyeon appears to have great sense, so trust in your intuition,’ and I got the thought that my feeling of wanting to do something could become a reason. Looking back, the results were always good when I went with the way I felt.”   Also read: GIDLE leader Jeon Soyeon is the second in line for solo debut; Releases a cute & vibrant teaser "
        },
        "https://www.pinkvilla.com/entertainment/throwback-when-exo-alum-kai-got-candid-about-lockdown-life-missing-fans-and-performing-live-903404": {
            "title": "\n    THROWBACK: When EXO alum Kai got candid about lockdown life, missing fans and performing live  ",
            "content": "We are looking back at October 2020 when EXO alum Kai got candid about his wish to return to live performances and greet fans after the COVID 19 pandemic. Back in October, the pop icon spoke to 1st Look magazine and expressed his love for the stage! He said: “I love the stage in itself, but fans are what make the stage so special. I feel joy when I see the fans’ expressions and hear them cheering, and that joy gives me more energy and helps me to focus on the emotions.”   “Several times a day lately, I think about how I want to do a performance or concert together with fans there. I hope that soon the day will come when I can do a performance that’s full of life and energy,” he added.   Talking about the COVID 19 pandemic and his day to day life, Kai said: “I think lately I try to enjoy each and every day. I always want to do this work for a long time. I think about the direction to take that will help me always be happy and healthy.”   In current news, Kai will feature on Netflix's new original variety show titled, 'From The New World' (working title) and release it by the end of the year. The new variety show will feature Lee Seung Gi, Jo Bo Ah, Eun Ji Won and Park Na Rae alongside Kai as the official cast members. We cannot wait!   Also Read: THROWBACK: When EXO’s Kai opened up about his style, nicknames and more "
        },
        "https://www.pinkvilla.com/entertainment/throwback-when-bts-jin-got-candid-about-sometimes-being-useless-why-its-productive-1013404": {
            "title": "\n    THROWBACK: When BTS’ Jin got candid about sometimes being ‘useless’ & why it's productive  ",
            "content": "We are looking back at December 2021, when BTS alum Jin spoke to Vogue Korea, and opened up about his life philosophy, music and much more! Talking about his laid-back personality and his approach to life, the singer said: “I’m someone who believes in the usefulness of uselessness. You need to have days that some people might call useless in order to focus better on the days where you do useful things.”   The singer also opened up about his aversion to seriousness, he said: “It’s no fun. Of course, I’m serious about work. But aside from when I’m on stage, I spend about 80 to 90 percent of the time joking around. I think having fun is one of the things that makes it possible for me to work without getting burned out.”   Jin also opened up about his special talents and modestly said: “I’m nothing special, and I’m someone who doesn’t particularly excel at anything. Though people around me don’t think of me that way at all… if I even start to say something like this, they’ll say, ‘How can you say that? You’ve accomplished amazing things.’ But I still have a hard time accepting that. If someone were to ask me what sets me apart from other people, I wouldn’t have much to say other than ‘I’m a member of BTS.'”   When asked about how he keeps moving forward, Jin said: “If I focus on my everyday life, I naturally wind up forgetting and moving forward. In the past, I used to sort of distinguish between BTS’s Jin and the person Kim Seokjin, but I don’t anymore. I think the way I act on TV is the same way I live in real life.\"   Also read: Answer some questions & we'll reveal which BTS member you will celebrate Lunar New Year with "
        },
        "https://www.pinkvilla.com/entertainment/throwback-when-girls-generation-alum-sooyoung-got-candid-about-pros-cons-being-idol-actor-979163": {
            "title": "\n    THROWBACK: When Girls’ Generation alum Sooyoung got candid about the pros & cons of being an ‘idol actor’  ",
            "content": "We are looking back at March 2019, when Girls’ Generation alum Sooyoung was promoting her film Memories of a Dead End, and while chatting with Naver, the star opened up about being an idol as well as an actor, the star spoke about her journey of juggling both and more.  Looking at the pros and cons of being an “idol actor,” Sooyoung said: “A lot of people think that I am given a lot of opportunities because I started as an idol. That can be true. I’m grateful for those opportunities, but I think of this in two ways. There are roles that are suitable for people who first debuted as singers and roles that are not given to people who first debuted as singers. There were times when the production company or the director would say, ‘Sooyoung is really good but this role is not suitable for someone who comes from a music background.'”   She also added, “But there are times when I watch movies and can’t see myself replacing some of those actors who have done nothing but movie acting all their lives. I have to think logically about what choices I need to make to be an actor with lots of different paths open to her.”   Sooyoung also looked at a few other idols-turned-actors who have paved the way in filmography with their serious roles. She said: “Being a singer-turned-actor is both an advantage and a disadvantage. But I don’t think that my singing background is necessarily always going to block me from getting certain roles. There are people like Im Siwan and Do Kyung Soo [EXO’s D.O.]. Acting and characters are something that each person has to figure out on their own.”   Also read: Girls’ Generation alum Sooyoung inspires THESE 3 trends in our winter wardrobe "
        },
        "https://www.pinkvilla.com/entertainment/hometown-chachacha-star-kim-seon-ho-reportedly-hospitalised-amidst-ongoing-public-feud-ex-girlfriend-924374": {
            "title": "\n    'Hometown ChaChaCha' star Kim Seon Ho reportedly hospitalised amidst ongoing public feud with ex girlfriend  ",
            "content": "According to online rumours, actor Kim Seon Ho is said to be hospitalised at a university hospital near Seongbuk-gu. Furthermore, some netizens claimed that news reporters are currently waiting in the lobby of the hospital, hoping to catch a glimpse of Kim Seon Ho or potentially ask him interview questions. This comes after the actor publically apologised to his ex-girlfriend in an official statement and also rendered an unconditional apology in private, as confirmed by her. Post his public apology, the actor has maintained a dignified silence despite multiple allegations of rude and obnoxious behaviour by former friends and colleagues, charges vehemently denied by his agency, SALT Entertainment. Also, the actor will no longer be a part of the KBS2 variety show ‘2 Days & 1 Night’. Production teams of movies ‘Dog Days’ and '2 O'Clock Date' also announced that they will be replacing him. Meanwhile, Kim Seon Ho's agency has officially shut down false rumours about the status of his contract. SALT Entertainment clarified that the agency never conspired with his ex-girlfriend to create unfavourable circumstances for the actor and that he has plenty of time left on his contract before discussing the renewal of the contract. They also ensured that they will support Kim Seon Ho till the very end. Join the biggest community of K-Drama fans live on Pinkvilla Rooms to get one step closer to your favourite K-Celebs! Click here to join. ALSO READ: Kim Seon Ho's agency issues formal statement against false rumours regarding his official contract What are your thoughts? Share it with Pinkvilla in the comments below. "
        }
    }
}