{
    "web": {
        "https://www.hellokpop.com/news/kang-daniel-gears-up-for-comeback-in-may/": {
            "title": "Kang Daniel Gears Up For Comeback In May",
            "content": "Multi-talented K-pop male soloist Kang Daniel has been confirmed to make his much-awaited comeback in May.  Just recently, a representative from Kang Daniel’s agency, Konnect Entertainment, made an official statement on Joy News 24, saying, “Kang Daniel will make a comeback in the music industry in May.” The news of this comeback was first reported through the US Grammy’s Press Play At Home series earlier today, where Kang Daniel delivered a mesmerizing performance of his song “Antidote.”  Kang Daniel is expected to bring a lot of joy in his return as a singer as he has continued various activities such as challenging acting through the Disney+ drama Rookie Cops. The upcoming comeback will mark his first release since completing the color trilogy album series last year with YELLOW. Fans should stay tuned as to what kind of genres and performances he will show through his nearing music release. Meanwhile, earlier this year, Kang Daniel was hailed as the best male solo singer at the 2022 Korea Brand Awards. Notably, he won the title for the second straight year now. Source: Joy News 24 Photo Credits: Disney+ | Konnect Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/internet/bts-v-surpasses-40-million-instagram-followers-in-record-time/": {
            "title": "BTS’ V Surpasses 40 Million Instagram Followers In Record Time",
            "content": "Showing his power in the social media sphere, BTS’ V has surpassed 40 million followers in the shortest period of time in Instagram history.  On the morning of April 20, V’s Instagram account hit the 40-million mark. He was able to achieve the notable count in just 135 days after he launched his account in December last year. Remarkably, V’s Instagram following raked in two world records from the Guinness World Records. Soon after joining the social media platform, he recorded one million followers in just 43 minutes and 10 million followers in four hours and 52 minutes.  After reaching 20 million followers in 28 hours and 28 minutes, and 30 million followers on January 3, V broke a new record of increasing followers at the fastest rate in the world in the history of Instagram, and has since surpassed 40 million followers. The posts that V posted on the feed are receiving explosive responses. The photo of the dog briquette posted in December last year became the first post by an Asian celebrity to record 19 million likes and ranked 18th in Instagram’s Top 20 Likes. Celebrities who made it to the list with the most likes were Cristiano Ronaldo, XXX Tentacion, Ariana Grande, Billie Eilish, Kylie Jenner, Tom Holland, and Lionel Messi. Fans are delighted to see V’s Instagram updates as he shares his daily life, music, and hobbies. Moreover, through this platform, he was able to fulfill his simple wish to stay close with his fans like friends. Source: iMBC Photo Credits: V’s Instagram How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/hybe-completes-2-week-run-of-bts-permission-to-dance-the-city-las-vegas/": {
            "title": "HYBE Completes 2-Week Run of BTS’ “Permission To Dance THE CITY – Las Vegas”",
            "content": "From April 5 to 17, ‘THE CITY’ provided an immersive fan experience through various entertainment activations throughout Las Vegas, based on its concept, “urban concert playpark”. Especially on the 7th, through the collective efforts of HYBE and The Las Vegas Convention and Visitors Authority (LVCVA), the whole city lit up in purple. ‘THE CITY’ provided an extensive concert experience to all visitors and fans in town, in addition to  approximately 200,000 people who attended the in-person concerts on April 8, 9, 15 and 16 along with 22,000 viewers at ‘LIVE PLAY in LAS VEGAS’: According to MGM Resorts International (referred to as “MGM”), approximately 200,000 people visited the Fountains of Bellagio choreographed to BTS’ “Dynamite” and “Butter” over the two weekends. The pop-up store  ‘BTS POP-UP : PERMISSION TO DANCE in Las Vegas’ attracted around 70,000 fans who visited not only for official merchandise, but to also enjoy themed hands-on zones featuring photo zones, dance floors, etc. Notably, the number of total payments at the official merch store at the concert as well as the live play venue reached 93,000 cases. Accordingly, approximately 44,000 people visited ‘BEHIND THE STAGE : PERMISSION TO DANCE’, a photo exhibition displaying photos of BTS practicing for the ‘BTS PERMISSION TO DANCE ON STAGE’ tour that started last year. More than 10,000 visitors at CAFÉ IN THE CITY were able to try BTS’ favorite Korean dishes on a course menu. At the concert after-party ‘PARTY IN THE CITY’, a total of 4,000 pre-order tickets were sold out, while MGM Resorts’ 11 hotels recorded around 3,500 bookings.  Special thanks to ARMY for coloring \"THE CITY\" with BTS 💜 Cherish the memory of those days in Las Vegas! 'Cause we don't need permission to flash back✨#PTD_ON_STAGE_LV #BTS_THE_CITY_LasVegas #PTD_THE_CITY_LV pic.twitter.com/W65HFDjHBV — BTS_official (@bts_bighit) April 15, 2022  LVCVA’s Twitter account even changed its official name to #BORAHAEGAS during ‘THE CITY’, which is a combination of “Borahae” and (Las Ve)gas. Keyword hashtags related to ‘THE CITY’ exceeded over 9.24 million counts on Twitter and #LASVEGAS recorded more than 8.5 million posts from April 1 to 17, which increased by 1,300%  compared to the same period last year. Allowing fans to enjoy extensive and immersive experiences from an entertainment to a lifestyle aspect, ‘THE CITY’ showcased an innovative model to the industry. Chris Baldizan, MGM Resorts’ Executive Vice President of Entertainment and Sports, said, “The BTS takeover of Las Vegas was an incredible success. The excitement, passion and energy of the BTS Army was something very special to see, and we were thrilled at how busy and animated our resorts were throughout both weekends.” “While Las Vegas is known as The Entertainment Capital of the World, these two weekends took the energy to a completely new level,” he added. “‘THE CITY’ was a project that connected a concert and a city, which reflects HYBE’s goal to provide an ever-evolving fan experience without boundaries. Kicking off the project in Las Vegas, the world’s entertainment capital, making it more meaningful. There are infinite possibilities when it comes to introducing the next version of ‘THE CITY’, following our artists and fans,” said HYBE. Based on its success in Las Vegas, HYBE plans to expand ‘THE CITY’ project to various cities around the world. The company further plans to present a modular ‘THE CITY’ project in various forms and scales considering the characteristics of artists, fans, and regions.  PR Source: HYBE Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/winner-to-visit-knowing-bros-as-complete-group/": {
            "title": "WINNER To Visit “Knowing Bros” As Complete Group",
            "content": "Well-loved K-pop boy group WINNER will be treating viewers with a fun-filled episode on JTBC’s popular variety show Knowing Bros this May.  Just recently, an official from JTBC revealed that WINNER will be appearing on Knowing Bros as a complete four-member group. “WINNER’s Kang Seung Yoon, Kim Jin Woo, Song Mino, Lee Seung Hoon will be recording for ‘Knowing Bros’ today (April 21),” the representative said. The talented and witty quartet first graced the show in May 2018 together with fellow YG Entertainment artist Yoo Byung Jae. Their visit will mark their first return to the show in four years. According to reports, WINNER’s Knowing Bros episode will air sometime next month. Meanwhile, the boy group is currently preparing for their grand comeback. They are also set to meet fans through their first full-group concert. Titled WINNER 2022 Concert, WINNER’s upcoming music gathering with fans will take place on April 30 and May 1 at the Olympic Hall, Olympic Park, Songpa-gu, Seoul, starting at 5 PM KST. To accommodate global fans, the special event will also air simultaneously via a separate online viewing page on May 1. Source: Newsen | News1 Photo Credits: YG Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/viviz-to-become-first-k-pop-girl-group-to-perform-on-grammys-global-spin/": {
            "title": "VIVIZ To Become First K-Pop Girl Group To Perform On Grammy’s “Global Spin”",
            "content": "Rising group, VIVIZ, accelerates their global momentum, becoming the fourth Korean artist and first K-Pop group to take to Grammy’s Global Spin stage.  The original program, produced by the Recording Academy, highlights worldwide talent through their performance. Anticipation is elevated for VIVIZ’s appearance as they are the first K-Pop group to perform for the series. Their participation in the program is part of their pre-debut campaign efforts to make greater strides in entering the American market. The group will showcase a captivating performance of their recent title track, “Bop Bop!” from their debut album, Beam of Prism. Their stage will air on April 26 at 10 AM PDT according to local LA time.  VIVIZ’s recent efforts to enter the US market include signing contracts with a label, agent, promoter and publisher. Fans can look forward to their other global activities. Most recently, the group excited fans by announcing that they will unveil a remix version of “BOP BOP!”. The group collaborated with the world-renowned DJ Yves V for the track. Ever since their debut as VIVIZ in February SinB, Eunha, and Umji have impressed fans. While demonstrating their synergy founded through their time as GFRIEND, the group also revealed their new charisma as VIVIZ. Their debut album, Beam of Prism, included seven tracks highlighting their versatility and skills. In particular, the project marked their new beginning as a group while providing a glimpse at the musical delight in store for fans. As VIVIZ continues to make strides in the American market, fans can look forward to a variety of worldwide projects and promotions from the rising girl group. PR Source: HNS HQ Image and Video Source: BPM Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/interview/hkp-exclusive-interview-luminous-claims-the-spotlight-with-their-latest-comeback-between-light-and-darkness-self-n-ego/": {
            "title": "[HKP EXCLUSIVE INTERVIEW] LUMINOUS Claims The Spotlight With Their Latest Comeback “Between Light and Darkness (Self n Ego)”",
            "content": "Though we are still early into 2022, ATEEZ continues making large strides toward greater worldwide success. Their latest achievement showcases their global popularity as the group surpassed one billion cumulative Spotify streams.  Their agency, KQ Entertainment stated, “The cumulative number of streaming for ATEEZ’s entire albums have surpassed one billion streams on Spotify, the world’s largest music platform.” ATEEZ hit the 900 million stream milestone just recently, in February. Their quick rise to exceed one billion streams demonstrates the group’s popularity, which has only continued along its upward trajectory since their debut. The group boasts over 2 million followers on the platform as well as more than 3 million monthly listeners. As a result of their dedicated listeners, ATEEZ was the representative artist for the Korean billboard promoting Spotify’s rebranded K-Pop playlist, “K-Pop ON!”. Furthermore, the group was among the “Top 20 Keyword Posts” on YouTube for 2021 from data collected by the Ministry of Culture, Sports and Tourism and the Korea Agency for International Cultural Exchange. Among the keywords, ATEEZ ranked with K-Pop superstars BTS and IU in addition to the hit series, Squid Game. They have over 2.7 million YouTube subscribers, captivating fans with their original content such as the recent tour vlog series.  Meanwhile, ATEEZ landed in Spain for their upcoming Madrid shows as part of the European leg of their tour. The group thrilled fans by reuniting with them through offline events such as concerts and fansigns. They will return with new music in May, releasing their second Japanese mini-album. In total, they will visit five European cities before heading to Japan in July. Source: Sports Kyunghyang Image and Video Source: KQ Entertainment How does this story make you feel? LUMINOUS made a gallant entry into the K-Pop scene with their debut album in 2021, YOUTH, spearheaded by its title track, “RUN”. The project conveyed compassionate sentiments towards youth and their experiences. With the project, LUMINOUS’ four members, Steven, Woobin, Suil, and Youngbin, charmed fans not only with their relatable music but also with their unique charisma as idols.  Though it was clear from their initial debut that the team boasted honed performance skills, the members showcase their growth in their newest project. Their second mini-album, Between Light and Darkness (Self n Ego), continues their youth series established with their debut project. With their comeback, LUMINOUS beckons listeners to focus on comparing the ‘self’ and ‘ego’, or in other words, the real and the fabricated. By doing so, LUMINOUS extends their exploration of the challenges that young people face. However, while the album and its title track “All eyes down (advance)” may continue the themes of their prior project, LUMINOUS raises the stakes with their latest work. The members return fiercer than ever, delivering a mix of R&B, hip hop, and pop. Following their comeback with Between Light and Darkness (Self n Ego), LUMINOUS spoke to Hellokpop in an exclusive interview. We spoke about their production process, their own journey of youth, and more! Hellokpop (HKP): Hi LUMINOUS, thank you for sharing your time with Hellokpop! Please introduce yourselves to our readers. LUMINOUS: (Youngbin) — Hello, I’m the leader and lead vocal of LUMINOUS, Youngbin. (Suil) — Hello, I’m Suil and I handle dance, rap, and vocal in LUMINOUS. (Steven) — Hello, I’m Steven and I handle rap and vocal in LUMINOUS. (Woobin) — Hello, I’m Woobin and I’m the youngest and the main vocalist of LUMINOUS. HKP: Congratulations on your latest release with your second mini-album, Between Light and Darkness (Self n Ego)! What message do you hope your fans take away from your album? LUMINOUS: In the second mini-album, we speak of ‘youth’ where we wander in search of direction and meaning in the life we’ve chosen. We wanted to relate to and comfort similar-aged fans with similar worries as us, as well as people of broader and more diverse generations. We want to impart the message that you never know about the future, so we should never give up and move on even in the face of difficult moments. HKP: Your music video for your latest title track, “All Eyes Down”, really showcases your incredible abilities as performers. Did you have any behind-the-scenes stories to share about the filming experience? LUMINOUS: (Suil) — I had something that gave me goosebumps. I was doing some monitoring in the middle of individual filming in an eerie abandoned house, and the staff suddenly ran towards me asking if I called for them. I hadn’t said anything.. It’s still a mystery. (Woobin) — I had an individual scene where I smash a wall with a hammer. It was a real wall and not a prop, so I had to put more power behind it and worked hard to break it down. It was fun because I’ve never done that before.  HKP: What is your favourite song on your latest album and why? LUMINOUS: (Youngbin) — “Want it more?”. The lyric ‘Isn’t there such a thing as perfect’ is something I relate to. (Suil) — “Scintillation (Blind)”. I relate to the idea of rushing toward dreams and goals even if it means burning up like a moth into fire. (Steven) — “Trouble”. Because I can express the freedom within me through this song. (Woobin) — “Scintillation (Blind)”. This song in itself is about audacious and endless challenge, so I don’t want to lose that mindset. HKP: Can you share what the production process for this project was like? What was the most memorable moment you had during its creation? LUMINOUS: Since this album was our first comeback, we think the preparation went by faster than our first album. A memorable thing is that we practiced to accentuate the feel of every track, and we had to learn the title track’s choreography quickly so we practiced diligently. Album preparations seem to begin and end with practice.  HKP: You’ve shown a variety of different sides of LUMINOUS to your fans through your music. Is there a particular genre or concept you’d like to tackle next? LUMINOUS: (Suil) — The songs I listen to these days are moombahton tracks, so if there’s a chance I’d like for us to try a moombahton track. (Youngbin) — The first and second albums were somewhat dark concepts, so I want to try a bright and refreshing concept at some point. HKP: Since your debut, you’ve been exploring the theme of youth. Can you share what you have learned about yourselves during your journey of youth so far? LUMINOUS: (Youngbin) — My life motto is ‘Live today to the best of my ability’. Time never comes back so I realized I should live every day diligently. So I’ve been feeling that mindset of living every day to the fullest again. (Woobin) — Through debuting and having a comeback, I’ve learned that I can’t live this life on my own, so we need to understand and help each other. HKP: Your music brings a lot of comfort to fans when they encounter challenges as young people. Do you have any advice to share on how to overcome difficult times? How have you been able to overcome hardships? LUMINOUS: (Suil) — I think it would be good to take some personal time and think through things sufficiently, and then try to resolve the problem in your own way. (Woobin) — It’d be good to think as much as possible through the hard times, and don’t try to rush yourself back to being okay. HKP: LUMINOUS is a group that aims to bring light into the world and into your fans’ lives, but what has been a heartwarming experience you have had as an artist where you felt the light of your fans? LUMINOUS: When we’re feeling low because we’re dissatisfied with a performance, or exhausted from busy schedules, fans comfort and encourage us through letters or text, and in those times we feel that we receive light from our fans. HKP: Since debuting, you have formed quite a strong bond as a team. Can you share something that you are most proud of about another member? LUMINOUS: (Steven) — Woobin’s husky voice is charming, but his high notes are very cool too. (Youngbin) — I think Steven’s rap tone is very charming. I’m really envious of the low tones that I don’t have. HKP: How do you think your dynamic as a group has changed since your debut up until now? LUMINOUS: First of all, we remember being shocked at receiving so much unexpected love from many people at our debut. While working hard for this comeback with a little sense of pressure, we had some doubts about whether we could receive as much love as during the debut, but we were really fascinated and proud to again receive attention and love from so many people and attain good results. HKP: For newer fans, what do you think is the most charming point about LUMINOUS that stands out? LUMINOUS: (Steven) — Idols you can rely on and listen to! I think it’s our live singing, of course. (Youngbin) — I think it’s the vocals and dance that have a distinct color across the four of us.  HKP: What can fans look forward to from LUMINOUS this year? LUMINOUS: This year, we are preparing diverse content and performances so we can interact with many fans. We definitely want to meet with many fans if the COVID situation gets better. We are really preparing a lot of things, so please watch us! HKP: What are your biggest goals, both personally and for the group, that you have for 2022? LUMINOUS: We think it has to be our song breaking into the charts and to repay the fans who love us, we really want to do a world tour. We want to show our music and performance in many countries. HKP: Can you send a message of love to your global fans? LUMINOUS: Hello fans, it’s LUMINOUS. Our album was released after four months and thank you for waiting in the meantime. And thank you for loving and providing attention to this album as well.  We LUMINOUS will become artists that fans can be proud of, so please keep watching us for a long time, and loving us! We’ll see you again with good music and good impressions. We love you! You can follow LUMINOUS on the following platforms: Instagram, Youtube, Twitter, TikTok.  Our thanks to MJ TONZ and Barunson WIP for this interview.  All photos and videos in this feature were provided by Barunson WIP. This interview was conducted in Korean, translated by Hellokpop’s Jung Bae. How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/vixx-ravi-to-temporarily-leave-2-days-1-night-to-fulfill-mandatory-military-service/": {
            "title": "VIXX’s Ravi To Temporarily Leave “2 Days & 1 Night” To Fulfill Mandatory Military Service",
            "content": "Viewers of the popular KBS2 variety show 2 Days & 1 Night will have to temporarily bid farewell to VIXX’s Ravi.  On April 21, Ravi held a V Live broadcast to reveal that he will be leaving the program. He said, “The reason I came to you today is because I have something I want to tell you. I recently went on my last trip on 2 Days & 1 Night.” He also revealed that he’s been preparing for several things. “I’m doing my best for the things I need to do and what I can do recently. I’m preparing an album and working hard at the company. I hope to meet you and have a good time at my upcoming REVOIR concert,” he added.  Soon after, the production team of 2 Days & 1 Night released an official statement regarding Ravi’s departure and future plans. The team shared, “We would like to inform you that member Ravi is leaving the program to fulfill his military duty. We ask for your support for Ravi, who will temporarily part ways with us after the ‘Wish Us Luck’ tour, which will be aired until next week.” In addition, they said that they will provide future updates about the program-related matters as soon as they are decided. Ravi joined 2 Days & 1 Night as a new member in December 2019. Meanwhile, the remaining cast members are Kim Jong Min, Yeon Jung Hoon, Moon Se Yoon, DinDin, and Na In Woo. Source: iMBC | Sports Donga Photo Credits: KBS2TV How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/dance-prodigy-na-ha-eun-joins-sm-entertainment/": {
            "title": "Dance Prodigy Na Ha Eun Joins SM Entertainment",
            "content": "Popular dance prodigy Na Ha Eun has officially joined SM Entertainment.  On April 20, SM Entertainment announced that Na Ha Eun signed an exclusive contract with them. “Under SM’s systematic training and support, she is expected to further develop her outstanding talent and infinite potential to become the next-generation K-pop artist,” the agency said. '어썸하은' 나하은, SM과 전속 계약! '차세대 K팝 아티스트' 성장 기대! ‘awesomehaeun’ NA HAEUN signs an exclusive contract with SM Entertainment! Excitement is high for the next generation of K-POP star!#나하은 #NAHAEUN pic.twitter.com/iYjLNht7w0 — SMTOWN (@SMTOWNGLOBAL) April 20, 2022  Na Ha Eun is a young dancer born in 2009. She has been recognized by domestic and international fans for her outstanding dancing skills. Moreover, she runs her YouTube channel Awesome Haeun, which already surpassed 5.2 million subscribers. She drew attention by covering dance videos of numerous K-Pop stars such as BTS, Red Velvet, EXO, and aespa, among many others. Recently, viewers became curious about the fact that she has not uploaded videos on YouTube for three months. Soon after hearing the news of her move to SM Entertainment, fans congratulated her and sent well wishes online. Earlier this week, she earned positive feedback from fans after participating in the “Love Theory” challenge by NCT’s Taeyong and Wonstein. Source: Sports Chosun Photo Credits: SM Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/ateez-surpasses-one-billion-cumulative-spotify-streams/": {
            "title": "ATEEZ Surpasses One Billion Cumulative Spotify Streams",
            "content": "Though we are still early into 2022, ATEEZ continues making large strides toward greater worldwide success. Their latest achievement showcases their global popularity as the group surpassed one billion cumulative Spotify streams.  Their agency, KQ Entertainment stated, “The cumulative number of streaming for ATEEZ’s entire albums have surpassed one billion streams on Spotify, the world’s largest music platform.” ATEEZ hit the 900 million stream milestone just recently, in February. Their quick rise to exceed one billion streams demonstrates the group’s popularity, which has only continued along its upward trajectory since their debut. The group boasts over 2 million followers on the platform as well as more than 3 million monthly listeners. As a result of their dedicated listeners, ATEEZ was the representative artist for the Korean billboard promoting Spotify’s rebranded K-Pop playlist, “K-Pop ON!”. Furthermore, the group was among the “Top 20 Keyword Posts” on YouTube for 2021 from data collected by the Ministry of Culture, Sports and Tourism and the Korea Agency for International Cultural Exchange. Among the keywords, ATEEZ ranked with K-Pop superstars BTS and IU in addition to the hit series, Squid Game. They have over 2.7 million YouTube subscribers, captivating fans with their original content such as the recent tour vlog series.  Meanwhile, ATEEZ landed in Spain for their upcoming Madrid shows as part of the European leg of their tour. The group thrilled fans by reuniting with them through offline events such as concerts and fansigns. They will return with new music in May, releasing their second Japanese mini-album. In total, they will visit five European cities before heading to Japan in July. Source: Sports Kyunghyang Image and Video Source: KQ Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/monsta-x-global-comeback-show-shape-of-love/": {
            "title": "MONSTA X To Hold A Global Comeback Show For The 11th Mini-Album “SHAPE of LOVE”",
            "content": "MONSTA X will have a live comeback show for the 11th mini-album SHAPE of LOVE exclusively through the UNIVERSE app.  On April 14, UNIVERSE announced that it will exclusively host a comeback showcase for the powerhouse group. The global fandom platform revealed that the global comeback show for MONSTA X’s 11th mini-album SHAPE of LOVE will be held at YES24 LIVE HALL in Seoul. The comeback show will take place both online and offline. Those who want to participate offline can apply on the UNIVERSE app from April 14 until April 17. A total of 200 fans will be invited to attend the showcase in person, while global fans may also watch through live streaming exclusively on the UNIVERSE app.  In addition, there will be an event to apply for NFT limited goods to celebrate MONSTA X’s comeback. Further information regarding the aforementioned event will be made available on the UNIVERSE app on April 26. MONSTA X’s SHAPE of LOVE comeback show is expected to let the members communicate with fans in real-time and reveal behind-the-scenes stories from the album’s creation. The members will also introduce the album’s tracks as well as some TMIs about the production, particularly Joohoney’s composition “LOVE,” which also serves as the album’s title track.  Meanwhile, MONSTA X’s 11th mini-album SHAPE of LOVE will be released on various online music sites on April 26 at 6:00 PM KST. Two hours later, fans will be able to watch the comeback show on the UNIVERSE app on April 26 at 8:00 PM KST. Source: OSEN Image Source: Starship Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/internet/iu-surpasses-100-million-views-on-youtube-with-through-the-night/": {
            "title": "IU Surpasses 100 Million Views On YouTube With “Through The Night”",
            "content": "IU surpasses 100 million views on YouTube with her music video for “Through The Night”. This becomes IU’s seventh music video to reach such a feat, displaying her immense popularity as a global artist.  The singer took to her personal Instagram account to celebrate the news. In an Instagram story, IU warmly shared, “I don’t know why, but of all the celebration posts I’ve made so far, this one makes me the happiest!!” The music video scored 100 million views around five years after its initial release in 2017. Since then, “Through The Night” became a beloved, stand-out ballad in the music scene. In particular, IU’s lovely vocals expressed the sentimental lyrics beautifully, accompanied by guitar instrumentals. As a result of such musical prowess and popularity, “Through The Night” topped various domestic charts and won during the 2018 Golden Disc Awards. To this day, it remains as one of IU’s most cherished songs amongst fans and the public. This is IU’s seventh music video to claim such an achievement. Other music videos to reach this view milestone include, “BBIBBI”, “Palette”, “Eight”, “Blueming”, “Celebrity”, and “Not Spring, Love, or Cherry Blossoms”. While it is immensely commendable to have one music video surpass 100 million views, to have seven is a testament to IU’s global fame and power as a soloist.  Meanwhile, the artist will further showcase her many talents in acting. She will appear as the lead in the movie Dream and in the series Money Game, demonstrating the wide breadth of her skills. Source: Sports Kyunghyuang Image and Video Source: EDAM Entertainment | 1theK How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/dream-park-seo-joon-and-iu-completes-filming/": {
            "title": "“Dream” Starring Park Seo Joon and IU Completes Filming",
            "content": "Directed by Lee Byung Hun (Extreme Job), the movie stars Park Seo Joon and Lee Ji Eun (IU). Filming took place in Korea and Hungary. Dream tells the story of a soccer player, who coaches a special national team that will challenge the ‘Homeless World Cup’. Through Director Lee’s unique humor, the movie anticipates pleasant laughter on the big screen. Director Lee, who finished the extraordinary journey of Dream expressed gratefulness for completing the shooting which was delayed due to the prolonged corona pandemic. “I am very grateful and proud of the actors and staff who endured the process together. I will do my best to complete the rest of the post-production work so that the feelings we wanted to impart through this film can be conveyed to the audience.” Park Seo Joon, who portrays Hong-dae in the film, became the head coach of a team with different pains and pasts. His task is an opportunity to recover from the greatest crisis of a soccer player’s life. Hoping for the viewers’ attention, he remarked, “It’s the day the Dream‘s filming comes to an end. It’s sad to say that it’s over, but I’m really grateful that I was able to finish filming safely. I hope that the audience will love it a lot.” In addition, Lee Ji Eun, who dreamed of a life-changing success by portraying So-min, a TV producer, who participated in all processes from the formation of the homeless national team to the homeless World Cup challenge looked back with fondness on her latest project. “It was my first feature film shooting. It has accumulated more memories than any other work, so I think it will remain in my memory for a long time. It was a good time for me as I felt bright and light when I was acting in ‘Somin’. I hope that the audience will be able to laugh a lot with Dream and feel a warm heart.”  Source: JTBC News How does this story make you feel? "
        },
        "https://www.hellokpop.com/competition/hellokpopxhellolive-ticket-giveaway-b-is-1st-fan-meeting/": {
            "title": "HELLOKPOPxHELLOLIVE Ticket Giveaway: B.I’s 1st Fan Meeting “[B.I OFFLINE]”",
            "content": "Multi-talented male soloist B.I is set to meet fans through his first-ever fan meeting titled B.I OFFLINE on April 30 at 6 PM KST. The virtual event will run for 90 minutes and will be live-streamed via the content platform, hellolive.  B.I debuted as the leader of YG Entertainment’s prized boy group, iKON. Throughout his journey with his group, he worked on and released numerous hit songs, including “LOVE SCENARIO,” “KILLING ME,” and “RHYTHM TA,” among many others. He received recognition not only for his all-rounder skills as a vocal, rapper, and dancer, but also for his impressive talent in songwriting and composing. After leaving YG Entertainment, B.I began his journey as a solo artist in 2021 under IOK Company’s affiliate, 131 Labels. Soon after announcing his return, he gifted his long-awaiting fans with the release of his charity single “Midnight Blue.” A few months after, he dropped his much-anticipated solo debut album Waterfall. Late last year, he then released his first-half album COSMOS. Showing his unwavering power in the music scene, the well-loved artist showed great performance on the music charts during his solo debut year. In partnership with hellolive, HELLOKPOP is giving away three (3) live tickets to attend B.I’s first fan meeting. Tickets plus more details on exciting fan perks can be accessed via the hellolive website. We extend our gratitude to hellolive for collaborating with us on this event! Source: hellolive How does this story make you feel? "
        },
        "https://www.hellokpop.com/review/thirty-nine-kdrama-review/": {
            "title": "9 Resonating Lessons And Moments Gifted By “Thirty Nine”",
            "content": "Best shared with your friends and family, the series runs a dozen episodes only. Perfect for a scheduled binge watch. Trust me, the experience is life uplifting. K-Drama Review: “Thirty Nine” Treasures Life-Affirming Journey With True Friends   Thirty Nine traces the story of three friends. They first met when they were 18. Cha Mi-jo (Son Ye Jin), Jung Chan-young (Jeon Mi Do) and Jang Joo-hee (Kim Ji Hyun) have shared beautiful moments together. However, an inevitable separation happens when Chan-young was diagnosed to be terminally ill. While spending the numbered days of being together, they also come to terms to find love and pursue personal dreams and closures. Along the way, the three friends have become part of each other. In their shared memories highlighted in the series, they left heartening lessons worth pondering. Life presents us with different kinds of friendship circles. But the most special and worth keeping are lifetime friends. They are the kind of friends that are willing to share meaningful memories. They give a kind of friendship that endures.  Touching on the topic of adoption, Thirty Nine provided an encouraging nod to influence people emotionally and financially capable of adoption. More than that, it significantly expounded on the definition of family. Through Mi-jo’s story, the idea that a blood relationship can be outweighed by estrangement was emphasized. Correspondingly, the shared love and beautiful memories among a family that is not blood-related were underlined. Presenting heartfelt love stories, the couples featured in the series confronted problems before sealing their respective romantic relationships. Chan-young who was robbed of her one true love has to endure the thought that it soon will never last. While we understand Jin-suk’s desire to be acknowledged as her husband, it was later implied by Chan-young how she doesn’t care about binding papers. Likewise, Mi-jo who received a straightforward message from the father of the man she loves that he’s not in favor of them being together accepts the opinion and respects it. But she remained firm on her love promise because she knows she was worthy enough to be with Sun-woo.  Whether it’s trivial or monumental, it’s nice to work on special projects in our lives. Thirty Nine‘s trio has incorporated their goals with each other in mind. As we grow older, we tend to lose interest in things or activities we used to like. That’s why it’s important that we always have something to look forward to. Joo-hee and Hyun-jun both aspire to have a lifetime career that can keep their sanity. Having had enough of the pressure of working as company employees, they brave the choice to go become the bosses of their jobs. Starting a new career at 40 could be a little daunting but life is too short to have a job that does not make you happy.  Life can be too short or too long to be explored depending on how you make it interesting each day. No need to fret if goals and love are not manifesting at some point in your life, there’s always a right time for everything.  It’s always a blessing to return the unconditional love our parents gave us. Those we know about and those that we don’t know of. If resources permit us to dote on them, then, by all means, do it.  While it’s hard to do this every time, finding the silver lining to moments of life setbacks is a lifetime commitment. We are the main actors in our own lives so we can always drive it to meaningful memories and happy endings. Not money or material things, but time and effort make our relationship with our friends and family thrive. Celebrate life and friendship in Thirty Nine. In case you haven’t caught up on it yet, you can watch it on Netflix!  Photos: JTBC   How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/ikon-drops-first-teaser-for-upcoming-may-comeback/": {
            "title": "iKON Drops First Teaser For Upcoming May Comeback",
            "content": "Charismatic K-pop boy group iKON will be making their much-awaited comeback in May.  Earlier today, YG Entertainment posted the release poster on its official blog to announce iKON’s new album. Although the album form and track information are not yet unveiled, the date “2022.05.03” was clearly engraved, raising the fans’ expectations. This will mark iKON’s first music release in a year and two months since the digital single “Why Why Why” in March 2021. In the release poster, the blurry silhouettes of the six members show their unique free charm and restrained charisma at the same time. The name of the group, which is firmly placed under it, exudes a strong and strong atmosphere as strong as backlight, arousing curiosity about the concept of the upcoming comeback. Meanwhile, soon after gifting fans their new album in May, iKON will then hold back-to-back concerts at the Olympic Hall in Olympic Park, Seoul in June. The boys will meet fans offline on June 25. In addition, they will greet online viewers and offline audiences on the second day, June 26. Since their debut in 2015, iKON has made several hit songs including “KILLING ME,” “LOVE SCENARIO,” and “RHYTHM TA,” among many others. Source: iMBC Photo Credits: YG Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/yaksha-ruthless-operations-impressively-garners-netflixs-global-viewers/": {
            "title": "“Yaksha: Ruthless Operations” Impressively Garners Netflix’s Global Viewers",
            "content": "Yashka: Ruthless Operations follows the story of a breathtaking battle among a team of NIS agents, a special inspection prosecutor, and agents of various national intelligence agencies. It is a spy action movie of an overwhelming scale set in  Shenyang, China, the biggest battleground for spies. Accordingly, new character photos aiming to capture domestic and global viewers’ hearts were unveiled. The lead cast Sol Kyung Gu, Park Hae Soo, Lee El, Song Jae Rim and Park Jinyoung are seen holding guns donning their charismatic presence.  In the film, Ji Gang-in (Sol Kyung Gu) leads the NIS team overseas. He does not cover the means and methods for achieving their goals. Then, prosecutor Han Ji-hoon (Park Hae Soo) was dispatched to Shenyang to investigate them. Parading the veteran agents in the field, Yang Dong Geun, Lee El, and Song Jae Rim are the black ops team’s elite members who guarantee a spectacular firearm and cutting-edge intelligence operations. All of whom work together with different personalities and charms, promising to give an entertaining show.  Meanwhile, according to the Netflix TOP 10 website on the 13th, Yaksha: Ruthless Operations recorded 12.54 million views in just three days after its release. Notably, it ranks third in the Netflix global TOP 10 movie (non-English) category. In particular, it was on the TOP 10 list in 45 countries including Korea, Singapore, and Taiwan. Director Na Hyun’s upgraded spy action movie which captures the breathtaking battle between spies from different countries in an exotic space and the hot synergy of actors is streaming on Netflix.  Source: Sports Donga | Netflix   How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/blackpinks-jennie-overtakes-as-no-1-girl-group-member-in-april-brand-rankings/": {
            "title": "BLACKPINK’s Jennie Overtakes As No.1 Girl Group Member In April Brand Rankings",
            "content": "BLACKPINK’s Jennie has been crowned as the No.1 girl group member in the brand reputation rankings this April.  The rankings are based on various factors including consumer participation, media, communication, and community indices analyzed by the Korean Business Research Institute from March 17 to April 17. Overtaking the No.1 spot is Jennie from the femme fatale quartet, BLACKPINK. From previously placing third in March, she was able to rise to the top this month with a brand reputation index of 3,891,015. Some of the high-ranking phrases in the idols’s keyword analysis are “SOLO,” “Instagram,” and “YouTube.” Moreover, the words “cutie,” “hip,” and “surpass” are present as her high-ranking related terms. Holding on the second place once again is WJSN’s Bona. The Twenty Five, Twenty One star maintained the high rank with a score of 3,701,519. Girls’ Generation’s Taeyeon, who previously led the rankings, settled for third after earning a brand reputation index of 3,558,117. Meanwhile, Red Velvet’s Joy and BLACKPINK’s Jisoo completed the top five list as they placed fourth and fifth, respectively. Here are the other girl group members who entered this month’s Top 30: #6 Red Velvet’s Irene #7 BLACKPINK’s Rosé #8 Oh My Girl’s YooA #9 BLACKPINK’s Lisa #10 Red Velvet’s Seulgi #11 Red Velvet’s Wendy #12 Girls’ Generation’s YoonA #13 TWICE’s Nayeon #14 aespa’s Winter #15 Oh My Girl’s Arin #16 aespa’s Karina #17 Girls’ Generation’s Yuri #18 Red Velvet’s Yeri #19 (G)I-DLE’s Soojin #20 Girls’ Generation’s Sooyoung #21 Girl’s Day’s Yura #22 Oh My Girl’s Jiho #23 Billlie’s Tsuki #24 (G)I-DLE’s Miyeon #25 Girls’ Generation’s Seohyun #26 MAMAMOO’s Solar #27 Oh My Girl’s Seunghee #28 LOONA’s Chuu #29 MAMAMOO’s Hwasa #30 (G)I-DLE’s Yuqi Source: Sports Chosun Photo Credits: YG Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/kim-min-kyu-to-guest-in-sbs-show-master-in-the-house/": {
            "title": "Kim Min Kyu To Guest In SBS Show “Master in the House”",
            "content": "For those who have been following the career of Kim Min Kyu, we all know he has quite engrossing stints in entertainment shows. He amazed us with his singing voice in I Can Save Your Voice Season 4. Thereafter, he also induced heart-fluttering moments on the reality-dating show Love Me Actually. On the April 24 episode of Master in the House, Kim Min Kyu will appear as a guest joining the show’s mainstays.  Master of the House is an entertainment show where Lee Seung Gi, Yang Se Hyung, Kim Dong Hyun and Eun Ji Won meet renowned figures of different professions and specialties. Sharing stories on various topics, the invited masters and members delight in pleasant interactions. Meanwhile, Kim Min Kyu who debuted in the 2013 youth drama Monstar has been impressing K-Drama fans with his efforts in challenging various roles and genres. Even his small appearances in dramas Signal, Because This Is My First Life and Backstreet Rookie have made quite an impression. This year, Kim Min Kyu continuously proves his versatility with memorable roles in Snowdrop and Business Proposal. The latter has been enjoying massive popularity not just in South Korea, but overseas. Make sure to set your alarm right on Kim Min Kyu’s guesting on Master in the House on April 24, 6:20 p.m. Source: news1 How does this story make you feel? "
        },
        "https://www.hellokpop.com/news/bigbang-earns-perfect-all-kill-status-with-latest-masterpiece-still-life/": {
            "title": "BIGBANG Earns Perfect All-Kill Status With Latest Masterpiece “Still Life”",
            "content": "Legendary K-pop boy group BIGBANG continues to take over the music scene with their latest digital single “Still Life.”  BIGBANG released their highly-awaited comeback song “Spring Summer Autumn Winter (Still Life)” on April 5 at midnight KST. On April 11, iChart announced that BIGBANG’s newest masterpiece has officially achieved a perfect all-kill status. Notably, it is the first song by a male artist to achieve the feat this year. 2022.4.11 16:30 (KST) https://t.co/YcCwtsr6XXiChart™ 퍼펙트 올킬(Perfect All Kill)을 축하합니다! (9개 차트 올킬+iChart 주간/실시간 1위)BIGBANG (빅뱅) – 봄여름가을겨울 (Still Life) pic.twitter.com/bHfRKoJBfe — iChart™ (@instiz_ichart) April 11, 2022  iChart awards the certified all-kill to a song when it tops Melon’s daily and 24Hits charts, the daily and realtime charts of Genie and Bugs, Top Songs chart of YouTube Music, and the daily chart of VIBE, and FLO and iChart’s realtime charts. Moreover, a song earns a perfect all-kill when it also scored the No.1 spot on iChart’s weekly chart. BIGBANG’s “Still Life” is a song with a strong poetic metaphor and narrative power rather than intense performance or flashy music. The deep emotional lines of the members in the beautiful melody were conveyed and touched the hearts of global fans. The group’s promise of being “better more than before” penetrated the hearts of the fans. They also shared a heartwarming message, “After a rain comes to a happy ending instead of sadness.” Celebrate BIGBANG’s latest feat by watching their heartwarming “Still Life” MV below:  Source: iChart Photo Credits: YG Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/tv-movies/project-wolf-hunting-starring-seo-in-guk-and-jang-dong-yoon-completes-filming/": {
            "title": "“Project Wolf Hunting” Starring Seo In Guk and Jang Dong Yoon Completes Filming",
            "content": "Unveiling its global poster, Project Wolf Hunting, directed by Kim Hong Sun, has safely finished filming through the pandemic. Subsequently, it targets big screen unveiling in the second half of the year. The film chronicles the mission of transporting heinous criminals from the middle of the Pacific Ocean to Korea within three days, which even Interpol had given up. In the global poster released, the English title is engraved in red over a huge water vessel carrying criminals. Accordingly, the film has been attracting attention from the development stage due to the casting lineup. Bankable actors Seo In Guk and Jang Dong Yoon join reliable actors Choi Gwi Hwa, Sung Dong Il, Park Ho San, Jung So Min, Ko Chang Seok, and Jang Young Nam in the main cast. Inevitably, the large-scale action movie garners anticipation for its ambitious premise and cast roster. Project Wolf Hunting eyes a release date in the second half of 2022. Source: JTBC News | Photo: Contents G   How does this story make you feel? "
        },
        "https://www.hellokpop.com/kpop/ateez-to-release-their-second-japanese-mini-album-beyond-zero/": {
            "title": "ATEEZ To Release Their Second Japanese Mini-Album “BEYOND: ZERO”",
            "content": "ATEEZ continues their impressive fully-fledged schedules for 2022, dropping the surprising announcement that they will release their second Japanese mini-album. The project titled, BEYOND: ZERO, will release on May 25.  The mini-album includes seven tracks featuring the Japanese versions of fan favorites including, “Deja Vu”, “Turbulence”, “Take Me Home”, and “Fireworks (I’m The One)”. Notably, the mini-album also includes, “ROCKY (Boxers Ver.)”. ATEEZ will reinterpret the powerful anthem even more intensely with an added electric guitar sound. Additionally, their newest release will also provide new music with the songs “INTRO [BEYOND: ZERO]” and “The King”, both of which raise intrigue regarding what fresh sounds and messages ATEEZ will communicate with fans next. This marks the group’s second Japanese mini-album release after delivering their first with TREASURE EP. Map To Answer in February of 2020.  This continues ATEEZ’s admirable streak of worldwide activities since this year began. The group recently returned to South Korea following a sold-out stateside tour and are headed to Europe for their next leg this month. Amidst their packed schedules, they will present their newest Japanese mini-album to their adoring fans in May–just ahead of their Japanese tour dates in July. The album is already available for reservations as of April 11. Fans can choose from ‘TYPE A’ or ‘TYPE B’ of the ‘Normal Edition’ album or can also purchase the ‘ATINY Edition’ which is available to fancafe members only. Despite COVID-19 derailing much of the group’s initial tour plans, ATEEZ finally reunite with their loving ATINYs face-to-face with concerts taking place globally to meet their international demand. Meanwhile, ATEEZ will make their Japanese comeback with BEYOND: ZERO on May 25. Source: ATEEZ’s Official Japan Twitter  | Sports Khan Image Source: KQ Entertainment How does this story make you feel? "
        },
        "https://www.hellokpop.com/kdrama/monstrous-mounts-haunting-and-cryptic-supernatural-story/": {
            "title": "“Monstrous” Mounts Haunting and Cryptic Supernatural Story",
            "content": "Monstrous chronicles the story of people in a village where a cursed Buddha image appears. Thereafter, mysterious events occur in the village causing chaos and fear. Ahead of its premiere, character stills of Koo Kyo Hwan and Shin Hyun Bin are unveiled. Portraying the characters of Jung Ki-hoon and Lee Su-jin respectively, their expressions show a happy couple who go on the usual perfect normal life. However, an unexpected accident shakes their world when their one and only daughter died. In the drama, Ki-hoon studies strange phenomena while Su-jin is a genius code breaker. Attention is focused on whether the two talented scholars will be able to prevent a catastrophic event and how this disaster will change their relationship. Sharing his thoughts about the female lead, Koo Kyo Hwan remarked that Shin Hyun Bin is always ready to shower the set with her kindness. “Even when she is nervous, she gives me peace of mind,” the actor added. Likewise, Shin praised Koo for his humor and sensible ideas. “There were a lot of times we filmed difficult and painful scenes together rather than enjoyable scenes. I was able to shoot comfortably and happily thanks to Koo Kyo Hwan’s humor, sensible ideas and genuine care.” Monstrous premieres on TVING on April 29. International fans can watch it on Viu.  Source: Sports Donga How does this story make you feel? "
        }
    }
}