{
    "web": {
        "https://www.koreaboo.com/news/2ne1-cl-dara-sandara-park-coachella-2022-sexy-funny/": {
            "title": "2NE1’s CL Can’t Handle Dara’s Super Sexy Lingerie Behind The Scenes At Coachella 2022",
            "content": "CL spilled all the details of 2NE1‘s Coachella appearance in her recent behind-the-scenes video. From practicing as a group to funny backstage moments, the members shared their every part of their exciting experience. 2NE1 at Coachella 2022. | @88rising/Twitter Some of the funniest moments happened behind the scenes when CL entered fellow member’s hotel room! Your browser does not support video. Dara, also known as Sandara Park, revealed she went lingerie shopping and even shared she bought some “really racy ones.” However, CL wasn’t ready for what Dara pulled out of the bag! Your browser does not support video. As she looked at the teeny-tiny lingerie with barely any coverage, her hilarious and surprised expression was followed by one sentence. Who is this for? — CL Your browser does not support video. Dara insisted that the lingerie was only for herself, leaving CL in more shock. Your browser does not support video. Holding it up to Dara and comparing it to her body, the two hysterically cracked up! No, I can’t reveal the size! — Dara Your browser does not support video. CL also pulled out a robe that seemed like the furthest thing from Dara’s taste, according to herself. Your browser does not support video. I’ve never seen you put on this kind of thing. Has anyone seen her wearing something like this? — CL Your browser does not support video. Watch the full video below!  2NE1 Reminisced On The “Old Times” While Preparing For Coachella, And They Loved Being Together Again 2NE1 Disbanded “Without Proper Explanations” According To CL, And They’re Making Amends With Their Coachella Reunion Here’s 2NE1 Dara’s Secret To Lose Weight And Achieve Her Signature Slim And Toned Figure 2NE1’s Sandara Park Has A Surplus Of Abs And Here’s How You Can Get You Some See more 2NE1 "
        },
        "https://www.koreaboo.com/news/ateez-surpasses-1-billion-streams-spotify/": {
            "title": "ATEEZ Surpasses 1 Billion Streams On Spotify",
            "content": "According to KQ Entertainment, the cumulative number of streaming for ATEEZ’s albums has exceeded 1 billion streams on Spotify, the world’s largest music platform. They also have about 2.25 million followers on Spotify, and recently set its own record by exceeding 3 million monthly listeners.  | @teeztinystream/Twitter They have also received more love from fans around the world as they held their 2022 world tour, THE FELLOWSHIP: BEGINNING OF THE END, which started in Seoul in January and continued on to six cities in the U.S. They will continue with eight concerts in five European cities starting on April 23 local time. ATEEZ’s San Just Tried To Give ATINYs The Ultimate Seonghwa Fan Service During Their Concert ATEEZ Announces A Comeback – And Fans Are Impressed By How Immersive Their Lore Is Happening Now: ATEEZ To Reunite With ATINYs In Europe For 2022 World Tour “THE FELLOWSHIP : BEGINNING OF THE END” ATEEZ’s Yunho’s Hands Deserve Their Own Fandom, And Here’s Proof See more ATEEZ "
        },
        "https://www.koreaboo.com/news/bts-jin-chris-martin-coldplay-guitar-friendship/": {
            "title": "Coldplay’s Chris Martin Shows Respect For BTS’s Jin And Korean Culture, Earns Praise From Fans",
            "content": "A new “Coldtan” interaction is warming hearts and earning praise from BTS‘s fandom, ARMY. From left to right: BTS’s Jungkook, J-Hope, Jin, and V, Coldplay’s Chris Martin, BTS’s Suga, Jimin, and RM. | @coldplay/Twitter On September 24, 2021, BTS and Coldplay released “My Universe,” a collaboration song and music video. This chart-topper is all about transcending barriers through music and love. | @coldplay/Twitter And they said that we can’t be togetherBecause, because we come from different sides — “My Universe” lyrics BTS and Coldplay went on to perform “My Universe” on stage at the 2021 American Music Awards and at BTS’s PERMISSION TO DANCE ON STAGE – LA concert. | Pitchfork Now, the groups’ friendship is making headlines again for the most wholesome reason. In a new interview with KiddNation, an interviewer asked Chris Martin about the guitar he gave to BTS’s Jin as a present. | @bts_twt/Twitter “You gifted your guitar to one of the BTS boys,” the interviewer began. Chris Martin jumped in to clarify, calling Jin by name. “Jin, yeah,” he said.  The interviewer took Chris Martin’s cue and continued, “Do you feel like the other guys looked at you like, ‘Aw dang, Jin got it. Like, what are we going to get now?'”  Your browser does not support video. Chris Martin then explained that he paid “extra respect” to BTS’s eldest member, but Coldplay did give gifts to the rest of the members as well. Well, Jin is the eldest, so the way I think that Korean culture works is that’s okay to pay extra respect to the eldest, and I think Jin is–as far as I can tell–the most into guitary stuff [. . .] and we did give gifts to everybody, too. — Chris Martin Now, ARMYs are praising Chris Martin for learning about Korean culture, and for stepping in to highlight Jin as an individual rather than allowing him to be, “one of the BTS boys.”  literally any interviewer: member of bts chris martin: yes, JIN right 🥺#JIN #BTSJIN — Seokjinism | 🐟 (@seokjinism1) April 21, 2022  What an awesome guy! I continue to be impressed with Chris Martin and how much he knows about BTS- the fact that Jin is the oldest and gifting the eldest member is being respectful and he said that Jin knows how to play already, lol! — May⁷𐤀 (@TinaP_9) April 21, 2022  Chris Martin is a class act. Notice how he said Jin, when the guy said “one of the BTS boys”, plus the fact he knows about being the eldest and what it means in korean culture 💜😭 — eikstevs 💜 (@Cutiesvelte) April 21, 2022  Watch the full interview here. Chris Martin talks about BTS at the 7:47 mark.  “Single’s Inferno” Star Shin Ji Yeon’s Sister Goes Viral On TikTok “BTS PERMISSION TO DANCE ON STAGE – LAS VEGAS” Concert Security Guard Goes Viral For Wholesome Interaction With Jimin BTS’s Jin Loves To Fight, Even In A Cast, So Jungkook And V Gently Play Along Samsung Drops Anticipated BTS Selfie From “PERMISSION TO DANCE ON STAGE – LAS VEGAS” Concert View All (316) "
        },
        "https://www.koreaboo.com/news/aespa-winter-fan-harry-styles-live-performance-coachella/": {
            "title": "Aespa Winter’s “Dreams Come True” After Finally Getting To Watch Harry Styles Perform Live",
            "content": "aespa‘s Winter is known to be a fan of Harry Styles, one of the most famous pop singers from the UK. The hit singer’s track “Watermelon Sugar” spread like wildfire in South Korea due to its catchy melody and easy lyrics.  Most fans would know by now that Winter is a huge fan of the singer. She has been naming him as a singer she loves since her debut. a compilation of winter saying harry styles pic.twitter.com/IncxtkzNVc — winter hoodie (@winttokkie) April 21, 2022  During a live stream on the way to Coachella 2022, Winter couldn’t help but gush over how she was going to get to see him live. Harry Styles is one of the headliners for Coachella 2022, while aespa was invited to perform on Weekend 2 as part of 88rising‘s set. Winter said she’s going to see harry styles later. So aespa will probably watching harry styles performance at coachella today😍 pic.twitter.com/v1nc1n7X5D — Karinapril (@ujiminphoria) April 23, 2022  I wanted to say that as everyone knows, Harry Styles will perform today. You guys know that I’m a huge fan of him, right? When did they say he’ll perform? Was it after 11… Finally…I’ll get to see him. Finally. — Winter The other members even congratulated her on her big opportunity. Winter was spotted sitting at the VIP lounge on her phone when the day rolled around, waiting for his set.  She went to watch him perform live soon after. According to fans, she left immediately after Harry’s set was over. Op saw aespa leaving the set after Harry Style performs. All I can say, congrats sis Winter!! Fan girl moment there. 👏pic.twitter.com/CgoxHhdUJJ — 𝐍𝐎È (@aesleven) April 23, 2022  She certainly proved that she’s his biggest fan! We’re glad she got to have that moment at Coachella 2022. Now, fans are hoping that the two would have taken a photo together backstage. Manifesting circle:  🕯 🕯 🕯 Winter 🕯 and Harry Styles 🕯 take a picture 🕯 together 🕯 🕯 🕯 🕯 — 🐱 (@YuJimin___) April 23, 2022  After all, aespa already has hobnobbed with other stars such as Pink Sweat$ and Tori Kelly at Coachella! aespa with Tori Kelly and Pink Sweat$. | @aespa_official/Twitter Fingers crossed!   Aespa Unveils Brand New English Song, “Life’s Too Short,” Captivating The Crowd At Coachella Weekend Two Aespa Go Viral On Twitter For Their Effortless Visuals Prior To Their Coachella Performance A Fan Proposed To aespa’s Ningning And Her Members Turned Hilariously Protective Aespa’s NingNing Stuns With Her Blond Hair And Impeccable Street Fashion In Hollywood See more aespa "
        },
        "https://www.koreaboo.com/news/twice-sana-chaeyoung-flirting-date-cute-moments/": {
            "title": "TWICE’s Sana Can’t Stop Flirting With Chaeyoung On Their “Date” And It’s Too Wholesome",
            "content": "With the same blood type and very similar MBTI types, TWICE‘s Sana and Chaeyoung have endless chemistry together! Recently, they put that to the test and spent some precious one-on-one time where they revealed their true feelings about each other. Your browser does not support video. Discussing everything from their first impressions of each other to fond memories they’ve shared, the girls began sharing some of their favorite things about each other. Sana shared that Chaeyoung established her own taste, a result of becoming more mature throughout the years. When people ask what you think about something, you explain it really well, and I think that comes from maturity. — Sana Your browser does not support video. However, in typical Sana fashion, she also layered on the compliments! She shared that she loves looking at her face… Your browser does not support video. …saving her selfies… Your browser does not support video. …and seemingly, making her feel a bit shy! Your browser does not support video. The cute moment left the girls with smiles that continued even throughout their serious conversations. Your browser does not support video. Chaeyoung returned Sana’s love, complimenting her complexity that not many people see who fail to look beyond her positive and energetic image. You try really hard to be the way you are. You try hard to stick to who you think you should be. You plan things out and you try hard to achieve your aspiration. — Chaeyoung Your browser does not support video. Watch all of their super cute interactions below!    10 Times TWICE’s Chaeyoung Looked Drop-Dead Gorgeous In Glasses These 10 Pictures Show The Evolution Of TWICE’s Chaeyoung From Predebut To Now TWICE’s Sana Opens Up About The Most Frustrating Part Of Being A Foreign K-Pop Trainee 10 Times TWICE’s Jihyo Looked Drop-Dead Gorgeous In Glasses See more TWICE "
        },
        "https://www.koreaboo.com/news/shin-dong-yup-confesses-once-casted-in-adult-film/": {
            "title": "Shin Dong Yup Confesses He Was Once Casted In An Adult Film",
            "content": "MC Shin Dong Yup stated he had once filmed for an adult movie. Shin Dong Yup (left) and Kim Yoo Jung (right) | SBS’s Drama Awards/SBS The comedian, who is one of three “National MCs,” alongside Yoo Jae Suk and Kang Ho Dong, is famous for his signature rated R humor. Your browser does not support video.Shin Dong Yup on Witch Hunt | JTBC In a teaser for the episode of Along With The Gods airing on April 22, Shin Dong Yup admits that during his college years, the comedian had filmed as an extra for an adult movie, shocking guests and panelists alike. Shin Dong Yup | Along With The Gods/Channel S When asked what role he played, Shin Dong Yup replied, “I played the main character’s friend. All I did was watch.” Cast of Along With The Gods. From left to right: Lee Yong Jin, Sung Shi Kyung, Park Sun Young, and Shin Dong Yup | Channel S The comedian stated that “Unfortunately, my scene was edited out. But I did receive money for filming.” Park Sun Young (left) and Shin Dong Yup (right) | Along With The Gods/Channel S Debuting in 1991, Shin Dong Yup has become a beloved comedian for his quick wit and adult-themed humor. The MC has recently made news for the return of Witch Hunt, one of Korea’s first and only adult-themed talk show to gain major commercial success. Witch Hunt | JTBC Along With The Gods is a talk show featuring Korea’s once brightest stars in a previous era. The talk show revolves around the changes and differences in Korea’s entertainment industry from then to now while sharing the stories of stars that shone brightest in the past. Check out the teaser for the episode mentioned above in the link below.  "
        },
        "https://www.koreaboo.com/news/bts-v-instagram-profile-photo-comeback-hint/": {
            "title": "Did BTS’s V Just Drop A Comeback Hint? Let’s Investigate",
            "content": "Now that BTS has announced their comeback, fans are on high alert for hints, spoilers, and clues about what the group has planned. BTS’s comeback teaser | BANGTANTV/YouTube At the final PERMISSION TO DANCE ON STAGE – LAS VEGAS concert, BTS played a teaser video that had fans on the edge of their seats. The video begins with a black and white montage of BTS’s past music videos and ends with their comeback date “2022.06.10.” THE WAY ARMYS WHEN THEY SAW THE BTS COMEBACK DATE! I GOT GOOSEBUMPS OMG! BTS IS COMING! pic.twitter.com/9SuTdc95HL — ًac ⁷ ♡ jimin ost (@vminggukx) April 17, 2022  Now, some fans are now wondering if V just dropped a hint about BTS’s comeback concept. V On Instagram, V changed his profile photo to this never-before-seen self-portrait. The photo’s high quality, V’s dapper outfit, the book, and the setting suggest that this shot could be from a professional photoshoot. V | @thv/Instagram  Could V’s shoot be for BTS’s upcoming album? What about his mixtape?  Kim Taehyung in a white suit with a hat, covering his face with an open book standing in a field !.?!?!?!!?? 😵😳😭why and wht did they film this for!?!?!? pic.twitter.com/dAgCwYdUEu — ⟭⟬♡- BackUp (@BTSArmy_47) April 21, 2022  AND TAEHYUNG’s NEW PFP?!?!??!???? WHAT DOES IT MEANVBVBVBGHGHG KTH1??? WAB COMEBACK CONCEPT?!!!??!?? MAIN LEAD?!??!? WHAT IS IT — (•̀ㅅ•́) ⁷ 푹신 푹신 태태푸딩 💛 taebear // slow (@flufftaepudding) April 21, 2022  now imagine if taehyung's new ig pfp is a spoiler of the new album concept 🫣 — naya⁷𐐪𐑂 (@ssoftaegi) April 21, 2022  1. taehyung is making concept photos for kth13. tae is shooting a mv for kth1 title track4. vcuts are coming from solo photoshootBut hoping for –2. actor kim taehyung is coming — Kambu (@Kambu28817651) April 21, 2022  It could possibly be a promotional photo as well, given how much focus is put on V’s luxurious watch, which retails for over $1000 USD. V Instagram Profile Picture [ Frederique Constant Watch ]#V #BTS @BTS_twt pic.twitter.com/iHjGZtqvd9 — Bangtan Style⁷ (slow) (@Bangtan_Style07) April 21, 2022  Then again, V loves to dress up in suits for any occasion. For all we know, he could just be out for a stroll! With Taehyung you can’t even tell if it a photoshoot or just a casual walk pic.twitter.com/8VNTd9qi4A — TITANIA 🥀 (@moonchildinmono) April 21, 2022  Read more about BTS’s comeback here: BTS To Drop New Album On June 10, 2022: See The Comeback Teaser Revealed At The Las Vegas Concert  BTS’s Jimin Edited His Name On Instagram, And Fans Are Debating What It Could Mean Korean Fans Name The Moment That BTS’s Jungkook Looked The “Prettiest” In His 10 Years As A Singer BTS’s Suga Is Whipped For RM’s Muscles, And So Are We Did BTS’s Suga Just Spoil His Upcoming OST? All Signs Point To “YES” See more BTS "
        },
        "https://www.koreaboo.com/news/got7-maknae-line-bambam-yugyeom-leader-jay-b-dance-practice-comeback/": {
            "title": "GOT7’s Maknae Line Urge Leader Jay B To “Come Quickly” For Dance Practice, Further Sparking Comeback Suspicions",
            "content": "GOT7‘s maknae line has arrived for dance practice and is just waiting on the rest of the members! GOT7’s Yugyeom (left) and BamBam (right). BamBam just returned to South Korea from trips to the United States and Thailand, and he’s already meeting back up with the members, anticipating the group’s comeback. BamBam at the Incheon International Airport. He has been spilling tea and dropping spoilers regarding the members’ plans, including a full group comeback, since the start of the year despite no confirmation from the leader himself, Jay B. BamBam struggling not to spoil got7’s comeback for one minute straight aka BamBam confirming their comeback 😭 🔗 https://t.co/qzXJkiC4HF@BamBam1A #bambam #got7 pic.twitter.com/v8GumZL5Zq — ddalche (@ddalche) January 18, 2022  BamBam previously said that if all members were present in South Korea, it was guaranteed a comeback was in sight. Now, everyone is there yet again! . @BamBam1A spoiled that jackson is in korea, spoiling that he knows the date of got7 comeback and that they already finished recording, that the members met up for a week and did something, he also said that got7 comeback is sooner than we think. bambam our reliable source lol — ㅍㅅㅍ (@arscnvshr) April 14, 2022  Jackson's Instagram said \"korea\" now mark in korea, bambam said \"when you see the members at the airport you know the got7 comeback is happening\" — lissie 🦎 (@kickitjy) March 5, 2022  So, the “Spoiler King” BamBam shared another update on Thursday, April 21. He posted a mirror selfie with fellow maknae Yugyeom in a dance practice room with the caption tagging Jay B and telling him to come quickly.  A post shared by BamBam (@bambam1a)  Jaebeom-hyung, come quickly — BamBam’s caption This follows the news of Jay B reportedly starting his own label and acquiring the rights to GOT7’s sub-units such as JJ Project, which he will co-own with Jinyoung, JUS2 with Yugyeom, and more! He has really proved to be the “best leader.” | @defdaily_th/Twitter  | @defdaily_th/Twitter  | @defdaily_th/Twitter  Aside from that, what might Jay B be up to as Yugyeom and BamBam wait for him? Well, he just returned as host to KBS Cool FM‘s STATION Z JAY B’s R&B since fellow member Mark Tuan filled in for him the past couple of weeks. This Wednesday’s episode featured a special guest, another GOT7 member, none other than Jinyoung! 4/7 got7 members has guested on Jay B’s R&B station Z so far 🥺 pic.twitter.com/jzgRf6MLzq — Bel¨ (@jbdefsyg) April 20, 2022  All signs are once again pointing favorably to a GOT7 comeback. okay pic.twitter.com/s2rXuYK6el — 영재쟁 🍒 | busy: ojt (@forgot7ss) April 21, 2022  OKAY BUT CAN WE TALK ABOUT WHO IS THIS??? 😭😭 MARK? JACKSON? JAEBEOM? pic.twitter.com/rIfmf4vaCI — kristel¨ (@bambammie21) April 21, 2022  GUYS REMEMBER THE LAST TIME BAMBAM POSTED A MIRROR SELCA IN A PRACTICE ROOM IT'S FOR THEIR BOL COMEBACK! SO… 🤡🤡🤡🤡#GOT7 #갓세븐 @GOT7Official pic.twitter.com/E0yhWtBDO5 — woona¨ ia 📚 (@peachcnvs_) April 21, 2022  3/7 in practice room since yugbam is waiting for jaebeom. GOT7 comeback soon. GOT7 ot7 selca soon please. — ava (@defsoulars_) April 21, 2022  Here Are 10+ Ahgase Reactions To GOT7’s Comeback News That Are Too Real 10 Of GOT7’s Song Lyrics That Will Tug At Your Heartstrings Did BamBam Just Confirm GOT7’s Full Group Comeback? All Signs Point To “YES” GOT7 Will Reportedly Make A Full Group Comeback In May See more GOT7 "
        },
        "https://www.koreaboo.com/news/got7-bambam-confirm-full-group-comeback-twitter/": {
            "title": "Did BamBam Just Confirm GOT7’s Full Group Comeback? All Signs Point To “YES”",
            "content": "All year, there has been lots of speculation regarding a GOT7 comeback. From left: Jinyoung, Mark Tuan, Jay B, Jackson Wang, BamBam, Yugyeom, and Youngjae of GOT7. | JYP Entertainment GOT7’s “Spoiler King” BamBam contributed to a lot of the rumors as he continually spilled information regarding the members and a comeback. BamBam struggling not to spoil got7’s comeback for one minute straight aka BamBam confirming their comeback 😭 🔗 https://t.co/qzXJkiC4HF@BamBam1A #bambam #got7 pic.twitter.com/v8GumZL5Zq — ddalche (@ddalche) January 18, 2022  Now, after months, according to an exclusive report from Joy News24, GOT7 are said to make a full group comeback in May. The new music production is nearly complete, and the members are in preparation for upcoming promotions. | @MarkTuan/Twitter It will be GOT7’s first group release in 14 months, as the group released their song “ENCORE” in February 2021 after they left JYP Entertainment. Since then, the members have all released solo projects. Still, they emphasized that the group had not disbanded and would actually make yearly comebacks.  If that was not enough confirmation, a GOT7 member is making it even more obvious with his internet activities. Shortly after the news was released, BamBam simply tweeted, “7,” which he then pinned. 7 — BamBam (@BamBam1A) April 22, 2022  Ahgases speculated what he intended by the tweet. Either way, it was certainly related to the comeback and almost was like an official confirmation from a GOT7 member. Yet, that was not all. Guys… Bambam posted just seconds before 6PM KST. If he’s doing a countdown every hour till midnight, we may get teasers today 😳 pic.twitter.com/mgb9hr9wTe — Bel¨ (@jbdefsyg) April 22, 2022       Additionally, BamBam “liked” one article on Twitter about the comeback news. At the time of writing, he had not liked anything other than news related to his ambassadorship for the NBA team, the Golden State Warriors, and the release of his and Mayzin‘s new song “Wheels Up” until now when he liked the Koreaboo article, announcing that reportedly GOT7 would make a full group comeback. Screenshot on April 22, 2022. | @BamBam1A/Twitter So, Ahgases are interpreting BamBam’s recent activities on Twitter as confirmation that the GOT7 comeback is indeed happening as reported. BAMBAM LIKED😭😭 SO IT’S CONFIRMED?!!?!😭😭 #GOT7 #GOT7FOREVER pic.twitter.com/pr2cl337uK — t 🐥💚 (@adorejayb) April 22, 2022  Likewise, BamBam recently posted a mirror selfie with fellow maknae Yugyeom in a dance practice room, tagging leader Jay B. This alone was clear that the members were preparing for the comeback choreography.  A post shared by BamBam (@bambam1a)  Jaebeom-hyung, come quickly — BamBam’s caption Stay updated with all news regarding GOT7 and their upcoming comeback below. Here Are 10+ Ahgase Reactions To GOT7’s Comeback News That Are Too Real 10 Of GOT7’s Song Lyrics That Will Tug At Your Heartstrings GOT7 Will Reportedly Make A Full Group Comeback In May GOT7’s Jinyoung And Jay B Reunite, Creating Many New Iconic Memes See more GOT7 "
        },
        "https://www.koreaboo.com/news/aespa-unreleased-english-song-lifes-too-short-coachella-debut/": {
            "title": "Aespa Unveils Brand New English Song, “Life’s Too Short,” Captivating The Crowd At Coachella Weekend Two",
            "content": "Highlighting the second weekend of Coachella 2022, as part of 88rising’s “Head in the Clouds Forever” showcase, K-Pop girl group aespa made their debut on the main stage Saturday, April 23. | Ivan Meneses/R&CPMK Captivating the crowd with live performances of their greatest hits like “Black Mamba” and “Next Level,” aespa wowed the audience! | Ivan Meneses/R&CPMK The best part of the girl group’s unforgettable Coachella debut, though, was when the members surprised their fans with a brand new never-heard-before track, “Life’s Too Short.” #aespa performs a new song for the #Coachella crowd! pic.twitter.com/9yIMiz1o8N — Ema Sasic (@ema_sasic) April 24, 2022  This next song is about staying true to yourself.Life’s too short for hate! — aespa The “English version” of the unreleased track, said to be on their upcoming album, had K-Pop fans ecstatic—especially with the lyrics that are, of course, on brand with aespa’s sexy, sassy, and savage vibe! | Ivan Meneses/R&CPMK I’m doing me regardless and I don’t care what you say about it.And it don’t matter if you like it or not, I’m having all this fun.So why would I ever stop? Some people are so mean, all behind a phone screen.But we tryna live our lives, why you gotta be so vicious?Just be about your business instead of getting up in mine.You need to get away, because life’s too short! — aespa’s “Life’s Too Short” ICYMI: 88rising’s Head in the Clouds Forever showcase, featuring aespa’s electrifying debut, can be streamed on the Coachella YouTube channel. Thank you Coachella ❤️‍🔥 Check out the live stream on YouTube Coachella LIVE Channel 1🔗https://t.co/rwTr12OC7g 24 Apr 2022 | 2:00PM (KST)23 Apr 2022 | 10:00PM (PDT) 📸 @ ai.visuals#aespa #æspa #에스파 #aespaCoachella pic.twitter.com/2qUMwG1NFQ — aespa (@aespa_official) April 24, 2022  Aespa Winter’s “Dreams Come True” After Finally Getting To Watch Harry Styles Perform Live Aespa Go Viral On Twitter For Their Effortless Visuals Prior To Their Coachella Performance A Fan Proposed To aespa’s Ningning And Her Members Turned Hilariously Protective Aespa’s NingNing Stuns With Her Blond Hair And Impeccable Street Fashion In Hollywood See more aespa "
        }
    }
}