{
    "web": {
        "https://korism.com/view/145770": {
            "title": "แบมแบมสาดความสุขจัดเต็มทั้ง3วัน สร้างความทรงจำสุดประทับใจ และเซอร์ไพรส์สุดซึ้งเสียน้ำตา",
            "content": "ผู้จัด GANADA Entertainment ส่งความสุขวันสงกรานต์จัดเต็มภายใต้มาตรการความปลอดภัย กับงาน “BamBam The 2nd PREMIUM LIVE “B” IN THAILAND” โดยหนุ่มแบมแบม กันต์พิมุกต์ เปิดโชว์ความสนุกอันร้อนแรงด้วยซิงเกิลใหม่ Wheels up ครั้งแรกในไทย! และ Ride or die ที่ช่วยเพิ่มอุณหภูมิความหล่ออีกขั้น  โดยมีพิธีกรคนสำคัญอย่าง แบงค์ ชินดนัย ภูวกุล ซึ่งเป็นพี่ชายของแบมแบมและพิธีกรมากความสามารถ เจริญ แซ่จู ที่มาร่วมพูดคุยและถามถึงความรู้สึกของการได้เป็นโกลบอล แอมบาสเดอร์ของทีมโกลเดน สเตท วอร์ริเออร์ส ทีมบาสเกตบอล ชื่อดังใน NBA และได้โชว์ช่วง HALF TIME ที่ประเทศอเมริกา   และก็มีเซอร์ไพรส์สุดพิเศษจากคุณแม่จุ๋ม กชกร ที่ได้มาร่วมกิจกรรมรดน้ำดำหัวทำให้บรรยากาศเต็มไปด้วยความซาบซึ้งถึงความรักระหว่างคุณแม่และหนุ่มแบมแบม จนทำให้หนุ่มแบมแบมเองก็กลั้นน้ำตาเอาไว้ไม่อยู่สร้างความประทับใจให้กับทุกคนในฮอลล์อย่างมาก  นอกจากนี้ยังมีกิจกรรมบนเวทีที่เปิดโอกาสให้แฟนๆ ผู้โชคดีร่วมเล่นเกมส์ต่างๆโดยหนุ่มแบมแบมเองก็ร่วมเล่นเกมส์ และคอยช่วยลุ้นอยู่ให้กำลังใจใกล้ๆ และยังมีอีกหนึ่งความพิเศษจากแบมแบมที่ได้เตรียมคลิปวิดีโอเบื้องหลังการซ้อม และความทุ่มเทในการเตรียมงานในครั้งนี้ที่ไม่เคยเห็นที่ไหนมาก่อน  พร้อมการขึ้นโชว์การร้องการเต้นอันพริ้วไหวในเพลง Who are you บนเวทีต่อหน้าแฟนเพลงชาวไทยเป็นครั้งแรกและกิจกรรมเต้น Tiktok Challenge ร่วมกับแฟนๆ ผู้โชคดีที่งานนี้หนุ่มแบมแบมก็ไม่พลาดที่จะสอนการเต้นให้กับผู้โชคดีอย่างเป็นกันเอง และใส่ใจทุกรายละเอียดทุกสเตป การเต้นเลยทีเดียว  ปิดท้ายโชว์ด้วยความสนุก แบมแบมและทีมแดนเซอร์ใส่เสื้อลายดอก เพื่อให้เข้าเทศกาลสงกรานต์ จัดเต็มแฟนๆ ทั้งเพลง Slow mo, riBBon, และ เพลงของวงGOT7 สลับสับเปลี่ยน แบบไม่ซ้ำกันทั้ง3วัน เรียกได้ว่าเต็มอิ่มครบรส ความสนุก ความสุข จากหนุ่มแบมแบม ที่คอยส่งความรักด้วยยิ้ม และทุกความใส่ใจมอบให้กับทุกคนที่เข้ามาร่วมสร้างความทรงจำอันน่าประทับใจในครั้งนี้ #2ndPREMIUMLIVE_B      "
        },
        "https://korism.com/view/145769": {
            "title": "แบมแบม ส่งคลิปพิเศษจากอเมริกา ทักทายแฟนคลับ พร้อมการันตีความสนุก",
            "content": "สงกรานต์นี้ ... แบมแบมเตรียมจัดงาน BamBam The 2nd PREMIUM LIVE “B” IN THAILAND เพื่อให้ชาวอากาเซ่ ได้ใช้เวลาแห่งสุขร่วมกันกับแบมแบม ในวันหยุดยาวช่วงสงกรานต์  โดยหนุ่ม แบมแบม ได้ส่งคลิปตรงจากอเมริกาเพื่อยืนยันความสนุก ความใหม่สุดพิเศษที่ขนเพลงมาแสดงให้แฟนๆได้หายคิดถึงกันอีกเพียบ!!! พร้อมเชิญชวนแฟนๆ มาเจอและร่วมเป็นส่วนหนึ่งของความสุขครั้งนี้ ในวันที่ 15,16,17 เมษายน 2565 เวลา 17:00 น. ที่ Bitec Hall 98-99 ไบเทค บางนา       ราคาบัตร: 5,900 / 4,900 / 3,900 / 2,900 บาท วันขายบัตร: เปิดขายบัตรแล้ววันนี้ (มีบัตรจำหน่ายที่หน้างาน) ช่องทางจำหน่ายบัตร: www.ganadaent.com  สอบถามรายละเอียดที่ https://www.facebook.com/GanadaEnt/ สามารถดูวิธีการซื้อบัตรได้ที่ลิงก์ > http://128.199.161.100/howtobuy_BamBamThe2ndPREMIUMLIVE.jpg    "
        },
        "https://korism.com/view/145374": {
            "title": "6 ลีดเดอร์ K-Pop ที่มีความเป็นผู้นำ น่าชื่นชมที่สุด",
            "content": "ตำแหน่งของผู้นำในวง นับว่าเป็นสิ่งสำคัญในอุตสาหกรรมไอดอลเคป็อป ในขณะที่หลายกลุ่มไม่เห็นด้วยกับแนวคิดนี้ แต่กลุ่มอื่นๆ ยังคงยึดค่านิยมดั้งเดิมของการมีผู้นำด้วยเหตุผลมากกว่าหนึ่งเหตุผล ผู้นำเหล่านี้มักจะเป็นหลักให้กับวง และมักมีบทบาทสำคัญในการพัฒนาด้านต่างๆ และความสัมพันธ์ของสมาชิกในวง นี่คือ 6 ไอดอลที่น่าชื่นชม ที่นำวงเคป๊อปที่โดดเด่นที่สุดบางส่วน ด้วยความสง่างามและแข็งแกร่ง!  RM จาก BTS ไอดอลคนแรกในรายการนี้ ต้องเป็น RM ลีดเดอร์ของ BTS อย่างแน่นอน จากจุดหนึ่งในอาชีพศิลปิน ได้ยืนหยัดอย่างภาคภูมิในฐานะทูตของประธานาธิบดี เสาหลักของศิลปะและวัฒนธรรมเกาหลี การเดินทางที่ไม่ธรรมดาเช่นนี้ คงเป็นไปไม่ได้หากไม่มี RM   Taeyong จาก NCT ไม่ใช่เรื่องง่ายที่จะเป็นผู้นำกลุ่ม K-Pop ที่ใหญ่ที่สุด ทั้งในแง่ของความสำเร็จและขนาดความรับผิดชอบที่ต้องจัดการ สิ่งเหล่านี้ Taeyong คือความภาคภูมิใจและมีความชื่นชมที่เขามีต่อสมาชิก ทำให้เขาเป็นผู้นำที่มีความสามารถและแข็งแกร่ง  Bang Chan จาก Stray Kids ประสบการณ์ การมองโลกในแง่ดี และความซื่อสัตย์ของเขาเป็นปัจจัยหลัก ที่ส่งผลต่อความเป็นผู้นำที่โดดเด่นของเขา เขาเป็นคนที่เสียสละตัวเอง ซึ่งเป็นเหตุผลว่าทำไมการเป็นผู้นำจึงเกิดขึ้นตามธรรมชาติของเขา  Jihyo จาก TWICE ตลอดอาชีพการงานอันโด่งดังของ TWICE ผู้นำอย่าง Jihyo เป็นแบบอย่างของการพึ่งพา ความอดทน ความรัก และความอบอุ่นสำหรับสมาชิกทุกคนในฐานะลีดเดอร์ ลักษณะการดูแลเอาใจใส่ และรูปแบบความเป็นผู้นำของเธอ โน้มเอียงไปทางผู้ปกครองมากกว่า ซึ่งเป็นเหตุผลว่าทำไมเธอถึงมีความน่าเชื่อถือ  Leeteuk จาก Super Junior หลังจากเดบิวต์ตั้งแต่อายุยังน้อย Leeteuk ในฐานะหัวหน้ากลุ่มทดลอง ก็ค่อยๆ เติบโตในตำแหน่งนี้ ปูทางสำหรับอนาคตของพวกเขาในวงการเคป๊อป ไม่ต้องสงสัยเลยว่าเพราะอะไร Leeteuk จึงเป็นหนึ่งในผู้นำที่ดีที่สุด ที่วงการเคป๊อปเคยเห็นมา  CL จาก 2NE1 เมื่อพูดถึง CL ในฐานะหัวหน้าวง 2NE1 เธอยังคงรักษาความสัมพันธ์ระหว่างสมาชิกในวง ไว้จนถึงทุกวันนี้ เพราะพวกเขาแข็งแกร่งในฐานะกลุ่ม ความรักของ CL ที่มีต่อ 2NE1 และ BLACKJACK นั้นไม่มีเงื่อนไขและไม่มีที่สิ้นสุด ขอบคุณภาพและข้อมูลจาก allkpop บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/145375": {
            "title": "ชาวเน็ตไม่พอใจ ผลการตัดสินตอนล่าสุดของ Street Woman Fighter",
            "content": "ในตอนล่าสุดของรายการแข่งขันเต้นยอดนิยม 'Street Woman Fighter' ทีม PROWDMON ถูกส่งกลับบ้าน  PROWDMON นำโดย Monika ได้รับการสนับสนุน และความรักจากผู้ชมและแฟน ๆ จากทั่วเกาหลีใต้ ด้วยความนิยมที่เพิ่มขึ้นของรายการ สมาชิกทีมเต้นอย่าง Monika ก็ได้รับความนิยมอย่างมากเช่นกัน นักเต้นเหล่านี้หลายคนได้รับความสนใจอย่างมากจากรูปลักษณ์และทักษะการเต้นของพวกเขา และสามารถขยายอาชีพของพวกเขาได้   PROWDMON เป็นหนึ่งในทีมเต้นที่แข็งแกร่งที่สุดในรายการ แต่ถูกทีมงานส่งกลับบ้าน นั่นทำให้แฟน ๆ และชาวเน็ตจำนวนมากประหลาดใจ จึงรวมตัวกันในชุมชนออนไลน์ ที่แจ้งข่าวการถูกตัดสิทธิ์ของ PROWDMON พร้อมกับการแสดงของทีมเต้นบางส่วน  ชาวเน็ตเข้าร่วมชุมชนออนไลน์เพื่อแสดงความผิดหวังและความโกรธที่พวกเขารู้สึกว่าจู่ ๆ นักเต้นถูกคัดออกจากรายการ ชาวเน็ตแสดงความเห็นว่า \"ฉันรู้สึกเหมือนถูกดึงฟันออก\" \"ทำไมพวกเขาไม่ปล่อยให้พวกเขาเต้นครั้งสุดท้ายเหมือนที่ทำกับทีมอื่น\"  “มันกะทันหันเกินไปจนไม่รู้จะพูดอะไรแล้ว\" บ้างก็ว่า \"นี่ไม่น่าแปลกใจเลยสักนิด ฉันจะเลิกดูมุกตลกนี้\" และหลายคนที่รู้สึกผิดหวัง กับผลการตัดสินดังกล่าว \"นึกว่า PROWDMON จะได้ที่ 1\" \"นี่เศร้าจัง\" \"ตกใจมากที่โดนไล่กลับบ้าน\" และ \"ยังไม่ถึงการแข่งแต้นเลย\"        ขอบคุณภาพและข้อมูลจาก Mnet TV และ allkpop บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/145765": {
            "title": "ฮยอนบิน ซนเยจิน เข้าประตูวิวาห์ สื่อเกาหลี ยกให้ เป็นงานแต่ง แห่งศตวรรษ",
            "content": "วันที่ 31 มีนาคม 2565 ผู้สื่อข่าวรายงานว่า ฮยอนบิน ซนเยจิน คู่รักนักแสดงขวัญใจจากซีรีส์เรื่องฮิต Crash Landing on You จะเข้าพิธีแต่งงาน ที่ โรงแรม แอสตัน เฮาส์ ออฟเดอะ วอล์คเกอร์ฮิลล์ ในจังหวัดคยองกี  จากนั้น Vast Entertainment ต้นสังกัดของฮยอนบิน ได้โพสต์ภาพงานแต่งงานของทั้งคู่พร้อมเขียนข้อความว่า ในวันนี้ ฮยอนบิน และซนเยจิน ได้เข้าพิธีแต่งงานกัน พร้อมทั้งเริ่มก้าวแรกในฐานะคู่รัก   พร้อมทั้งกล่าวขออภัยถึงพิธีการจัดงานครั้งนี้ โดยระบุว่า ในความจริง พิธีแต่งงานครั้งนี้ จัดขึ้นเป็นการส่วนตัวโดยคำนึงถึงสถานการณ์การแพร่ระบาดของโควิด-19  “ขอขอบคุณจากก้นบึ้งของหัวใจ สำหรับการแสดงความยินดีและการสนับสนุนที่อบอุ่น สำหรับทั้งสองคน ในการเริ่มต้นใหม่ ในอนาคตเราจะพยายามอย่างเต็มที่ เพื่อตอบแทนความรักที่ส่งมา”  หลังจากที่ภาพของทั้งคู่ออกมา แฟน ๆ ของทั้งคู่ต่างร่วมส่งข้อความให้กำลังผ่านทางทวิตเตอร์ และอินสตาแกรม ผ่านแฮชแท็ก #BinJinWedding#HyunBin #SonYeJin #ฮยอนบิน #ซนเยจิน อย่างล้นหลาม  ขณะที่สื่อเกาหลีรายงานถึงงานแต่งดังกล่าวว่า เป็นงานแต่งแห่งศตวรรษ เป็นที่จับตาไม่เฉพาะในเกาหลีเท่านั้น แต่ยังรวมถึงประเทศอื่น ๆ ด้วย มีรายงานว่า แม่ของดาราสาว ได้ซื้อของขวัญมูลค่า 12 ล้านวอน และมีการคาดการณ์ว่า จะใช้เงินราว ๆ พันล้านวอน หรือ 23.5 ล้านบาท        ขอบคุณภาพและข้อมูลจาก  allkpop  และ  vast.ent "
        },
        "https://korism.com/view/145649": {
            "title": "MAMAMOO เตรียมเปิดตัวภาพยนตร์สารคดี ของพวกเธอ",
            "content": "ตำแหน่งของผู้นำในวง นับว่าเป็นสิ่งสำคัญในอุตสาหกรรมไอดอลเคป็อป ในขณะที่หลายกลุ่มไม่เห็นด้วยกับแนวคิดนี้ แต่กลุ่มอื่นๆ ยังคงยึดค่านิยมดั้งเดิมของการมีผู้นำด้วยเหตุผลมากกว่าหนึ่งเหตุผล ผู้นำเหล่านี้มักจะเป็นหลักให้กับวง และมักมีบทบาทสำคัญในการพัฒนาด้านต่างๆ และความสัมพันธ์ของสมาชิกในวง นี่คือ 6 ไอดอลที่น่าชื่นชม ที่นำวงเคป๊อปที่โดดเด่นที่สุดบางส่วน ด้วยความสง่างามและแข็งแกร่ง!  RM จาก BTS ไอดอลคนแรกในรายการนี้ ต้องเป็น RM ลีดเดอร์ของ BTS อย่างแน่นอน จากจุดหนึ่งในอาชีพศิลปิน ได้ยืนหยัดอย่างภาคภูมิในฐานะทูตของประธานาธิบดี เสาหลักของศิลปะและวัฒนธรรมเกาหลี การเดินทางที่ไม่ธรรมดาเช่นนี้ คงเป็นไปไม่ได้หากไม่มี RM   Taeyong จาก NCT ไม่ใช่เรื่องง่ายที่จะเป็นผู้นำกลุ่ม K-Pop ที่ใหญ่ที่สุด ทั้งในแง่ของความสำเร็จและขนาดความรับผิดชอบที่ต้องจัดการ สิ่งเหล่านี้ Taeyong คือความภาคภูมิใจและมีความชื่นชมที่เขามีต่อสมาชิก ทำให้เขาเป็นผู้นำที่มีความสามารถและแข็งแกร่ง  Bang Chan จาก Stray Kids ประสบการณ์ การมองโลกในแง่ดี และความซื่อสัตย์ของเขาเป็นปัจจัยหลัก ที่ส่งผลต่อความเป็นผู้นำที่โดดเด่นของเขา เขาเป็นคนที่เสียสละตัวเอง ซึ่งเป็นเหตุผลว่าทำไมการเป็นผู้นำจึงเกิดขึ้นตามธรรมชาติของเขา  Jihyo จาก TWICE ตลอดอาชีพการงานอันโด่งดังของ TWICE ผู้นำอย่าง Jihyo เป็นแบบอย่างของการพึ่งพา ความอดทน ความรัก และความอบอุ่นสำหรับสมาชิกทุกคนในฐานะลีดเดอร์ ลักษณะการดูแลเอาใจใส่ และรูปแบบความเป็นผู้นำของเธอ โน้มเอียงไปทางผู้ปกครองมากกว่า ซึ่งเป็นเหตุผลว่าทำไมเธอถึงมีความน่าเชื่อถือ  Leeteuk จาก Super Junior หลังจากเดบิวต์ตั้งแต่อายุยังน้อย Leeteuk ในฐานะหัวหน้ากลุ่มทดลอง ก็ค่อยๆ เติบโตในตำแหน่งนี้ ปูทางสำหรับอนาคตของพวกเขาในวงการเคป๊อป ไม่ต้องสงสัยเลยว่าเพราะอะไร Leeteuk จึงเป็นหนึ่งในผู้นำที่ดีที่สุด ที่วงการเคป๊อปเคยเห็นมา  CL จาก 2NE1 เมื่อพูดถึง CL ในฐานะหัวหน้าวง 2NE1 เธอยังคงรักษาความสัมพันธ์ระหว่างสมาชิกในวง ไว้จนถึงทุกวันนี้ เพราะพวกเขาแข็งแกร่งในฐานะกลุ่ม ความรักของ CL ที่มีต่อ 2NE1 และ BLACKJACK นั้นไม่มีเงื่อนไขและไม่มีที่สิ้นสุด ขอบคุณภาพและข้อมูลจาก allkpop บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย เมื่อวันที่ 26 พฤศจิกายน CGV ซึ่งเป็นเครือข่ายโรงภาพยนตร์ที่ใหญ่ที่สุดของเกาหลี ประกาศอย่างเป็นทางการว่า MAMAMOO จะเปิดตัวภาพยนตร์ของพวกเธอในชื่อ “MAMAMOO 2021 WAW Concert: The Movie”  ภาพยนตร์นี้จะมีการแสดงจากคอนเสิร์ตออนไลน์ล่าสุดของ MAMAMOO “WAW” ซึ่งพวกเขาจัดขึ้นเมื่อ วันที่ 28 สิงหาคม 2564 เพื่อเฉลิมฉลองครบรอบ 7 ปี ของการเปิดตัวของพวกเขา รวมถึงฟุตเทจพิเศษเบื้องหลังการแสดง   นอกเหนือจากการบันทึกการแสดงสดเพลงฮิตของวง 25 เพลงแล้ว จะรวมฟุตเทจของสมาชิก MAMAMOO ที่เตรียมตัวสำหรับคอนเสิร์ตด้วย โดยภาพยนตร์นี้มีความยาว 102 นาที  โช จินโฮ หัวหน้าฝ่ายสร้างสรรค์เนื้อหาที่ CGV กล่าวว่า \"เราหวังว่าผู้ชมจะสามารถเพลิดเพลิน ไปกับประสบการณ์คอนเสิร์ตของ MAMAMOO ได้อย่างเต็มที่ ทั้งภาพและเสียงเต็มระบบในโรงภาพยนต์\"  CGV จะยังคงทำงานร่วมกับศิลปินมากมายและนำเสนอ ภาพยนตร์ อย่างต่อเนื่อง เพื่อให้ผู้ชมได้สัมผัสบรรยากาศที่น่าหลงใหลของคอนเสิร์ตที่โรงภาพยนตร์”  “MAMAMOO 2021 WAW Concert: The Movie” จะฉายรอบปฐมทัศน์ในวันที่ 3 ธันวาคม และจะฉายในโรงภาพยนตร์ 33 แห่งทั่วประเทศเกาหลีใต้       ขอบคุณภาพและข้อมูลจาก soompi และ mamamoo_official บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/145371": {
            "title": "แฟนๆ TWICE แชร์ข้อความให้กำลังใจ Tzuyu บน Twitter",
            "content": "เมื่อวันที่ 19 ตุลาคม TWICE คว้ารางวัล 'Best Concert Award' จากงาน '8th E-Daily Culture Awards'      ซึ่ง 8th E-Daily Culture Awards จัดขึ้นเมื่อวันที่ 19 ตุลาคม พ.ศ. 2564 และ TWICE แสดง \"Dance The Night Away\" ที่งานกาล่าคอนเสิร์ต กิจกรรมนี้และการแสดงของ TWICE ถูกถ่ายทอดสดทางช่อง YouTube 'E-Daily Friends'       น่าเสียดาย ในวันนี้ สมาชิกสองคนไม่สามารถเข้าร่วมได้ เนื่องจาก Jeongyeon อยู่ในช่วงพักงาน และ Tzuyu รู้สึกไม่ค่อยสบาย      ทั้ง Jeongyeon และ Tzuyu ไม่ได้เข้าร่วมงาน จึงทำให้แฟนๆ หลายคนที่ส่งข้อความให้กำลังใจสมาชิกทั้งสองคน ทางทวิตเตอร์ ผ่าน #GetWellSoonTzuyu กันเป็นจำนวนมาก         ขอบคุณภาพและข้อมูลจาก twicetagram และ allkpop บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/144038": {
            "title": "แทมิน SHINee กวาดชาร์ต iTunes ทั่วโลก กับอัลบั้มใหม่ Advice",
            "content": "แทมิน SHINee กำลังครองชาร์ต iTunes ไปทั่วทั้งโลก กับอัลบั้มใหม่ของเขา Advice      แทมิน ได้ปล่อยมินิอัลบั้มที่ 3 ของเขาในชื่อ Advice เมื่อเวลา 18.00 น. (เวลาเกาหลี) วันที่ 18 พฤษภาคมที่ผ่านมา ซึ่งอัลบั้มดังกล่าว ได้ครองชาร์ต iTunes ไป 41 ประเทศทั่วโลก โดยประกอบด้วย ประเทศ แคนาดา ฝรั่งเศส อาร์เจนตินา ออสเตรีย โบลิเวีย บราซิล ชิลี โคลอมเบีย เดนมาร์ก เอกวาดอร์ เอลซัลวาดอร์ ฟินแลนด์ อินโดนีเซีย ญี่ปุ่น คาซัคสถาน ลัตเวีย ลิทัวเนีย อินเดีย มาเลเซีย เม็กซิโก มองโกเลีย นอร์เวย์ เปรู ฟิลิปปินส์ โปแลนด์ โรมาเนีย รัสเซีย ซาอุดีอาระเบีย สิงคโปร์ สโลวาเกีย ศรีลังกา สวีเดน ไต้หวัน ไทย ตุรกี สหรัฐอาหรับเอมิเรตส์ เวียดนาม ฮ่องกง ไอร์แลนด์ ยูเครน และ บาห์เรน อัลบั้ม Advice ยังได่คว้า อันดับที่ 1 ในชาร์ตยอดขายอัลบั้มดิจิทัลของ QQ Music ซึ่งเป็นแพล็ตฟอร์มเพลงของประเทศจีน และ ชาร์ต Top 100 ของ Line Music ของประเทศญี่ปุ่นด้วย แทมิน ยังได้ติดท็อปชาร์ตเพลงในประเทศเช่น Hanteo Chart และ Synnara Record กับมินิอัลบั้มใหม่ของเขา ในขณะที่ เพลงไตเติลของเขาในเพลง Advice ยังได้ไต่อันดับท็อปในชาร์ตเพลง ประกอบด้วย VIBE และ Genie อีกด้วย อัลบั้ม Advice มีเพลงทั้งหมด 5 เพลง ประกอบด้วยเพลง Advice เพลง If I Could Tell You (featuring แทยอน Girls’ Generation) เพลง Light เพลง Strings และเพลง SAD KIDS       ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย  "
        },
        "https://korism.com/view/145646": {
            "title": "เปิดรายชื่อ ผู้ที่จะขึ้นแสดงในงาน MAMA 2021  เต็มรูปแบบ",
            "content": "งานประกาศรางวัล Mnet Asian Music Awards (MAMA) ปี 2021 ได้ประกาศรายชื่อ ผู้ที่จะขึ้นแสดงในงานทั้งหมดแล้ว  ซึ่งในงานดังกล่าว แฟนๆ จะได้ชมการแสดงของ aespa, ATEEZ, Brave Girls, ENHYPEN, INI, ITZY, JO1, Kep1er, NCT 127, NCT DREAM, Stray Kids และ TXT รวม 12 วง ที่จะจุดไฟให้กับเวที MAMA ปี 2021   CJ ENM เปิดเผยก่อนหน้านี้ว่า จะมีการแสดงพิเศษโดย Ed Sheeran, Wanna One, ทีมงาน “Street Woman Fighter” และการผสมผสานของสมาชิกกลุ่ม K-pop ชั้นนำรุ่นที่สี่  งาน MAMA ปี 2021 จะเป็นเจ้าภาพโดย Lee Hyori และจะมีขึ้นในวันที่ 11 ธันวาคม เวลา 18.00 น. ตามเวลาท้องถิ่นของประเทศเกาหลี  ซึ่งทุกท่านสามารถตรวจสอบรายชื่อผู้เข้าชิง ทั้งหมดในปีนี้ ได้ที่ >>โหวตกันได้แล้ว MAMA 2021 ประกาศรายชื่อผู้เข้าชิง ทั้งหมดในปีนี้       ขอบคุณภาพและข้อมูลจาก soompi และ naver บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/144708": {
            "title": "NCT 127 มาในรูปแบบ นักศึกษาวิทยาลัย ในวิดีโอคัมแบ็ค",
            "content": "NCT 127 ได้ปล่อยวิดีโอทีเซอร์แรกสำหรับการคัมแบ็คที่กำลังจะมาถึง  ในเดือนกรกฎาคม ทางวง ได้ประกาศว่าพวกเขากำลังวางแผนที่จะออกอัลบั้มเต็มในเดือนกันยายน สมาชิกเปิดตัวบัญชี Instagram ด้วยแนวคิด “NCIT” (Neo Culture Institute of Technology) ซึ่งบ่งบอกถึงแนวคิดของมหาวิทยาลัย/วิทยาลัยตาม MIT (สถาบันเทคโนโลยีแมสซาชูเซตส์)   เมื่อวันที่ 21 สิงหาคม ช่วงเที่ยงคืน ตามเวลาท้องถิ่นของประเทศเกาหลี NCT 127 ได้ปล่อยวิดีโอทีเซอร์ชื่อ “Who is STICKER”  วิดีโอเริ่มต้นด้วยสมาชิกในฐานะนักศึกษามหาวิทยาลัยทั่วไปที่ทำสิ่งต่างๆ เช่น เล่นเกม ทำงานที่ได้รับมอบหมายจากแล็ปท็อป ชงกาแฟ อ่านหนังสือ และถ่ายทำวิดีโอ กิจกรรมหลายอย่างมีลักษณะเป็น STEM (วิทยาศาสตร์ เทคโนโลยี วิศวกรรม และคณิตศาสตร์) เช่น การทำงานในห้องปฏิบัติการหรือการซ่อมแซมอุปกรณ์อิเล็กทรอนิกส์  เมื่อถึงครึ่งหลังหนุ่ม NCT 127 เปลี่ยนชุดอีกครั้ง คราวนี้เสื้อผ้าที่แหวกแนว ซึ่งแตกต่างจากชุด นักศึกษาวิทยาลัย แบบเดิม ๆ      ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/144036": {
            "title": "2PM คอนเฟิร์ม เตรียมตัวกลับมาทักทายแฟนๆ กับการคัมแบ็คครั้งใหม่ มิถุนายนนี้",
            "content": "2PM กำลังจะกลับมาทักทายแฟนๆ อีกครั้ง ในเดือนมิถุนายนนี้ หลังจากที่เมมเบอร์ชาวเกาหลี เสร็จสิ้นภารกิจจากกรมทหารกันครบทุกคนแล้ว      ก่อนหน้านี้ หนุ่มๆ 2PM ได้ประกาศว่า พวกเขากำลังเตรียมความพร้อมสำหรับการคัมแบ็ค แต่ช่วงเวลาของการปล่อยเพลงนั้น ยังไม่มีการเปิดเผย ในวันนี้ (18 พฤษภาคม 2021) JYP Entertainment ได้ระบุกับทาง Star News ว่า “2PM กำลังเตรียมตัวสำหรับการคัมแบ็คในช่วงสิ้นเดือนมิถุนายนนี้ เราจะประกาศวันที่แน่ชัดอีกครั้ง เมื่อมีการคอนเฟิร์ม” 2PM กำลังจะทำการคัมแบ็คเป็นครั้งแรก ในรอบเกือบ 5 ปี ตั้งแต่ที่ปล่อยอัลบั้มเต็มชุดที่ 6 อย่าง GENTLEMEN’S GAME ในเดือนกันยายน ปี 2016 เนื่องจากการปลดประจำการของ จุนโฮ เมื่อเดือนมีนาคมที่ผ่านมา ซึ่งเป็นเมมเบอร์ชาวเกาหลีคนสุดท้าย ได้เสร็จสิ้นการทำภารกิจชายชาติเกาหลีใต้ เข้ากรมทหารรับใช้ชาติ       ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย  "
        },
        "https://korism.com/view/144717": {
            "title": "จัดอันดับ สมาชิกเกิร์ลกรุ๊ป K-Pop ยอดนิยม ประจำเดือนสิงหาคม",
            "content": "สถาบันวิจัยธุรกิจแห่งเกาหลีได้เปิดเผยการจัดอันดับชื่อเสียงสำหรับสมาชิกเกิร์ลกรุ๊ปแต่ละคน โดยใช้ข้อมูลขนาดใหญ่ที่รวบรวมตั้งแต่วันที่ 22 กรกฎาคมถึง 22 สิงหาคม      เจนนี่ วง BLACKPINK ขึ้นอันดับหนึ่งของรายการในเดือนนี้ เพิ่มขึ้น 3.68% จากเดือนกรกฎาคม       จีซู วง BLACKPINK ปีนขึ้นไปเป็นอันดับสองในการจัดอันดับด้วย 2,775,397 คะแนน เพิ่มขึ้น 31.92% ในคะแนนของเธอตั้งแต่เดือนที่แล้ว      และลำดับที่ 3  จอย Red Velvet ก็ตามมาด้วย 2,572,534 คะแนน ในเดือนสิงหาคม ตรวจสอบ 30 อันดับแรกสำหรับเดือนนี้ด้านล่าง 1.        BLACKPINK’s Jennie 2.        BLACKPINK’s Jisoo 3.        Red Velvet’s Joy 4.        aespa’s Karina 5.        Red Velvet’s Irene 6.        aespa’s Winter 7.        Red Velvet’s Wendy 8.        Girls’ Generation’s Taeyeon 9.        Girls’ Generation’s YoonA 10.     MAMAMOO’s Solar      11.     aespa’s Giselle 12.     BLACKPINK’s Rosé 13.     Red Velvet’s Yeri 14.     Oh My Girl’s Arin 15.     Brave Girls’ Yujeong 16.     TWICE’s Nayeon 17.     Red Velvet’s Seulgi 18.     TWICE’s Jeongyeon 19.     Girls’ Generation’s Sooyoung 20.     Apink’s Son Naeun      21.     TWICE’s Mina 22.     Girls’ Generation’s Hyoyeon 23.     Girls’ Generation’s Yuri 24.     LOONA’s Chuu 25.     aespa’s Ningning 26.     Brave Girls’ Yuna 27.     Girl’s Day’s Hyeri 28.     Girls’ Generation’s Seohyun 29.     Oh My Girl’s YooA 30.     MAMAMOO’s Hwasa ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/143948": {
            "title": "ยุนจีซอง คอมเฟิร์ม จะเดบิวท์ สายงานนักแสดง ในละครโรแมนติกเรื่องใหม่",
            "content": "ยุนจีซอง กำลังเดินหน้า ทักทายแฟนๆ กับการเดบิวท์ลงจอแก้ว ด้วยผลงานละครแนวโรแมนติกเรื่องใหม่      เมื่อวันที่ 13 เมษายนที่ผ่านมา ต้นสังกัดของ ยุนจีซอง อย่าง LM Entertainment ได้ประกาศอย่างเป็นทางการแล้วว่า “ยุนจีซอง ได้ยืนยันที่จะปรากฏตัวในละครเรื่อง I Will Become Your Night (จากชื่อเรื่องภาษาเกาหลี) ซึ่งมีกำหนดออกอากาศในช่วงครึ่งหลังของปี 2021” ละครเรื่อง I Will Become Your Night เป็นละครแนวโรแมนติกที่กำลังจะมาเร็วๆ นี้ เป็นเรื่องเกี่ยวกับ ไอดอลที่ป่วยเป็นโรคละเมอ และหมอปลอม ที่ย้ายเข้ามาในหอพักของวง เพื่อแอบรักษาไอดอลที่เดินละเมอ ยุนจีซอง จะรับบทเป็น คิมยูชาน ซึ่งเป็นมือกลองของวงไอดอล ที่เคยเดบิวท์ในฐานะนักแสดงเด็กในตอนอายุ 7 ปี แม้ว่าเขาจะเคยได้รับสมญานามว่า “ลูกชายแห่งชาติ” แต่ในไม่ช้า เขาก็ถูกลืม และในที่สุด เขาก็กลับมาเป็นมือกลองอีกครั้ง หลังจากผ่านการฝึกฝนเพื่อเป็นไอดอล ในขณะที่ คิมยูชาน มักจะยิ้มอย่างร่าเริง และดูเหมือนจะไม่มีใครเทียบได้ในความทะเยอทะยานของเขา แต่เขาก็แอบมีจิตวิญญาณที่โดดเดี่ยว และมีแผลเป็นทางอารมณ์ซ่อนอยู่ แม้ว่า ยุนจีซอง จะเคยโชว์ทักษะการแสดงในละครเพลงมิวสิคคัลมาก่อน แต่ละครเรื่อง I Will Become Your Night จะเป็นบทบาทการแสดงครั้งแรกของเขาในการแสดงละคร ในตอนนี้ นักร้องหนุ่ม กำลังเตรียมตัวสำหรับการคัมแบ็คของเขาในวันที่ 15 เมษายนนี้ กับมินิอัลบั้มชุดที่ 2 ของเขา ในชื่อว่า Temperature of Love แฟนๆ ห้ามพลาดจ้า       ขอบคุณข้อมูลจาก soompi  บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/143949": {
            "title": "SM พูดแล้ว หลังมีภาพ ทีมงานชาย ทำพฤติกรรมไม่เหมาะสม ต่อ วินเทอร์ aespa",
            "content": "SM Entertainment ได้ออกมาแถลงอย่างเป็นทางการแล้ว เกี่ยวกับความกังวลของแฟนๆ เรื่องคลิปวิดีโอล่าสุดของ วินเทอร์ aespa      เมื่อวันที่ 14 เมษายนที่ผ่านมา แฟนๆ บางส่วนได้สังเกตเห็นว่า ในคลิปเบื้องหลังการถ่ายภาพนิตยสารของ aespa ล่าสุด มีชายหนุ่มปรากฏตัวขึ้น ในขณะที่กำลังถ่ายรูปของ วินเทอร์ aespa โดยที่เธอนั้นไม่รู้ตัว ในวิดีโอ ได้เผยให้เห็นชายหนุ่มรายหนึ่ง ที่กำลังใช้โทรศัพท์ของเขา ก่อนที่จะเดินไปด้านหลังของ วินเทอร์ และหยุดยืนอยู่ในช่วงเวลาสั้นๆ ใกล้ๆ เธอ และแฟนๆ ยืนกรานเลยว่า จะเห็นได้เลยว่า เขาเปิดแอปกล้องจากโทรศัพท์ของเขาไว้ล่วงหน้า ต่อมาในวันนั้น ทาง SM Entertainment ได้ออกมาชี้แจงสถานการณ์ดังกล่าวแล้ว โดยบอกว่า “บุคคลที่ปรากฏในคลิปนั้น คือ ตากล้อง ที่มีหน้าที่ถ่ายภาพ และเราขอยืนยันว่า เขาไม่ได้ทำอะไรที่ก่อให้เกิดความเข้าใจผิด” ทางต้นสังกัดยังได้บอกอีกว่า “วินเทอร์ ก็สนุกกับการโพสท่าถ่ายภาพในตอนนั้น และเธอบอกว่า ไม่มีอะไรที่ทำให้อารมณ์เสีย หรือสถานการณ์อะไร ที่อาจจะทำให้เข้าใจผิดในกองถ่ายได้ เรารู้สึกขอบคุณที่แฟนๆ ได้แสดงความเป็นห่วงเธอ และเราหวังว่า จะไม่มีการเข้าใจผิดใดๆ เกิดขึ้นอีก” โดยเหตุการณ์ในคลิปที่กลายเป็นประเด็นดังกล่าว แฟนๆ สามารถรับชมได้ ในคลิปด้านล่าง กับนาทีที่ 8.56 เป็นต้นไป       ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย  "
        },
        "https://korism.com/view/145046": {
            "title": "YoonA และ Kim Seon Ho แสดงร่วมกัน ในภาพยนตร์เรื่องใหม่",
            "content": "YoonA และ Kim Seon Ho นำแสดงในโปรเจ็กต์ใหม่ด้วยกัน  เมื่อวันที่ 13 กันยายน มีการประกาศว่า นักแสดงทั้งสองจะแสดงในภาพยนตร์เรื่องใหม่ “2 O’Clock Date” (ชื่ออย่างไม่เป็นทางการ)   “2 O’Clock Date” เป็นละครโรแมนติกคอมมาดี้เกี่ยวกับผู้หญิง ที่มีความลับสุดยอด และผู้ชายที่อาศัยอยู่ชั้นบน หนังโรแมนติดติดตามเรื่องราวของสิ่งที่เกิดขึ้น เมื่อทั้งสองเพื่อนบ้านพบกันทุกวัน  แม้ว่า YoonA และ Kim Seon Ho จะพบกันในฐานะพิธีกรร่วมของงาน “2020 MBC Music Festival” นี่จะเป็นครั้งแรกที่พวกเขาได้แสดงร่วมกัน  “2 O’Clock Date” จะกำกับโดยอีซังกึน ซึ่งเคยกำกับภาพยนตร์ฮิตของ YoonA เรื่อง “EXIT” มีกำหนดเริ่มถ่ายทำในเดือนมีนาคม 2022        ขอบคุณข้อมูลจาก soompi ขอบคุณภาพจาก yoona__lim และ seonho__kim แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความด้วย "
        },
        "https://korism.com/view/144707": {
            "title": "บ๊อบบี้ iKON ประกาศการแต่งงาน และแจ้งเรื่องคู่หมั้นตั้งครรภ์",
            "content": "เมื่อวันที่ 20 สิงหาคม Bobby ได้โพสต์ข้อความบน Instagram ของเขาพร้อมจดหมายที่เขียนด้วยลายมือถึงแฟนๆ ซึ่งข้อความในจดหมายมีดังนี้:      “สวัสดีครับ ผม บ็อบบี้ iKON ครับ ผมมีบางอย่างที่อยากจะบอกกับทุกคนในวันนี้ เลยกำลังเขียนข้อความนี้ หลังจากที่คิดมาเยอะมาก ผมได้ให้คำสัญญาว่าจะแต่งงานกับใครบางคนที่ผมรัก และผมกำลังจะกลายเป็นคุณพ่อ ในเดือนกันยายนนี้ด้วย       ผมมีความสุขมากที่กำลังจะสร้างครอบครัวใหม่ แต่ผมก็รู้สึกขอโทษแฟน ๆ ที่อาจตกใจจากข่าวนี้ของผม ผมควรที่จะต้องบอกทุกคนให้เร็วกว่านี้ แต่เพราะผมกังวลเกี่ยวกับเรื่องนี้ เลยมาแจ้งให้ทุกคนทราบช้า ต้องขอโทษนะครับ      ผมรู้สึกถึงความรับผิดชอบอันหนักอึ้ง เพราะผมรู้สึกเหมือนว่าผมได้สร้างความหนักใจ ให้กับคนที่คอยช่วยเหลือและให้การสนับสนุนผมที่ยังบกพร่องอยู่มากมายในหลาย ๆ ด้าน ผมขอโทษด้วยหัวใจทั้งหมดของผมต่อทุกคนที่เจ็บปวด หรือสับสนกับเรื่องของผมด้วย      ผมจะเป็นคนที่ไม่สร้างความอับอายให้กับพ่อแม่ของผม สมาชิก iKON รวมไปถึงแฟน ๆ ที่ช่วยทำให้คนไม่มีตัวตนอย่างผม กลายเป็น คนที่เป็นที่ต้องการในโลกใบนี้      เหนือสิ่งอื่นใด ผมจะทำงานให้หนักขึ้นเพื่อที่จะไม่ให้กระทบต่อเมมเบอร์ และแฟน ๆ ที่รอคอยสำหรับการทำกิจกรรมของ iKON” ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/144176": {
            "title": "สาวๆ aespa ขอบคุณ ITZY ที่ให้กำลังใจ เบื้องหลัง Dream Concert",
            "content": "ITZY ทำเซอร์ไพรส์ aespa ในเบื้องหลัง Dream Concert ปีนี้  เมื่อวันที่ 26 มิถุนายน สาวๆ ทั้ง 2 วง ได้ขึ้นแสดงที่ Dream Concert ปี 2021 และต่อมา aespa ได้โพสต์บน Twitter เพื่อเปิดเผยว่า ITZY ได้ให้กำลังใจรุ่นน้องอย่างน่ารัก       aespa เล่าว่าในที่สุดพวกเขาก็ได้พบกับ ITZY ในคอนเสิร์ตในวันนั้น และ ITZY ได้ฉลองโอกาสนี้ ด้วยการดื่มเครื่องดื่มรสอร่อยให้      พวกเขา โพสต์ภาพของตัวเองพร้อมกับเครื่องดื่มที่ ITZY ซื้อให้ asepa ได้โพสต์ผ่านทวิตเตอรNว่า “ขอบคุณนะ ITZY~!! เราดีใจมากที่ในที่สุดเราก็ได้พบคุณที่ Dream Concert วันนี้!! ขอบคุณมากที่ซื้อเครื่องดื่มให้เรา”      นับว่าเป็นจุดเริ่มต้น ของมิตรภาพอันสวยงามของสาวๆ สองกลุ่มนี้       ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย  "
        },
        "https://korism.com/view/145555": {
            "title": "โหวตกันได้แล้ว MAMA 2021  ประกาศรายชื่อผู้เข้าชิง ทั้งหมดในปีนี้",
            "content": "ละครเรื่องใหม่ “Now We Are Breaking Up” ทางช่อง SBS ได้แชร์ตัวอย่างตัวละครของซงฮเยคโย ในสมัยเรียนของเธอ  “Now We Are Breaking Up” เป็นละครโรแมนติก เกี่ยวกับความรักและการเลิกรา รวมถึงเบื้องหลังของอุตสาหกรรมแฟชั่น ซงฮเยคโย รับบทเป็น ฮายองอึน นักออกแบบแฟชั่นที่จริงจัง   ในขณะที่จางกียง แสดงเป็น ยุนแจกุก ช่างภาพอิสระอัจฉริยะที่เปลี่ยนความคิดของเธอเกี่ยวกับความรัก  ภาพนิ่งที่เพิ่งเปิดตัวใหม่ จากละครที่กำลังจะฉาย เผยให้เห็นฮายองอึน ก่อนที่เธอจะกลายเป็นนักออกแบบแฟชั่นที่มีเสน่ห์ ฮายองอึนแต่งตัวสบายๆ สบายๆ โดยผมของเธอรวบกลับด้วยมวยผมยุ่งๆ ทำให้ฮายองอึนดูแตกต่างไปจากเดิมอย่างสิ้นเชิง ในฐานะนักเรียนที่กำลังศึกษาอยู่ต่างประเทศ  อย่างไรก็ตาม ตรงกันข้ามกับรูปลักษณ์ที่ดูเงียบๆของเธอ กลับมีแววตาที่ดุร้ายในดวงตาของฮายองอึน ขณะที่เธอเดินไปตามถนนพร้อมกับแขนที่เต็มไปด้วยถุงช้อปปิ้ง การใช้สายตาและท่าทางของเธอ บ่งบอกถึงความหลงใหล และความมุ่งมั่นของเธอในการบรรลุความฝันสูงสุดในการเป็นนักออกแบบแฟชั่น  “Now We Are Breaking Up” จะออกอากาศตอนแรกในวันที่ 12 พฤศจิกายน เวลา 22:00 น. ตามเวลาท้องถิ่นของประเทศเกาหลี       ขอบคุณภาพและข้อมูลจาก nowwearebreakingup_official naver และ soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย เมื่อวันที่ 3 พฤศจิกายน 2021 งานประกาศรางวัล Mnet Asian Music Awards (MAMA) ปี 2021 ได้ประกาศรายชื่อผู้ได้รับการเสนอชื่อเข้าชิงในปีนี้อย่างเป็นทางการ ซึ่งมีกำหนดจัดขึ้นในวันที่ 11 ธันวาคม เวลา 18.00 น. ตามเวลาท้องถิ่นของประเทศเกาหลี  มีการเปลี่ยนแปลงเกณฑ์การพิจารณารางวัลในปีนี้หลายประการ ต่างจากปีก่อนๆ  โดยเกณฑ์สำหรับผู้ชนะมีดังนี้: Artist of the Year และ Artist Category Awards คะแนนมาจาก การประเมินของผู้ตัดสิน 40%, ประสิทธิภาพดิจิทัล 20%, ยอดขายอัลบั้ม 20%, มิวสิควิดีโอ 10%, แพลตฟอร์มเพลงทั่วโลก 10% รางวัลประเภทเพลงแห่งปีและประเภทเพลง  คะแนนมาจาก การประเมินของผู้ตัดสิน 40%, ประสิทธิภาพดิจิทัล 30%, ยอดขายอัลบั้มจริง 10%, มิวสิกวิดีโอ 10%, แพลตฟอร์มเพลงทั่วโลก 10% อัลบั้มแห่งปี คะแนนมาจาก การประเมินของผู้ตัดสิน 40%, ประสิทธิภาพดิจิทัล 10%, ยอดขายอัลบั้มจริง 40%, แพลตฟอร์มเพลงทั่วโลก 10% Worldwide Icon of the Year, Worldwide Fans’ Choice Top 10 คะแนนมาจาก 100% คะแนนโหวตอย่างเป็นทางการ การลงคะแนนจะมีขึ้นทางออนไลน์ เริ่มตั้งแต่วันที่ 4 พฤศจิกายน เวลา 18.00 น. และสิ้นสุดในวันที่ 22 พฤศจิกายน เวลา 16:59 น. ตามเวลาท้องถิ่นของประเทศเกาหลี   ผู้เสนอชื่อสำหรับรางวัลในปีนี้มีดังนี้: Best New Male Artist Best New Female Artist  Best Male Artist Best Female Artist Best Male Group Best Female Group  Best Dance Performance Male Group Best Dance Performance Female Group  Best Dance Performance Solo Best Vocal Performance Best Band Performance Best Hip Hop & Urban Music Best OST Best Collaboration Worldwide Fans’ Choice Top 10 (G)I-DLE aespa AKMU ASH ISLAND ASTRO ATEEZ Brave Girls BTS Chungha CL Davichi ENHYPEN EXO fromis_9 Heize HyunA iKON ITZY IU Jannabi Jessi Kang Daniel Lee Mujin Lee Seung Gi BLACKPINK’s Lisa  LOONA MAMAMOO WINNER’s Song Mino MONSTA X NCT 127 NCT DREAM NU’EST Oh My Girl Rain Red Velvet  BLACKPINK’s Rosé SEVENTEEN SF9 SHINee Jeon Somi STAYC Stray Kids Sunmi Super Junior Girls’ Generation’s Taeyeon THE BOYZ TXT TREASURE TWICE Weeekly ขอบคุณภาพและข้อมูลจาก @MnetMAMA และ soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/145554": {
            "title": "ซงฮเยคโย กับบทนักเรียนนอก ใน Now We Are Breaking Up",
            "content": "ละครเรื่องใหม่ “Now We Are Breaking Up” ทางช่อง SBS ได้แชร์ตัวอย่างตัวละครของซงฮเยคโย ในสมัยเรียนของเธอ  “Now We Are Breaking Up” เป็นละครโรแมนติก เกี่ยวกับความรักและการเลิกรา รวมถึงเบื้องหลังของอุตสาหกรรมแฟชั่น ซงฮเยคโย รับบทเป็น ฮายองอึน นักออกแบบแฟชั่นที่จริงจัง   ในขณะที่จางกียง แสดงเป็น ยุนแจกุก ช่างภาพอิสระอัจฉริยะที่เปลี่ยนความคิดของเธอเกี่ยวกับความรัก  ภาพนิ่งที่เพิ่งเปิดตัวใหม่ จากละครที่กำลังจะฉาย เผยให้เห็นฮายองอึน ก่อนที่เธอจะกลายเป็นนักออกแบบแฟชั่นที่มีเสน่ห์ ฮายองอึนแต่งตัวสบายๆ สบายๆ โดยผมของเธอรวบกลับด้วยมวยผมยุ่งๆ ทำให้ฮายองอึนดูแตกต่างไปจากเดิมอย่างสิ้นเชิง ในฐานะนักเรียนที่กำลังศึกษาอยู่ต่างประเทศ  อย่างไรก็ตาม ตรงกันข้ามกับรูปลักษณ์ที่ดูเงียบๆของเธอ กลับมีแววตาที่ดุร้ายในดวงตาของฮายองอึน ขณะที่เธอเดินไปตามถนนพร้อมกับแขนที่เต็มไปด้วยถุงช้อปปิ้ง การใช้สายตาและท่าทางของเธอ บ่งบอกถึงความหลงใหล และความมุ่งมั่นของเธอในการบรรลุความฝันสูงสุดในการเป็นนักออกแบบแฟชั่น  “Now We Are Breaking Up” จะออกอากาศตอนแรกในวันที่ 12 พฤศจิกายน เวลา 22:00 น. ตามเวลาท้องถิ่นของประเทศเกาหลี       ขอบคุณภาพและข้อมูลจาก nowwearebreakingup_official naver และ soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/145262": {
            "title": "Sandara Park เปิดใจ เกี่ยวกับการเริ่มต้นใหม่ หลังออกจาก YG",
            "content": "ในการให้สัมภาษณ์และถ่ายภาพกับนิตยสาร Dazed Korea เมื่อเร็วๆ นี้ Sandara Park ได้พูดถึงแผนการในอนาคตของเธอและ ประเด็นที่น่าสนใจอีกมากมาย  เมื่อถูกถามว่า เธอช่วงนี้เธอเป็นอย่างไรบ้าง Sandara Park ตอบว่า “ฉันเป็นคนที่ไม่ค่อยจะมีงานมากนัก หลังจากเกิดโรคระบาด ฉันรู้สึกซาบซึ้งจริงๆ สำหรับเรื่องนี้ แต่ก็มากจนบางครั้ง ฉันคิดว่าชอยากพักผ่อนบ้าง”   เธอกล่าวต่อว่า “Celeb Beauty ได้จบลงแล้ว และ Video Star จะสิ้นสุดในสัปดาห์หน้า ดังนั้นฉันจึงเหลืออีกสองโปรแกรม ยิ่งไปกว่านั้น ฉันยังมีงานพิธีกร และมีรายการวิทยุ ฉันมักจะมีเวลาพักผ่อนเพียงวันเดียวในวันอาทิตย์”  เมื่อต้นปีนี้ Sandara Park แยกทางกับ YG Entertainment ต้นสังกัดเก่าแก่ของเธอ หลังจาก 17 ปี จากนั้นเธอก็เข้าร่วมบริษัท Abyss Company ในฤดูใบไม้ร่วงนี้ และกลายเป็นเพื่อนร่วมค่ายกับซอนมี และแบมแบม GOT7  ในตอนแรกเธอกังวลเกี่ยวกับการเริ่มต้นใหม่ในบริษัทใหม่ แต่ก็มีความสุขที่ได้เปิดเผยว่า ความกังวลของเธอนั้นหมดไปแล้ว  “ฉันรู้สึกประหม่าเกี่ยวกับการเริ่มต้นใหม่ แต่ศิลปิน ทีมงาน และซีอีโอของเอเจนซี่ใหม่ของฉัน ได้ให้การต้อนรับและช่วยเหลืออย่างเต็มที่ แฟนๆ ของฉันก็ส่งดอกไม้ไปที่สำนักงานของ Abyss Company ด้วย ดังนั้นฉันใช้เวลาทั้งวันอย่างมีความสุข ฉันไม่พบสถานที่ใหม่ที่ไม่คุ้นเคยอีกต่อไป”  Sandara Park ยังพูดถึงการกลับมาที่ช่อง YouTube ของเธออีกครั้งหลังจากถูกระงับไปหลายเดือน “หลังจากที่สัญญากับเอเจนซี่เก่าของฉันหมดลง ฉันต้องการเวลาจัดระเบียบใหม่ และเนื่องจากบรรณาธิการของฉันต้องลาออกเมื่อปีที่แล้ว เนื่องจากสถานการณ์ส่วนตัว ฉันจึงหยุดชั่วคราว แต่ตอนนี้ฉันกำลังทำช่องอีกครั้ง ฉันได้พบกับทีม Abyss YouTube และความหลงใหลของพวกเขานั้นยอดเยี่ยมมาก และฉันวางแผนที่จะทักทายแฟนๆ อีกครั้งผ่านวิดีโอของฉัน”  สุดท้าย Sandara Park เล่าว่าขณะนี้เธอกำลังเตรียมการคัมแบ็ค ในฐานะนักร้องที่รอคอยมานาน “ฉันได้ทำงานหลากหลายแขนง แต่ก็ไม่ง่ายเลยที่จะหาโอกาสที่จะแสดงตัวเอง ในฐานะนักร้องแซนดารา ตอนนี้ ฉันตัดสินใจ ที่จะโฟกัสกับการทำอัลบั้มใหม่ ฉันต้องการกลับมา พร้อมกับเพลงใหม่ และรวมถึงการแสดงและแฟชั่นใหม่อีกด้วย”       ขอบคุณข้อมูลจาก Soompi ขอบคุณภาพจาก daraxxi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/145263": {
            "title": "สาวๆ aespa ได้รับเลือกให้เป็น พรีเซ็นเตอร์ KB Kookmin Bank",
            "content": "เป็นครั้งแรกนับตั้งแต่เดบิวต์ สมาชิกทั้ง 8 คนของ aespa ได้รับเลือกให้เป็นพรีเซ็นเตอร์ ให้กับแบรนด์เชิงพาณิชย์!  เมื่อวันที่ 30 กันยายน KB Kookmin Bank ได้เปิดตัวภาพยนตร์ทีเซอร์เรื่องแรก สำหรับการร่วมงานกับสาวๆ ของ aespa   เนื้อหาที่โปรโมทนี้ เกี่ยวกับการเล่าเรื่องที่สาวๆ ของ aespa เชิญผู้ใช้ KB Kookmin Bank เข้าสู่โลกของ \"æ\"  สมาชิก aespa ทั้ง 8 คนจะทำหน้าที่เป็นต้นแบบ สำหรับแอปชำระเงินมือถือ 'Liiv M' ของ KB Kookmin Bank สามารถเข้าร่วมในโปรโมชั่นต่างๆ ได้ เนื่องจาก KB เปิดตัวภาพลักษณ์ใหม่ ของแบรนด์ที่มุ่งสู่อนาคต        ขอบคุณภาพและข้อมูลจาก allkpop และ KB Kookmin Bank บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        },
        "https://korism.com/view/143947": {
            "title": "BTS เป็นศิลปินกลุ่มแรกที่ติด #1 ในชาร์ต ยอดขายดิจิทัลระดับโลก ของ Billboard ไป 27 เพลง",
            "content": "BTS ได้สร้างประวัติศาสตร์ในชาร์ตของ Billboard อีกครั้ง กับเพลงที่เพิ่งปล่อยออกมาล่าสุดของพวกเขา!      สำหรับสัปดาห์ที่กำลังจะจบลงในวันที่ 17 เมษายนนี้ เพลงญี่ปุ่นเพลงใหม่ของหนุ่มๆ BTS อย่างเพลง Film Out ได้เดบิวท์ในชาร์ตเพลง Hot 100 ของ Billboard แล้ว ในอันดับที่ 81 ทำให้เพลงดังกล่าว เป็นเพลงญี่ปุ่น เพลงแรกของหนุ่มๆ BTS ที่ได้เข้าชาร์ต เพลง Film Out ยังได้เดบิวท์ในอันดับที่ 1 ทั้งในชาร์ต Digital Song Sales และชาร์ต World Digital Song Sales ของ Billboard ด้วย ซึ่งเพลงนี้ กลายเป็นเพลงที่ 27 ของหนุ่มๆ ที่ได้อันดับที่ 1 ในชาร์ตนี้ ด้วยความสำเร็จครั้งล่าสุดของหนุ่มๆ ในตอนนี้ หนุ่มๆ BTS ได้เป็นศิลปินกลุ่มแรกอย่างเป็นทางการ ที่ได้คว้าอันดับที่ 1 ในชาร์ต World Digital Song Sales ไปทั้งหมด 27 เพลง ซึ่งได้ทุบสถิติของตัวเองด้วยอันดับ 1 มากที่สุดในชาร์ตโดยศิลปินทุกคน เพลง Film Out เป็นเพลงที่ จองกุก ได้มีส่วนร่วมในการเรียบเรียง จะเป็นส่วนหนึ่งของอัลบั้มรวมเพลงญี่ปุ่นของหนุ่มๆ BTS ที่กำลังจะมีขึ้น ในชื่ออัลบั้ม  BTS, The Best โดยจะปล่อยออกมาในวันที่ 16 มิถุนายนนี้       ขอบคุณข้อมูลจาก soompi บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย  "
        },
        "https://korism.com/view/145553": {
            "title": "ชาวเน็ตโต้เถียงกันอย่างดุเดือดเกี่ยวกับพฤติกรรมของ Huening Bahiyyih ใน V Live แรกของ Kep1er",
            "content": "Huening Bahiyyih เป็นหนึ่งในสมาชิกของ Kep1er ที่ถูกจับตามองมากเป็นพิเศษ นับตั้งแต่มีการประกาศผลการแข่งขันอย่างเป็นทางการ ว่าเธอมีคะแนนมากเป็นอันดับ 2 ของรายการ และมีข่าวเกี่ยวกับความเหมาะสมในตำแหน่งที่เธอได้มาตลอด  ในระหว่าง V Live สมาชิก Kep1er จะได้รับแท็บเล็ต 2เครื่อง เพื่อให้เกิร์ลสาวๆ สามารถอ่านความคิดเห็นของแฟนๆ ได้ ขณะที่สมาชิกคนอื่นๆ รวมตัวกันที่แท็บเล็ต ผู้ชมสังเกตเห็น Huening Bahiyyih โฉบไปมาโดยไม่เห็นแท็บเล็ต   จากเหตุการณ์ดังกล่าว ทำให้ชาวเน็ต สร้างโพสต์บนโลกออนไลน์ อ้างว่า สมาชิกคนอื่นๆ ทิ้ง Huening Bahiyyih พร้อมระบุ  \" ทำไมพวกเขาถึงทำแบบนั้นกับเธอล่ะ?\"  อย่างไรก็ตาม มีชาวเน็ตบางคน ที่คิดต่างเกี่ยวกับสถานการณ์นี้ โดยให้ความคิดเห็นว่า “คุณไม่ควรทำให้ดูเหมือน Huening Bahiyyih ถูกสมาชิกคนอื่นๆ ทิ้ง  แม้ว่าปฏิกิริยาจาก Mnet จะไม่ดี เธอก็ไม่ควรทำอย่างนั้น แบบนั้น เธอเฉยเมยมาก ตลอดการออกอากาศ  และในช่วงเวลาที่สมาชิกอ่านคอมเมนต์นั้น ขนาดยูจินที่อายุมากที่สุดและมีประสบการณ์มากที่สุด ยังพยายามมีส่วนร่วม และพยายามอ่านความคิดเห็น แต่เธอกลับนั่งอยู่กับที่ อย่าพูดว่าเธอถูกรังแก ฉันคิดว่าปัญหาคือ Huening อยู่เฉย ๆ ในมุมแบบนั้น”  ชาวเน็ตคนอื่นๆ ก็เข้าร่วมแสดงความคิดเห็นเช่นกัน พวกเขาให้ความเห็นว่า \"ฉันคิดว่าสาวๆ ถึงจุดที่พวกเขายังคงอึดอัดใจกันเพราะพวกเขายังไม่ชินกับมัน ฉันไม่คิดว่า Bahiyyih จะมั่นใจขึ้นมาได้ทันที เพียงเพราะแฟน ๆ ของเธอบอกว่าเธอเป็น เหยื่อการกลั่นแกล้ง   และสมาชิกในวง ก็อ่านคอมเมนต์มากมายว่า Bahiyyih น่ารักขนาดไหน และพวกเขาดูแลเธอตลอดการออกอากาศ” “เธอนั่งตัวตรงไม่ใส่ใจกับคอมเมนต์ ทั้งที่ยูจินหันมาชวนคุย เธอกลับหันไปมองสั้นๆ แล้วกลับไปนั่งตัวตรง”       ขอบคุณภาพและข้อมูลจาก @official_kep1er  3N Korea  และ allkpop บทความนี้ แปลโดย Korism ผู้ที่นำออกไป กรุณาให้เครดิตโดยการแนบลิ้งค์บทความแปลด้วย "
        }
    }
}