{
    "web": {
        "https://nineentertain.mcot.net/world-entertainment-update-6408391": {
            "title": "“ฮยอนแจ” เป็นสมาชิกคนที่ 3 ของวง The Boyz ที่ติดเชื้อโควิด-19",
            "content": "กลายเป็นผู้ป่วยโควิด-19 รายที่ 3 ของวง The Boyz ไปเรียบร้อย สำหรับนักร้องหนุ่ม “ฮยอนแจ” ที่ค่าย IST Entertainment ต้นสังกัดร่อนแถลงการณ์ยืนยันแล้วว่าจากการตรวจละเอียดแบบ PCR เมื่อวันที่ 26 มกราคมที่ผ่านมา ผลออกมาในวันรุ่งขึ้นว่าหนุ่ม “ฮยอนแจ” มีผลเป็นบวก จึงต้องเข้ารับการรักษาทันที ก่อนหน้านี้เพื่อนร่วมวง คือ “เอริค” เริ่มมีอาการป่วย ทุกคนในวงจึงเข้ารับการตรวจหาเชื้อโควิด-19 ทันที ซึ่งตอนนั้นมี “เอริค” เพียงคนเดียวที่ผลออกมาเป็นบวก แต่ทุกคนก็กักกัวตามมาตรการควบคุมโรคทันที ระหว่างนั้นเพื่อนร่วมวงอีกคน คือ “ยองฮุน” ก็ตัดสินใจตรวจละเอียดอีกครั้งแบบ PCR และผลก็ออกมาเป็นบวก สมาชิกที่เหลือจึงต้องเข้ารับการตรวจอีกครั้ง ซึ่งคราวนี้แจ็กพ็อตออกที่หนุ่ม “ฮยอนแจ”งานนี้ค่าย IST จึงเตรียมจัดการให้สมาชิกคนอื่น ๆ ในวง รวมถึงทีมงานเข้ารับการตรวจหาเชื้อไวรัสร้ายบ่อยขึ้นเป็นการเพิ่มมาตรการความปลอดภัยที่เข้มข้นขึ้น เพราะสุขภาพของศิลปินและทีมงานคือสิ่งสำคัญที่สุด.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreadispatch    เข้าชม 153 ครั้งดูข่าวเพิ่มเติม งานนี้ค่าย IST จึงเตรียมจัดการให้สมาชิกคนอื่น ๆ ในวง รวมถึงทีมงานเข้ารับการตรวจหาเชื้อไวรัสร้ายบ่อยขึ้นเป็นการเพิ่มมาตรการความปลอดภัยที่เข้มข้นขึ้น เพราะสุขภาพของศิลปินและทีมงานคือสิ่งสำคัญที่สุด.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : koreadispatch    เข้าชม 153 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6403544": {
            "title": "ดราม่าหนัก “เจ Day6” โร่ขอโทษหลังเล่นมุกพูดถึง “เจมี่” แบบหยาบคาย",
            "content": "กลายเป็นดราม่าร้อนฉ่าในโลกโซเชียล เมื่อหนุ่ม “เจ พัค” หรือ “เจ” อดีตสมาชิกวง Day6 ที่เพิ่งหมดสัญญากับค่าย JYP สด ๆ ร้อน ๆ เมื่อวันสิ้นปีที่ผ่านมา (31 ธค 64) สตรีมสดพูดคุยกับแฟน ๆ โดยพูดถึงสาว “เจมี่” เพื่อนศิลปินร่วมสังกัดเก่าด้วยถ้อยคำหยาบคายโดยอ้างว่าตอนนี้เขาไม่ได้อยู่ในวงการเคป็อปแล้วเลยใช้ศัพท์สแลงพูดทำนองว่า “เจมี่” เป็นผู้หญิงไม่ดีที่เดตกับผู้ชายไปทั่ว แถมยังหัวเราะร่วนเหมือนไม่รู้ตัวว่าพูดสิ่งที่ไม่สมควรพูดออกไป แถมยังท้าให้แฟน ๆ ไปบอกสาว “เจมี่” ด้วยว่าเขาพูดถึงเธอว่าอย่างไร งานนี้ไม่เพียงถูกชาวเน็ตถล่มแบบรัว ๆ เพราะไม่มีใครขำไปกับมุกนี้ด้วย แต่ยังรู้ไปถึงหูสาว “เจมี่” ที่ทวีตลอย ๆ ว่า ฉันเกลียดที่ผู้หญิงต้องตกเป็นเหยื่อมุกตลกของผู้ชายเพียงเพื่อเอาใจชาวเน็ต ก่อนจะลบข้อความนั้นทิ้งไปแล้วบอกสั้น ๆ ว่า เธอโอเคด้านคนต้นเรื่องในที่สุดก็ต้องทวีตขอโทษทั้ง “เจมี่” และทุกคนที่รู้สึกไม่ดีกับสิ่งที่เขาพูด โดยยอมรับว่าเป็นคำพูดที่รสนิยมต่ำสุด ๆ และรู้สึกแย่ที่ทำให้ “เจมี่” รู้สึกไม่ดี พร้อมยืนยันเจตนาว่า เขาแค่ล้อเล่นฉันท์เพื่อน ไม่ได้หมายความว่าเธอมีพฤติกรรมแบบนั้นจริง ๆ เพียงแต่สับสนเรื่องการใช้คำเท่านั้น แต่ก็น้อมรับว่าไม่มีข้อแก้ตัวกับสิ่งที่ได้พูดออกไปจริง ๆเมื่อปีที่แล้ว (2021) หนุ่ม “เจ” ก็เคยตกเป็นประเด็นฉาวจากการไลฟ์สตรีมด้วยการแสดงท่าทางในเกมที่ส่อไปในทางเพศ และเมื่อมีคนบอกว่าเป็นพฤติกรรมที่ไม่เหมาะสม เขากลับไล่ให้คนเล่านั้นออกไปจากสตรีมสดของเขาซะ แต่ท้ายสุดเจ้าตัวก็ต้องขอโทษผ่านทวิตเตอร์และประกาศจะยุติการไลฟ์สตรีมเพื่อปรับปรุงตัวเอง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi / twitterเข้าชม 17,564 ครั้งดูข่าวเพิ่มเติม ด้านคนต้นเรื่องในที่สุดก็ต้องทวีตขอโทษทั้ง “เจมี่” และทุกคนที่รู้สึกไม่ดีกับสิ่งที่เขาพูด โดยยอมรับว่าเป็นคำพูดที่รสนิยมต่ำสุด ๆ และรู้สึกแย่ที่ทำให้ “เจมี่” รู้สึกไม่ดี พร้อมยืนยันเจตนาว่า เขาแค่ล้อเล่นฉันท์เพื่อน ไม่ได้หมายความว่าเธอมีพฤติกรรมแบบนั้นจริง ๆ เพียงแต่สับสนเรื่องการใช้คำเท่านั้น แต่ก็น้อมรับว่าไม่มีข้อแก้ตัวกับสิ่งที่ได้พูดออกไปจริง ๆ เมื่อปีที่แล้ว (2021) หนุ่ม “เจ” ก็เคยตกเป็นประเด็นฉาวจากการไลฟ์สตรีมด้วยการแสดงท่าทางในเกมที่ส่อไปในทางเพศ และเมื่อมีคนบอกว่าเป็นพฤติกรรมที่ไม่เหมาะสม เขากลับไล่ให้คนเล่านั้นออกไปจากสตรีมสดของเขาซะ แต่ท้ายสุดเจ้าตัวก็ต้องขอโทษผ่านทวิตเตอร์และประกาศจะยุติการไลฟ์สตรีมเพื่อปรับปรุงตัวเอง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi / twitterเข้าชม 17,564 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : soompi / twitterเข้าชม 17,564 ครั้ง "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6399465": {
            "title": "“TWICE” ยกเลิกคอนเสิร์ต 24 ธ.ค. คุมเข้มโควิด  ซ้ำ “จอง ยอน” อดขึ้นเวทีเพราะปัญหาสุขภาพ",
            "content": "ซ้อมสเต็ปเป๊ะเวอร์เตรียมแจกความสดใสในคอนเสิร์ตใหญ่ TWICE 4TH World Tour III วันที่ 24-26 ธันวาคมนี้ แต่ท้ายสุดสาว ๆ วง TWICE ก็ต้องจำใจประกาศยกเลิกคอนเสิร์ตรอบวันคริสต์มาสอีฟ 24 ธันวาคมนี้ไปอย่างน่าเสียดายเหตุเพราะมาตรการควบคุมโรคโควิด-19 ที่เข้มงวดของภาครัฐ ซึ่งกำหนดว่าสถานที่จัดแสดงคอนเสิร์ตสามารถเปิดได้ถึง 4 ทุ่มเท่านั้นไปจนถึงวันที่ 2 มกราคม 2565 แต่คอนเสิร์ตของสาว ๆ TWICE ในวันดังกล่าวจะเริ่มขึ้นเวลา 19.30 น. และมันส์ ๆ ยาวไป 3 ชั่วโมงเต็มอิ่ม ซึ่งเกินเวลาที่ภาครัฐกำหนดแน่นอน จึงตัดสินใจยกเลิกโชว์ในวันที่ 24 ธันวาคมไปซะเลย และหวังว่าแฟน ๆ จะเข้าใจสถานการณ์ที่เกิดขึ้น ส่วนคอนเสิร์ตวันที่ 25 และ 26 ธันวาคมสามารถจัดได้ตามปกติ เพราะจะเริ่มโชว์ในเวลา 18.00 น. และ 17.00 น. ตามลำดับ ขณะเดียวกันคอนเสิร์ตออนไลน์ในวันที่ 26 ธันวาคมก็ดำเนินไปได้ตามกำหนดเดิมเช่นกันแต่ที่น่าเสียดายซ้ำสองก็คือสาว “จอง ยอน” ไม่สามารถขึ้นเวทีโชว์ร่วมกับเพื่อน ๆ ได้ทั้ง 2 รอบ เพราะปัญหาสุขภาพ ทางค่าย JYP Entertainment จึงประกาศให้แฟน ๆ ที่ไม่แฮปปี้กับสถานการณ์ที่เกิดขึ้นสามารถขอรับเงินค่าบัตรคอนเสิร์ตคืนได้ 100 เปอร์เซ็นต์โดยไม่มีการเรียกเก็บค่าธรรมเนียมใด ๆ ทั้งสิ้นได้ที่ศูนย์บริการลูกค้าและจุดจำหน่ายตั๋วส่วนเวิลด์ทัวร์ในอเมริกาเดือนกุมภาพันธ์ปีหน้า ก็หวังว่าจะไม่เจอโรคเลื่อนเพราะโควิดอีก โดยสาว ๆ เตรียมออกสตาร์ทที่ลอสแองเจลิสในวันที่ 15 กุมภาพันธ์ จากนั้นก็จะเดินสายไปโชว์ที่โอ๊กแลนด์ , ฟอร์ตเวิร์ธ , แอตแลนตา และนิวยอร์ก ตามลำดับ.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi  เข้าชม 109 ครั้งดูข่าวเพิ่มเติม ส่วนเวิลด์ทัวร์ในอเมริกาเดือนกุมภาพันธ์ปีหน้า ก็หวังว่าจะไม่เจอโรคเลื่อนเพราะโควิดอีก โดยสาว ๆ เตรียมออกสตาร์ทที่ลอสแองเจลิสในวันที่ 15 กุมภาพันธ์ จากนั้นก็จะเดินสายไปโชว์ที่โอ๊กแลนด์ , ฟอร์ตเวิร์ธ , แอตแลนตา และนิวยอร์ก ตามลำดับ.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompi  เข้าชม 109 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6425261": {
            "title": "มุ่งเจาะตลาดโลก “SEVENTEEN” เตรียมปล่อยซิงเกิ้ลภาษาอังกฤษเพลงแรก",
            "content": "ล้างหูรอฟังซิงเกิ้ลภาษาอังกฤษเพลงแรกของหนุ่ม ๆ SEVENTEEN กันได้เลย เพราะค่าย Pledis Entertainment ยืนยันกับ Dispatch ว่า หนุ่ม ๆ SEVENTEEN จะปล่อยเพลงภาษาอังกฤษออกมาในเดือนเมษายนนี้แน่นอน เพราะถึงเวลาแล้วที่พวกเขาจะเดินหน้าบุกตลาดโลกอย่างจริงจัง โดยหวังว่าแฟนเพลงในประเทศต่าง ๆ จะให้การต้อนรับอย่างอบอุ่น โดยซิงเกิ้ลนี้จะได้ชื่อว่าเป็นเพลงที่มีเนื้อร้องภาษาอังกฤษล้วนเพลงแรกนับตั้งแต่พวกเขาเดบิวต์ ขณะที่อัลบั้มเต็มจะตามมาในเดือนถัดไป (พฤษภาคม) นับเป็นอัลบั้มเต็มชุดที่ 4 ของ SEVENTEEN ซึ่งทิ้งห่างจากอัลบั้มก่อนหน้านี้อย่าง An Ode นานถึง 2 ปี 8 เดือนเลยทีเดียว ซึ่งเมื่อสุดสัปดาห์ที่ผ่านมา หนุ่ม ๆ SEVENTEEN ก็อุ่นเครื่องด้วยการจัดแฟนมีทติ้งครั้งที่ 6 “Seventeen in Carat Land” ให้แฟนคลับได้ใกล้ชิดและสนุกสนานกับบรรยากาศที่คิดถึงที่สนามกีฬาจัมซิล ในกรุงโซลมาหมาดๆ.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : dispatch  เข้าชม 44 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : dispatch   "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6393278": {
            "title": "4 สาว MAMAMOO เตรียมเปิดตัวหนังเบื้องหน้า-เบื้องหลังคอนเสิร์ตใหญ่",
            "content": "ข่าวดีสำหรับแฟน ๆ ของวงเกิร์ลกรุ๊ป MAMAMOO ที่พลาดชมหรือได้ชมแต่ยังไม่จุใจกับคอนเสิร์ตออนไลน์ WAW ของพวกเธอที่จัดไปเมื่อวันที่ 28 สิงหาคมที่ผ่านมา ฉลอง 7 ปีที่เดบิวต์ เพราะล่าสุดเครือโรงภาพยนตร์ยักษ์ใหญ่ในแดนกิมจิอย่าง CGV ก็ประกาศแล้วว่า วง MAMAMOO จะส่งหนังของตัวเองเรื่อง MAMAMOO 2021 WAW Concert: The Movie เข้าฉายในโรงภาพยนตร์ทั่วเกาหลีในวันที่ 3 ธันวาคมนี้ ซึ่งจะมีบรรยากาศสุดประทับใจทั้งเบื้องหน้าและเบื้องหลังคอนเสิร์ตครั้งนี้ให้ชมแบบจุใจตลอดเวลา 102 นาที และได้ฟังเพลงเพราะ ๆ ทั้ง 25 เพลงของสาว ๆ กันแบบเต็มอิ่ม พร้อมด้วยเนื้อหาสุดเอ็กซ์คลูซีฟอื่น ๆ อีกแน่น ๆ   งานนี้เครือโรงภาพยนตร์ CGV เผยว่าได้จับมือกับอีกหลากหลายศิลปินทำหนังพิเศษในทำนองนี้ออกฉายเพื่อมอบความสุขและประสบการณ์สุดพิเศษให้กับแฟน ๆ ประหนึ่งได้เข้าไปนั่งดูคอนเสิร์ตของเหล่าศิลปินด้วยตัวเองออกมาอีกอย่างต่อเนื่อง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompiเข้าชม 96 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : soompi "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6407114": {
            "title": "“ซึงฮุน WINNER” ติดเชื้อโควิด-19 ส่วนเพื่อนร่วมวงทุกคนผลเป็นลบ",
            "content": "แฟนคลับส่งกำลังใจรัว ๆ เพราะค่าย YG Entertainment ยืนยันแล้วว่านักร้องหนุ่ม “ซึงฮุน” สมาชิกวงบอยแบนด์ WINNER ติดเชื้อโควิด-19 โดยตอนแรกเจ้าตัวตรวจกับชุดตรวจด้วยตัวเองก่อนเพราะต้องใช้ผลไปยืนยันเพื่อเข้ากองถ่ายหนังในวันที่ 23 มกราคม เมื่อผลออกมาเป็นบวก ทั้งวง WINNER จึงต้องงดกิจกรรมทั้งหมดเพื่อเข้ารับการตรวจอย่างละเอียดด้วยวิธี PCR ซึ่งปรากฏว่านอกจากหนุ่ม “ซึงฮุน” แล้ว สมาชิกทุกคนผลตรวจเป็นลบกันหมด ในรายงานข่าวยังบอกอีกว่าหนุ่ม “ซึงฮุน” ฉีดวัคซีนป้องกันโรคโควิด-19 แล้ว และไม่มีอาการใด ๆ ก่อนตรวจพบเชื้อ โดยค่าย YG ยืนยันจะปฏิบัติตามมาตรการทางสาธารณสุขอย่างดีที่สุดเพื่อป้องกันการแพร่ระบาดของโรคโควิด-19“ซึงฮุน” เพิ่งปลดประจำการทหารออกมาเมื่อวันที่ 14 มกราคมที่ผ่านมา.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : thekoreaherald / dispatch    เข้าชม 108 ครั้งดูข่าวเพิ่มเติม “ซึงฮุน” เพิ่งปลดประจำการทหารออกมาเมื่อวันที่ 14 มกราคมที่ผ่านมา.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : thekoreaherald / dispatch    เข้าชม 108 ครั้งดูข่าวเพิ่มเติม เข้าชม 108 ครั้ง "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6397743": {
            "title": "ศาลเห็นตั้งใจเลิกยา-ไม่ทำผิดซ้ำ สั่งรอลงอาญาโทษจำคุก “จอง อิลฮุน” คดีซื้อ-เสพกัญชา",
            "content": "โทษจำคุก 2 ปี รอลงอาญา 3 ปี คือโทษหนักสุดที่ศาลสูงกรุงโซลสั่งพิพากษานักร้องหนุ่ม “จอง อิลฮุน” อดีตสมาชิกวง BTOB จากความผิดฐานซื้อและเสพกัญชา ช่วงปี2016-2019 พร้อมด้วยโทษปรับเป็นเงินจำนวน 120 ล้านวอน หรือราว 3 ล้านบาท รวมถึงต้องเข้าคอร์สบำบัดยาเสพติดเป็นเวลา 40 ชั่วโมง เมื่อเดือนมิถุนายนที่ผ่านมา หนุ่ม “อิลฮุน” ถูกนำตัวขึ้นศาลครั้งแรก เจ้าตัวรับสารภาพทุกข้อกล่าวหา โดยศาลสั่งจำคุก 2 ปี และปรับเป็นเงิน 3.5 ล้านบาท ซึ่งทั้ง “อิลฮุน” และอัยการได้ยื่นอุทธรณ์ไป โดยศาลนัดฟังคำพิพากษาเมื่อวานนี้ (16 ธค 64)  ซึ่งแม้ศาลอุทธรณ์จะพิพากษายืนเรื่องโทษจำคุก 2 ปี แต่ก็ให้รอลงอาญาไว้ก่อนเป็นเวลา 3 ปี และลดโทษปรับลง เนื่องจากพิเคราะห์แล้วเห็นว่านอกจากหนุ่ม “อิลฮุน” จะไม่เคยมีประวัติอาชญากรรมมาก่อน เขายังมีความตั้งใจจริงที่จะเลิกยาเสพติดและไม่คิดกระทำความผิดซ้ำ ด้วยการปรึกษานักจิตวิทยา และลงเรียนออนไลน์เรื่องการติดยาเสพติด รวมถึงครอบครัวยังพร้อมชี้แนะให้เดินทางที่ถูกที่ควรด้วย.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompiเข้าชม 314 ครั้งดูข่าวเพิ่มเติม ซึ่งแม้ศาลอุทธรณ์จะพิพากษายืนเรื่องโทษจำคุก 2 ปี แต่ก็ให้รอลงอาญาไว้ก่อนเป็นเวลา 3 ปี และลดโทษปรับลง เนื่องจากพิเคราะห์แล้วเห็นว่านอกจากหนุ่ม “อิลฮุน” จะไม่เคยมีประวัติอาชญากรรมมาก่อน เขายังมีความตั้งใจจริงที่จะเลิกยาเสพติดและไม่คิดกระทำความผิดซ้ำ ด้วยการปรึกษานักจิตวิทยา และลงเรียนออนไลน์เรื่องการติดยาเสพติด รวมถึงครอบครัวยังพร้อมชี้แนะให้เดินทางที่ถูกที่ควรด้วย.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompiเข้าชม 314 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6422562": {
            "title": "นับถอยหลังตีตั๋วมีทแอนด์กรี๊ด EXO ฉลองเดบิวต์ 10 ปี เม.ย.นี้",
            "content": "8 เมษายน 2012 คือวันดีเดย์ที่หนุ่ม ๆ EXO เดบิวต์ในฐานะบอยแบนด์ที่ดังปังเปรี้ยงในชั่วข้ามคืน พวกเขาจึงเจาะจงเลือกวันที่ 9 เมษายน 2022 เป็นวันฉลองครบ 10 ปีที่เดบิวต์กับงานที่ใช้ชื่อว่า 2022 Debut Anniversary Fan Event: EXO ในเวลา 1 ทุ่มตรง (ตามเวลาท้องถิ่น) ที่สนามกีฬาจัมซิล ในกรุงโซล โดยจะเป็นงานแฟนมีทติ้งที่จัดเต็มทั้งโชว์ เกมสนุก ๆ รวมถึงพูดคุยกับเหล่า EXO-L แบบเป็นกันเอง น่าเสียดายเพราะ 3 หนุ่ม แบคฮยอน , ชานยอล และ เฉิน ยังติดภารกิจรับใช้ชาติจึงไม่สามารถมาร่วมกิจกรรมในครั้งนี้ได้ แต่แฟน ๆ จะได้สบตาใกล้ชิดหนุ่มซูโฮ , ซิ่วหมิน , ดี.โอ. , ไค และ เซฮุน ตัวจริงเป็น ๆ แน่นอนส่วนแฟนคลับนานาชาติก็ไม่ต้องน้อยใจเพราะงานมีทแอนด์กรี๊ดครั้งนี้มีการไลฟ์สตรีมให้ชมประหนึ่งได้เข้าร่วมงานยังไงยังงั้นด้วย เริ่มจองตั๋ว 24 มีนาคมนี้นะจ๊ะ.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : dispatch / koreaherald / SM Entertainmentเข้าชม 71 ครั้งดูข่าวเพิ่มเติม ส่วนแฟนคลับนานาชาติก็ไม่ต้องน้อยใจเพราะงานมีทแอนด์กรี๊ดครั้งนี้มีการไลฟ์สตรีมให้ชมประหนึ่งได้เข้าร่วมงานยังไงยังงั้นด้วย เริ่มจองตั๋ว 24 มีนาคมนี้นะจ๊ะ.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : dispatch / koreaherald / SM Entertainmentเข้าชม 71 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6427951": {
            "title": "ขอโทษที่คิดน้อยไป “โดฮยอน” วง MIRAE      รับผิดที่ล้อเลียนสาว ๆ วง Billie",
            "content": "ได้บทเรียนเซ่นพฤติกรรมไม่เหมาะสมของตัวเองไปอีกราย สำหรับนักร้องหนุ่ม “โดฮยอน” สมาชิกวง MIRAE ที่ไลฟ์สดร้องเพลงของสาว ๆ เกิร์ลกรุ๊ปแบบขำ ๆ กับเพื่อน ๆ ร่วมวง แต่ดันสนุกเกินขอบเขตเมื่อร้องเพลง GingaMingaYo ของสาว ๆ วง Billie แล้วทำท่าแลบลิ้นปลิ้นตาล้อเลียนนักร้องสาว “สึกิ” ชนิดที่ชาวเน็ตเห็นแล้วถึงกับรับไม่ได้ กระทั่ง 2 วันผ่านไปหนุ่ม “โดฮยอน” ถึงเพิ่งทวีตจดหมายขอโทษที่เขียนด้วยลายมือตัวเอง ก่อนที่จะไลฟ์สดอ่านจดหมายขอโทษอย่างเป็นทางการอีกครั้ง โดยระบุว่า เขาขอโทษอย่างสุดซึ้งต่อสมาชิกวง Billie ทุกคน ซึ่งนอกจากขอโทษผ่านโซเชียลแล้วเขายังเตรียมไปขอโทษโดยตรงด้วย และยังขอโทษคนอื่น ๆ ที่ได้ดูคลิปนี้แล้วรู้สึกไม่สบายใจในการกระทำที่คิดน้อยไปของเขาด้วย ต่อไปเขาจะระมัดระวังไม่ให้เกิดเหตุการณ์แบบนี้ขึ้นอีก และน้อมรับทุกเสียงวิพากษ์วิจารณ์แต่โดยดีวง MIRAE เป็นวงบอยแบนด์ที่ประกอบด้วยสมาชิกทั้งสิ้น 7 คน เพิ่งเดบิตว์เมื่อปีที่แล้ว (2021) เหมือน ๆ กับวงเกิร์ลกรุ๊ป Billie ที่มีสมาชิก 7 คนและเพิ่งเดบิวต์เมื่อปีก่อนเช่นกัน.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompiเข้าชม 104 ครั้งดูข่าวเพิ่มเติม วง MIRAE เป็นวงบอยแบนด์ที่ประกอบด้วยสมาชิกทั้งสิ้น 7 คน เพิ่งเดบิตว์เมื่อปีที่แล้ว (2021) เหมือน ๆ กับวงเกิร์ลกรุ๊ป Billie ที่มีสมาชิก 7 คนและเพิ่งเดบิวต์เมื่อปีก่อนเช่นกัน.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompiเข้าชม 104 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6418711": {
            "title": "“เอริค” วง The Boyz ประกาศพักงานเพราะปัญหาสุขภาพ",
            "content": "เอาใจช่วยหนุ่มหน้าใส “เอริค” วง The Boyz ที่ปัญหาสุขภาพทำให้เขาต้องพักงานอีกครั้ง อดเดินสายโปรโมทผลงานและร่วมกิจกรรมต่าง ๆ กับเพื่อน ๆ ไปอย่างน่าเสียดาย หลังจากเมื่อปลายเดือนมกราคมที่ผ่านมาก็ประกาศติดเชื้อโควิด-19 และต้องพักงานเพื่อกักตัวรักษาอาการป่วยไปครั้งหนึ่งแล้ว ค่าย IST Entertainment ต้นสังกัดประกาศอย่างเป็นทางการว่า หนุ่ม “เอริค” ไม่สามารถร่วมเดินสายโปรโมทผลงานร่วมกับเพื่อน ๆ วง The Boyz ได้ เนื่องจากปัญหาสุขภาพซึ่งจำเป็นต้องใช้เวลาในการพักฟื้น ทางค่ายและ “เอริค” จึงตัดสินใจร่วมกันให้เขาหยุดพักงานและงดกิจกรรมทุกอย่าง เพื่อให้ร่างกายฟื้นตัวเต็มที่ก่อนแล้วค่อยกลับมาเดินหน้าทำงานอีกครั้งส่วนช่วงนี้สมาชิกที่เหลือทั้ง 10 คนของวง The Boyz ก็จะเดินหน้าโปรโมทผลงานกันต่อไป และหวังว่าแฟน ๆ จะเข้าใจในสถานการณ์ว่าสุขภาพของศิลปินต้องมาก่อนเสมอ โดยทางค่ายจะอัพเดทอาการป่วยของหนุ่ม “เอริค” เป็นระยะ และหากมีแผนอะไรในอนาคตก็จะประกาศให้ทราบอย่างแน่นอน.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreadispatch   เข้าชม 179 ครั้งดูข่าวเพิ่มเติม ส่วนช่วงนี้สมาชิกที่เหลือทั้ง 10 คนของวง The Boyz ก็จะเดินหน้าโปรโมทผลงานกันต่อไป และหวังว่าแฟน ๆ จะเข้าใจในสถานการณ์ว่าสุขภาพของศิลปินต้องมาก่อนเสมอ โดยทางค่ายจะอัพเดทอาการป่วยของหนุ่ม “เอริค” เป็นระยะ และหากมีแผนอะไรในอนาคตก็จะประกาศให้ทราบอย่างแน่นอน.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : koreadispatch   เข้าชม 179 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6428961": {
            "title": "ต้นสังกัดปิดช่อง Youtube วง A.C.E ทันที หลังโดนแฮ็ก",
            "content": "ทันทีที่รู้ว่าช่องยูทูบของศิลปินในสังกัด คือ A.C.E รวมถึงช่องยูทูบหลักของค่ายเองถูกมือดีแฮ็กข้อมูล ค่าย BEAT Interactive ก็ออกแถลงการณ์ชี้แจงทันที พร้อมระบุว่า มือมืดได้เปลี่ยนพาสเวิร์ดและข้อมูลสำคัญในการล็อกอินและการยืนยันตัวตนทั้งหมด แถมยังมีการอัปโหลดคลิปวิดีโอหลายคลิปเข้าสู่ช่องยูทูบที่ถูกแฮ็กด้วย  ก่อนที่บัญชีผู้ใช้ปลอมนั้นจะถูกลบออกไป ขณะเดียวกันยังมีรายงานว่า คลิปและเพลงของวง A.C.E ในช่องยูทูบก็ถูกลบออกไปด้วย ซึ่งทางค่ายได้แจ้งไปทางยูทูบและกูเกิลซึ่งเป็นบริษัทแม่ของยูทูบเรียบร้อยแล้ว หากกู้คืนมาได้หรือมีความคืบหน้าอย่างไรจะแจ้งให้ทราบอีกครั้ง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi / teenvogue / billboard    เข้าชม 24 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : soompi / teenvogue / billboard     "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6404850": {
            "title": "โรคซึมเศร้ากำเริบ กองทัพสั่งย้าย “แทมิน” ทำงานบริการสาธารณะจนปลดประจำการ",
            "content": "เพื่อให้อาการป่วยโรคซึมเศร้าและวิตกกังวลซึ่งเป็นมาตั้งแต่ก่อนถูกเรียกเกณฑ์ทหาร (31 พค 64) และอาการแย่ลงขณะรับใช้ชาติ กองทัพเกาหลีใต้จึงมีคำสั่งย้ายทหารเกณฑ์คนดัง นักร้องหนุ่ม “แทมิน” วง SHINee ไปทำงานที่หน่วยบริการสาธารณะแทนการฝึกทหารและทำหน้าที่ในฐานะสมาชิกของวงดนตรีกองทัพบกตั้งแต่วันที่ 14 มกราคมเป็นต้นไป เพราะแม้ตลอดระยะเวลาที่อยู่ในกองทัพ พลทหาร “แทมิน” จะได้รับการบำบัดรักษาอาการป่วย แต่ท้ายที่สุดแพทย์และทางกองทัพก็เห็นว่ามันยากมากที่เขาจะใช้ชีวิตทหารเกณฑ์ไปพร้อม ๆ กับการเยียวยาอาการป่วยที่กำเริบหนักขึ้น จึงให้ย้ายไปทำงานบริการสาธารณะแทน  เพื่อให้ “แทมิน” ได้โฟกัสกับการรักษาอาการป่วยได้มากขึ้นโดย “แทมิน” จะต้องประจำการทำงานในหน่วยดังกล่าวไปจนครบกำหนดปลดประจำการในเดือนพฤศจิกายนปีนี้ (2565) เหล่าชายนี่เวิลด์มาร่วมกันส่งกำลังใจให้เขาเยอะ ๆ น้า.-ไนน์เอ็นเตอร์เทน  ข่าว / ภาพ : koreaheraldเข้าชม 235 ครั้งดูข่าวเพิ่มเติม โดย “แทมิน” จะต้องประจำการทำงานในหน่วยดังกล่าวไปจนครบกำหนดปลดประจำการในเดือนพฤศจิกายนปีนี้ (2565) เหล่าชายนี่เวิลด์มาร่วมกันส่งกำลังใจให้เขาเยอะ ๆ น้า.-ไนน์เอ็นเตอร์เทน   ข่าว / ภาพ : koreaheraldเข้าชม 235 ครั้งดูข่าวเพิ่มเติม เข้าชม 235 ครั้ง "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6427991": {
            "title": "ยังไม่ทันเดบิวต์ก็เจอดราม่า “คิม การัม” วง Le Sserafim ถูกแฉบูลลี่เพื่อน ค่ายจ่อฟ้องคนกุข่าว",
            "content": "ทันทีที่ค่าย Source Music เปิดตัวสาว “คิม การัม” ในฐานะสมาชิกคนที่ 2 ของวงเกิร์ลกรุ๊ป Le Sserafim ที่เตรียมเดบิวต์ในเดือนหน้า (พค) นักร้องสาวก็เจอข่าวฉาวสกัดดาวรุ่งทันที โดยมีมือมืดอ้างว่าเป็นเพื่อนสมัยมัธยมแฉแหลกผ่านโซเชียลว่า “คิม การัม” มีพฤติกรรมไม่น่ารัก ทั้งดื่มเหล้า สูบบุหรี่ พูดหยาบ และเป็นจอมบูลลี่เพื่อนสมัยเรียนมัธยม ซึ่งหลังจากตรวจสอบ ค่าย Hybe บริษัทแม่ของ Source Music ก็ออกแถลงการณ์ปกป้องศิลปินในสังกัด โดยยืนยันว่า “คิม การัม” ไม่มีพฤติกรรมฉาว และเธอต่างหากที่ตกเป็นเหยื่อถูกบูลลี่ ซึ่งทางค่าย Source Music เดินหน้าเอาผิดทางกฎหมายกับผู้ที่ปล่อยข่าวเท็จใส่ร้ายทำลายชื่อเสียงและหมิ่นประมาทศิลปิน โดยจะไม่มีการเตือนและจะไม่ปรานีอย่างแน่นอนวง Le Sserafim เป็นที่จับตามองอย่างมาก โดยเฉพาะหลังจากสาว “มิยาวากิ ซากุระ” และ “คิม เชวอน” อดีตสมาชิกวง IZ*ONE ซึ่งยุบวงไปแล้ว โดดมาร่วมแจมในฐานะสมาชิกของวงนี้ด้วย แต่สาว ๆ จะได้รับการตอบรับดีแค่ไหน เดือนหน้าเป็นอันรู้กัน.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreaherald / soompi เข้าชม 1,000 ครั้งดูข่าวเพิ่มเติม วง Le Sserafim เป็นที่จับตามองอย่างมาก โดยเฉพาะหลังจากสาว “มิยาวากิ ซากุระ” และ “คิม เชวอน” อดีตสมาชิกวง IZ*ONE ซึ่งยุบวงไปแล้ว โดดมาร่วมแจมในฐานะสมาชิกของวงนี้ด้วย แต่สาว ๆ จะได้รับการตอบรับดีแค่ไหน เดือนหน้าเป็นอันรู้กัน.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : koreaherald / soompi เข้าชม 1,000 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6391632": {
            "title": "“เอ็ด ชีแรน – เจสซี – ซอนมี” คอแลบฯ ครั้งสำคัญ",
            "content": "แฟน ๆ ไม่ต้องเป็นห่วง เพราะค่าย Pledis Entertainment ต้นสังกัดยืนยันแล้วว่า นักร้องหนุ่สุดหล่อ “จองฮัน” แห่งวง SEVENTEEN ที่ติดเชื้อโควิด-19 ตั้งแต่วันที่ 13 เมษายนที่ผ่านมา มีอาการเพียงเล็กน้อยเท่านั้น พร้อมแจงรายละเอียดว่า ช่วงค่ำวันพุธที่ผ่านมา (13เม.ย.) “จองฮัน” มีอาการเจ็บคอเล็กน้อย จึงตรวจคัดกรองหาเชื้อโควิด-19 ด้วยตัวเอง เมื่อผลออกมาเป็นบวก จึงรีบไปตรวจที่คลินิกทันทีเพื่อความแน่ใจ ซึ่งผลก็ยืนยันเป็นบวกเช่นกัน เขาจึงรีบกักตัวและเบรกงานทันที ซึ่งช่วงนี้วง Seventeen อยู่ระหว่างโปรโมทผลงานเตรียมคัมแบ็กพอดี หนุ่ม “จองฮัน” จึงไม่สามารถร่วมกิจกรรมต่าง ๆ ตามคิวเดิมได้จนกว่าจะหายดีขณะที่เพื่อนร่วมวง SEVENTEEN อีก 2 คน คือ “มินกยู” และ “เวอร์นอน” ที่ได้เจอกับ “จองฮัน” ก่อนหน้านี้ ยังไม่มีอาการใด ๆ เนื่องจากทั้ง 3 คนใช้เวลาร่วมกันเพียงไม่นาน และสวมหน้ากากอนามัยตลอดเวลา.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreadispatch / IG: jeonghaniyoo_nเข้าชม 48 ครั้งดูข่าวเพิ่มเติม ขณะที่เพื่อนร่วมวง SEVENTEEN อีก 2 คน คือ “มินกยู” และ “เวอร์นอน” ที่ได้เจอกับ “จองฮัน” ก่อนหน้านี้ ยังไม่มีอาการใด ๆ เนื่องจากทั้ง 3 คนใช้เวลาร่วมกันเพียงไม่นาน และสวมหน้ากากอนามัยตลอดเวลา.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : koreadispatch / IG: jeonghaniyoo_nเข้าชม 48 ครั้งดูข่าวเพิ่มเติม ดูเหมือนว่านักร้องหนุ่ม “เอ็ด ชีแรน” จะถูกโฉลกกับสายเกาซะจริง ๆ เพราะไม่เพียงแต่งเพลงสุดปังให้กับวงบอยแบนด์สุดฮอต BTS และเตรียมบินมาร่วมโชว์ในงาน Mnet Asian Music Awards 2021 ในเดือนหน้าเท่านั้น ล่าสุดค่ายวอเนอร์มิวสิกเกาหลีก็ประกาศข่าวดีให้แฟนเพลงได้ตื่นเต้นกันว่า 2 นักร้องสาวแถวหน้า คือ “เจสซี” แรปเปอร์ชาวอเมริกันสายเลือดเกาหลี และนักร้องสาว “ซอนมี” จะมาร่วมสร้างสีสันทางดนตรีด้วยการโดดมาร่วมฟีเจอริงในซิงเกิล Shivers ซึ่งอยู่ในอัลบั้มล่าสุด (=) ของนักร้องหนุ่ม “เอ็ด” ด้วย โดยค่ายวอร์เนอร์ฯ ระบุว่า ความสามารถของทั้ง 3 ศิลปินไม่เพียงสอดประสานกันอย่างกลมกลืน แต่ทุกคนยังมีเสน่ห์ที่แตกต่างกันอีกด้วย จึงอยากให้แฟนเพลงเปิดใจรับฟังการร่วมงานทางดนตรีครั้งสำคัญนี้ฟากสาว “ซอนมี” ก็ประกาศข่าวนี้ผ่านทวิตเตอร์และให้แฟน ๆ ได้ตื่นเต้นกันด้วย เพลง Shivers ของหนุ่ม “เอ็ด” ที่มี 2 สาวร่วมแจมด้วยจะออกมาเป็นยังไง รอฟังกันได้ 24 พฤศจิกายนนี้.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi / yahooเข้าชม 78 ครั้งดูข่าวเพิ่มเติม ฟากสาว “ซอนมี” ก็ประกาศข่าวนี้ผ่านทวิตเตอร์และให้แฟน ๆ ได้ตื่นเต้นกันด้วย เพลง Shivers ของหนุ่ม “เอ็ด” ที่มี 2 สาวร่วมแจมด้วยจะออกมาเป็นยังไง รอฟังกันได้ 24 พฤศจิกายนนี้.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompi / yahooเข้าชม 78 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6429840": {
            "title": "“จองฮัน SEVENTEEN” ติดโควิด-19 เบรกงาน  กักตัวทันที",
            "content": "แฟน ๆ ไม่ต้องเป็นห่วง เพราะค่าย Pledis Entertainment ต้นสังกัดยืนยันแล้วว่า นักร้องหนุ่สุดหล่อ “จองฮัน” แห่งวง SEVENTEEN ที่ติดเชื้อโควิด-19 ตั้งแต่วันที่ 13 เมษายนที่ผ่านมา มีอาการเพียงเล็กน้อยเท่านั้น พร้อมแจงรายละเอียดว่า ช่วงค่ำวันพุธที่ผ่านมา (13เม.ย.) “จองฮัน” มีอาการเจ็บคอเล็กน้อย จึงตรวจคัดกรองหาเชื้อโควิด-19 ด้วยตัวเอง เมื่อผลออกมาเป็นบวก จึงรีบไปตรวจที่คลินิกทันทีเพื่อความแน่ใจ ซึ่งผลก็ยืนยันเป็นบวกเช่นกัน เขาจึงรีบกักตัวและเบรกงานทันที ซึ่งช่วงนี้วง Seventeen อยู่ระหว่างโปรโมทผลงานเตรียมคัมแบ็กพอดี หนุ่ม “จองฮัน” จึงไม่สามารถร่วมกิจกรรมต่าง ๆ ตามคิวเดิมได้จนกว่าจะหายดีขณะที่เพื่อนร่วมวง SEVENTEEN อีก 2 คน คือ “มินกยู” และ “เวอร์นอน” ที่ได้เจอกับ “จองฮัน” ก่อนหน้านี้ ยังไม่มีอาการใด ๆ เนื่องจากทั้ง 3 คนใช้เวลาร่วมกันเพียงไม่นาน และสวมหน้ากากอนามัยตลอดเวลา.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreadispatch / IG: jeonghaniyoo_nเข้าชม 48 ครั้งดูข่าวเพิ่มเติม ขณะที่เพื่อนร่วมวง SEVENTEEN อีก 2 คน คือ “มินกยู” และ “เวอร์นอน” ที่ได้เจอกับ “จองฮัน” ก่อนหน้านี้ ยังไม่มีอาการใด ๆ เนื่องจากทั้ง 3 คนใช้เวลาร่วมกันเพียงไม่นาน และสวมหน้ากากอนามัยตลอดเวลา.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : koreadispatch / IG: jeonghaniyoo_nเข้าชม 48 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/entertainment-international-606165": {
            "title": "“Demon Slayer” ขึ้นอันดับ 2 หนังทำเงินสูงสุดในญี่ปุ่น",
            "content": ""
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6402988": {
            "title": "“จีมิน” อดีตสมาชิกสุดฉาวแห่งวง AOA โผล่เล่นไอจีในรอบปีครึ่ง พร้อมเผยเพลงใหม่",
            "content": "นักร้องสาว “จีมิน” ที่ตัดสินใจออกจากวง AOA พร้อมหยุดกิจกรรมทุกอย่างในวงการบันเทิงตั้งแต่เดือนกรกฎาคม ปี 2020 หลังถูกสาว “ควอน มินอา” เพื่อนร่วมวง AOA แฉว่าถูกเธอบูลลี่ จนกลายเป็นข่าวฉาวสนั่นวงการบันเทิงแดนกิมจิอยู่พักใหญ่ กระทั่งในที่สุดสาว “จีมิน” ก็ต้องโพสต์ขอโทษผ่านอินสตาแกรมเมื่อวันที่ 4 กรกฎาคม 2020 แล้วเก็บตัวเงียบกริบไม่โผล่ในโซเชียลมีเดียอีกเลย ล่าสุดสาว “จีมิน” ก็ถือฤกษ์ดีวันคล้ายวันเกิดอายุครบ 31 ปีของตัวเอง ( 8 มกราคม 2022) เซอร์ไพรส์แฟนเพลงด้วยการโพสต์คลิปเพลงใหม่ของเธอ Suddenly ในอินสตาแกรมเป็นครั้งแรกในรอบปีครึ่ง พร้อมข้อความว่า นี่คือของขวัญเซอร์ไพรส์สำหรับสุดที่รักของเธอ พร้อมแนบลิงก์ให้เข้าไปฟังเพลงของเธอกันด้วย ซึ่งในคลิปเพลงดังกล่าวเป็นภาพวิดีโอขณะเจ้าตัวเดินไปตามท้องถนนแห่งหนึ่งและได้พบเจอสิ่งต่าง ๆ โดยไม่ระบุสถานที่ว่าเป็นกรุงลอนดอนเหมือนที่เจ้าตัวเช็กอินในอินสตาแกรมหรือเปล่า  งานนี้สาว “จีมิน” จะได้รับการต้อนรับจากแฟนเพลงอย่างอบอุ่นขนาดไหน ต้องรอดูกันต่อไป.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi / IG: jiminbaby_18เข้าชม 361 ครั้งดูข่าวเพิ่มเติม งานนี้สาว “จีมิน” จะได้รับการต้อนรับจากแฟนเพลงอย่างอบอุ่นขนาดไหน ต้องรอดูกันต่อไป.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompi / IG: jiminbaby_18เข้าชม 361 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6418661": {
            "title": "ค่ายแจงสิ้นสุดสัญญา “ซูจิน” (G)I-DLE หลัง ตร.ยืนยันคู่กรณีเป็นผู้บริสุทธิ์",
            "content": "ค่าย Cube Entertainment ต้นสังกัดของนักร้องสาว “ซูจิน” อดีตสมาชิกวงเกิร์ลกรุ๊ป (G)I-DLE ออกแถลงการณ์ว่า “ซูจิน” ได้สิ้นสุดสัญญากับทางค่ายแล้ว สืบเนื่องจากเมื่อเดือนกุมภาพันธ์ปีก่อน (2021) “ซูจิน” ถูกแฉว่ามีพฤติกรรมบูลลี่กลั่นแกล้งเพื่อนสมัยเรียนมัธยม ซึ่งแม้เจ้าตัวจะยืนกรานว่าไม่ได้มีพฤติกรรมดังกล่าว แถมดำเนินคดีกลับคู่กรณีฐานใส่ร้ายหมิ่นประมาท แต่ล่าสุดเจ้าหน้าที่ตำรวจได้เผยผลการสืบสวนสอบสวนว่าคู่กรณีนักร้องสาวเป็นผู้บริสุทธิ์ ซึ่งทางค่ายก็น้อมรับผลการสอบสวนดังกล่าว “ซูจิน” แจ้งเกิดในฐานะสมาชิก 1 ใน 6 คนของเกิร์ลกรุ๊ป (G)I-DLE ในฐานะเมนแดนซ์สเต็ปเป๊ะเวอร์ หลังจากถูกแฉอย่างครึกโครมโดยมีนักแสดงสาว “ซอชินเอ” ยืนยันว่า “ซูจิน” มีพฤติกรรมบูลลี่เพื่อนจริง แม้แต่เธอเองซึ่งเรียนโรงเรียนเดียวกันก็เคยโดน “ซูจิน” กลั่นแกล้งมาแล้ว ทำให้สาว “ซูจิน” ต้องประกาศพักงานตั้งแต่เดือนมีนาคมปี 2021 ก่อนประกาศอำลาวงในเดือนสิงหาคม และในที่สุดก็ถูกค่ายประกาศสิ้นสุดสัญญาในวันที่ 5 มีนาคมที่ผ่านมา (2022) ซึ่งค่าย Cube Entertainment ระบุหลังจากนี้วง (G)IDLE จะเดินหน้าต่อกับสมาชิก 5 คนที่เหลือ โดยกำลังจะมีผลงานอัลบั้มเต็มชุดแรก I Never Die ออกมาในวันที่ 14 มีนาคมนี้.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreadispatch เข้าชม 856 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : koreadispatch  "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6415239": {
            "title": "ปังต่อไม่รอแล้วนะ “BTS” เตรียมจัดหนักคอนเสิร์ตสด 4 รอบที่ลาสเวกัส",
            "content": "หลังเสร็จสิ้นคอนเสิร์ต Permission to Dance on Stage ที่กรุงโซล บ้านเกิดในเดือนมีนาคม ทั้ง 7 หนุ่ม BTS ก็จะเหินฟ้าสู่อเมริกาอีกครั้งเพื่อร่วมลุ้นรางวัลในงานแกรมมี่ อวอร์ด ครั้งที่ 64 ซึ่งจะจัดขึ้นในวันที่ 3 เมษายนนี้ และเตรียมความพร้อมโชว์ในคอนเสิร์ตใหญ่ BTS Permission to Dance on Stage – Las Vegas ที่สนามกีฬาอัลลีเจียนสเตเดียม ในนครลาสเวลกัส ถึง 4 รอบ คือวันที่ 8-9 และ 15-16 เมษายนนี้ ซึ่งนับเป็นคอนเสิร์ตใหญ่ที่อเมริกาของพวกเขาในรอบ 4 เดือน เพราะเมื่อปลายปีก่อน หนุ่ม ๆ BTS ก็เพิ่งฝ่าโควิดไปกระหน่ำความมันส์ในคอนเสิร์ตใหญ่ถึง 4 รอบที่นครลอสแองเจลิสมาหมาด ๆ เมื่อปลายเดือนพฤศจิกายน – ธันวาคมที่ผ่านมา (2021)แต่ใครที่ซื้อบัตรคอนเสิร์ตที่ลาสเวกัสไม่ทันก็ไม่ต้องเสียใจ กำเงินไปซื้อตั๋วเครื่องบินแล้วไปนั่งเฝ้าหน้าจอยักษ์ที่ MGM แกรนด์ การ์เดน อารีนา ซึ่งอยู่ใกล้กับสนามกีฬาอัลลีเจียนสเตเดียมแทนก็ได้ หรือไม่ก็รอชมคอนเสิร์ตออนไลน์ผ่านไลฟ์สตรีมรอบวันที่ 16 เมษายนนี้ก็น่าจะมันส์พอให้หายคิดถึงหนุ่ม ๆ กันบ้างละเนอะ.-ไนน์เอ็นเตอร์เทน   ข่าว / ภาพ : yonhap / koreaherald / billboardเข้าชม 459 ครั้งดูข่าวเพิ่มเติม แต่ใครที่ซื้อบัตรคอนเสิร์ตที่ลาสเวกัสไม่ทันก็ไม่ต้องเสียใจ กำเงินไปซื้อตั๋วเครื่องบินแล้วไปนั่งเฝ้าหน้าจอยักษ์ที่ MGM แกรนด์ การ์เดน อารีนา ซึ่งอยู่ใกล้กับสนามกีฬาอัลลีเจียนสเตเดียมแทนก็ได้ หรือไม่ก็รอชมคอนเสิร์ตออนไลน์ผ่านไลฟ์สตรีมรอบวันที่ 16 เมษายนนี้ก็น่าจะมันส์พอให้หายคิดถึงหนุ่ม ๆ กันบ้างละเนอะ.-ไนน์เอ็นเตอร์เทน    ข่าว / ภาพ : yonhap / koreaherald / billboardเข้าชม 459 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6410583": {
            "title": "โควิดไม่อาจต้าน 3 สาว GFriend เปิดตัวใหม่วง Viviz เริ่มโปรโมทช่วงกักตัวเพราะป่วยโควิด-19",
            "content": "แยกวงแล้วไง? รวมตัวใหม่ก็ได้เนอะ 3 สาวอดีตสมาชิกวง GFriend ได้แก่ ชินบี , อึนฮา และ ออมจี  จึงเปลี่ยนลุกส์เปิดตัวใหม่ในนามศิลปินวงเกิร์ลกรุ๊ป Viviz  ภายใต้ชายคาสังกัดใหม่ Big Planet Made Entertainment หรือ BPM พร้อมปล่อยมินิอัลบั้มชุดแรก Beam of Prism ในวันพุธนี้ (9 กพ 2022) ซึ่งแม้ทั้ง 3 สาวจะติดเชื้อโควิด-19 กันถ้วนหน้า โดย “ออมจี” ผลตรวจเป็นบวกเมื่อวันที่ 28 มกราคม ตามด้วย “อึนฮา” ในวันที่ 30 มกราคม ก่อนที่ “ชินบี” จะได้รับผลตรวจว่าเป็นบวกเช่นกันในวันถัดมา แต่ทั้ง 3 สาวก็ได้รับการรักษาและกักตัว 7 วันตามมาตรการของสาธารณสุขเกาหลีใต้ ดังนั้นค่าย BPM จึงเดินหน้าโปรโมทอัลบั้มของพวกเธอตามกำหนดเดิม ไม่มีการเลื่อนหรือยกเลิกใด ๆ ทั้งสิ้นมินิอัลบั้ม Beam of Prism มีทั้งหมด 7 เพลง เพลงเด่นคือ Bop Bop! แนวป็อปแดนซ์ที่ผสมกลิ่นอายละตินและดิสโก โชว์พลังแดนซ์ของสาว ๆ พร้อมด้วยเส้นร้องที่เป๊ะสุด ๆ เพื่อตอกย้ำว่าพวกเธอเอ็นจอยกับดนตรีมากแค่ไหน ส่วนเพลง Love You Like สาว “ออมจี” มีส่วนร่วมในการเขียนเนื้อร้องด้วย เพราะอยากขอบคุณแฟน ๆ ที่ไม่ทิ้งกันและรอคอยการกลับมาของพวกเธออย่างยาวนาน เพราะอัลบั้มชุดสุดท้ายของ GFriend คือ Walpurgis Night เมื่อปี 2020 แต่การปรับตัวเหลือกันแค่ 3 คนก็ไม่ใช่เรื่องง่ายเพราะกอดคออยู่ด้วยกัน 6 คนมาตั้งแต่ปี 2015 แต่เพราะเคมีที่เข้าขากันอยู่แล้ว บวกกับพลังซัพพอร์ตจากแฟนเพลงทั่วโลกทั้ง 3 สาวจึงฮึดสู้จนพร้อมเปิดตัวในที่สุดการเปิดตัวในนามวงใหม่ครั้งนี้ เกิดขึ้นหลังจากการยุบวง GFriend ไม่ถึงปี โดยค่าย Source Music ต้นสังกัดเก่าของสาว ๆ ประกาศยุติการทำงานของวงแบบสายฟ้าแลบเมื่อวันที่ 18 พฤษภาคม ปี 2021 ซึ่งแม้ทางค่ายเลี่ยงที่จะใช้คำว่ายุบวง แต่ก็เกิดดราม่าครั้งใหญ่เพราะสาว ๆ ยังเหลือสัญญากับค่ายอีกราว 1 ปี ถึงอย่างนั้นทั้ง 6 สาวก็ข้ามผ่านดราม่าและพร้อมโชว์พลังความสดใส เดินหน้าทำงานในวงการบันเทิงกันต่อไป จึงปรับแผนการทำงานครั้งใหม่และจับมือสนับสนุนกันต่อไป โดยก่อนหน้านี้ 3 สมาชิก คือ “โซวอน” และ “เยริน” เปิดตัวในฐานะนักแสดงไปก่อนใคร ขณะที่ “ยูจู” ก็เดบิวต์เป็นศิลปินเดี่ยวในสังกัดใหม่ Konnect Entertainment เพิ่งปล่อยอัลบั้ม REC. ออกมาเมื่อวันที่ 19 มกราคมที่ผ่านมา  สาว ๆ ทุ่มสุดตัวและไม่ยอมทิ้งฝันในการเป็นศิลปินแบบนี้ แฟน ๆ เป็นกำลังใจกันด้วยน้า.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreaheraldเข้าชม 73 ครั้งดูข่าวเพิ่มเติม มินิอัลบั้ม Beam of Prism มีทั้งหมด 7 เพลง เพลงเด่นคือ Bop Bop! แนวป็อปแดนซ์ที่ผสมกลิ่นอายละตินและดิสโก โชว์พลังแดนซ์ของสาว ๆ พร้อมด้วยเส้นร้องที่เป๊ะสุด ๆ เพื่อตอกย้ำว่าพวกเธอเอ็นจอยกับดนตรีมากแค่ไหน ส่วนเพลง Love You Like สาว “ออมจี” มีส่วนร่วมในการเขียนเนื้อร้องด้วย เพราะอยากขอบคุณแฟน ๆ ที่ไม่ทิ้งกันและรอคอยการกลับมาของพวกเธออย่างยาวนาน เพราะอัลบั้มชุดสุดท้ายของ GFriend คือ Walpurgis Night เมื่อปี 2020 แต่การปรับตัวเหลือกันแค่ 3 คนก็ไม่ใช่เรื่องง่ายเพราะกอดคออยู่ด้วยกัน 6 คนมาตั้งแต่ปี 2015 แต่เพราะเคมีที่เข้าขากันอยู่แล้ว บวกกับพลังซัพพอร์ตจากแฟนเพลงทั่วโลกทั้ง 3 สาวจึงฮึดสู้จนพร้อมเปิดตัวในที่สุด การเปิดตัวในนามวงใหม่ครั้งนี้ เกิดขึ้นหลังจากการยุบวง GFriend ไม่ถึงปี โดยค่าย Source Music ต้นสังกัดเก่าของสาว ๆ ประกาศยุติการทำงานของวงแบบสายฟ้าแลบเมื่อวันที่ 18 พฤษภาคม ปี 2021 ซึ่งแม้ทางค่ายเลี่ยงที่จะใช้คำว่ายุบวง แต่ก็เกิดดราม่าครั้งใหญ่เพราะสาว ๆ ยังเหลือสัญญากับค่ายอีกราว 1 ปี ถึงอย่างนั้นทั้ง 6 สาวก็ข้ามผ่านดราม่าและพร้อมโชว์พลังความสดใส เดินหน้าทำงานในวงการบันเทิงกันต่อไป จึงปรับแผนการทำงานครั้งใหม่และจับมือสนับสนุนกันต่อไป โดยก่อนหน้านี้ 3 สมาชิก คือ “โซวอน” และ “เยริน” เปิดตัวในฐานะนักแสดงไปก่อนใคร ขณะที่ “ยูจู” ก็เดบิวต์เป็นศิลปินเดี่ยวในสังกัดใหม่ Konnect Entertainment เพิ่งปล่อยอัลบั้ม REC. ออกมาเมื่อวันที่ 19 มกราคมที่ผ่านมา  สาว ๆ ทุ่มสุดตัวและไม่ยอมทิ้งฝันในการเป็นศิลปินแบบนี้ แฟน ๆ เป็นกำลังใจกันด้วยน้า.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreaheraldเข้าชม 73 ครั้งดูข่าวเพิ่มเติม สาว ๆ ทุ่มสุดตัวและไม่ยอมทิ้งฝันในการเป็นศิลปินแบบนี้ แฟน ๆ เป็นกำลังใจกันด้วยน้า.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreaheraldเข้าชม 73 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : koreaherald "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6402868": {
            "title": "โควิดพ่นพิษ! วง ATEEZ ประกาศเลื่อนเวิลด์ทัวร์ยุโรป",
            "content": "กำลังจะไปได้สวย ฟิตซ้อมเต็มที่เพื่อเตรียมออกเวิลด์ทัวร์ในอเมริกาและยุโรปช่วงต้นปีนี้ แต่ล่าสุดค่าย MyMusicTaste ต้นสังกัดของบอยแบนด์หน้าใสกิ๊ง ATEEZ ก็ประกาศเลื่อนเวิลด์ทัวร์ในแถบยุโรป ซึ่งเดิมกำหนดไว้วันที่ 13 กุมภาพันธ์ ถึง 1 มีนาคมนี้ออกไปก่อน ส่วนสาเหตุก็เดาได้ไม่ยาก เนื่องจากสถานการณ์การแพร่ระบาดของโรคโควิด-19 สายพันธุ์โอมิครอนนั่นเอง ซึ่งทวีความรุนแรงในหลายประเทศ ขณะเดียวกันแต่ละพื้นที่ต่างก็มีมาตรการการป้องกันควบคุมโรคที่แตกต่างกันไป ทางค่ายและพาร์ตเนอร์ต่าง ๆ จึงปรึกษากันอย่างรอบคอบและเห็นว่าการเลื่อนทัวร์คอนเสิร์ต ATEEZ World Tour The Fellowship: Beginning of the End in Europe  รวมถึงกิจกรรมแจกลายเซ็นที่ลอนดอน, ปารีส, เบอร์ลิน และมาดริด ออกไปก่อนน่าจะเป็นการดีที่สุด และจะประกาศกำหนดการโชว์ครั้งใหม่ภายในสัปดาห์หน้า แต่หากใครต้องการขอคืนเงินค่าบัตรคอนเสิร์ตก็ติดต่อได้ที่จุดจำหน่ายบัตรทุกแห่งส่วนคอนเสิร์ต ATEEZ World Tour The Fellowship: Beginning of the End ซึ่งจะประเดิมเวทีในกรุงโซลบ้านเกิดช่วงสุดสัปดาห์นี้ยังจัดต่อไปตามกำหนดเดิม จากนั้นทั้ง 8 หนุ่มจะบินไประเบิดความมันส์เอาใจแฟนเพลงใน 5 เมืองใหญ่ของอเมริกา ระหว่างวันที่ 18-31 มกราคมนี้ หากสถานการณ์โควิด-19 ไม่แย่ไปกว่านี้.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompiเข้าชม 91 ครั้งดูข่าวเพิ่มเติม ส่วนคอนเสิร์ต ATEEZ World Tour The Fellowship: Beginning of the End ซึ่งจะประเดิมเวทีในกรุงโซลบ้านเกิดช่วงสุดสัปดาห์นี้ยังจัดต่อไปตามกำหนดเดิม จากนั้นทั้ง 8 หนุ่มจะบินไประเบิดความมันส์เอาใจแฟนเพลงใน 5 เมืองใหญ่ของอเมริกา ระหว่างวันที่ 18-31 มกราคมนี้ หากสถานการณ์โควิด-19 ไม่แย่ไปกว่านี้.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompiเข้าชม 91 ครั้งดูข่าวเพิ่มเติม เข้าชม 91 ครั้ง "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6420815": {
            "title": "ถึงโดนห้ามกรี๊ด ห้ามโดด แต่คอนเสิร์ตสด BTS ก็ปังปั๊วะผู้ชมทะลุ 2.4 ล้านคนทั่วโลก",
            "content": "กราบในความปังของ 7 หนุ่มบอยแบนด์สุดฮอต BTS อีกครั้ง เพราะแม้จะระเบิดความมันส์ท่ามกลางการระบาดของโรคโควิด-19 ทั้งที แต่คอนเสิร์ตสด ๆ ของพวกเขาครั้งแรกในรอบเกือบ 3 ปี Permission to Dance on Stage ที่กรุงโซลเมื่อสุดสัปดาห์ที่ผ่านมา ทลายทุกข้อจำกัดขึ้นแท่นนัมเบอร์วันอีกแล้ว เพราะแม้ว่าคอนเสิร์ตครั้งนี้จะต้องเว้นระยะห่างตามมาตรการควบคุมโรค ไม่ว่าจะเป็นการจำกัดจำนวนผู้ชมเพียง 15,000 คนต่อรอบ ทั้งที่สนามกีฬาจัมซิลสถานที่จัดงานสามารถรองรับผู้ชมได้มากกว่า 60,000 ที่นั่ง นอกจากนี้แฟนเพลงยังโดนห้ามกรี๊ด ห้ามกระโดดโลดเต้น ทำได้เพียบปรบมือด้วยอุปกรณ์มือตบเท่านั้น แต่ก็ห้ามความปังไม่อยู่ เพราะค่าย Big Hit ต้นสังกัด BTS เผยว่าคอนเสิร์ตทั้ 3 รอบ มีผู้ชมรวมกันทั้งแบบที่ชมสด ๆ ในสนามกีฬาจัมซิล และชมผ่านไลฟ์สตรีม รวมถึงชมสดในโรงภาพยนตร์ทั่วโลกปาเข้าไปกว่า 2.46 ล้านคน โดยเฉพาะผู้ชมกว่า 1.4 ล้านคนที่ตีตั๋วเข้าไปชมคอนเสิร์ตครั้งนี้ในโรงภาพยนตร์ 3,711 แห่ง ใน 75 ประเทศทั่วโลก ทำเงินให้ค่าย Big Hit ไปกว่า 32.6 ล้านเหรียญ หรือกว่า 1,075 ล้านบาท (อัตราแลกเปลี่ยน ประมาณ 1 ดอลลาร์=33 บาท)สื่อดัง Variety เผยว่า แค่เฉพาะในอเมริกาเหนือ คอนเสิร์ตครั้งนี้ของ BTS ก็ถล่มบ็อกซ์ออฟฟิศอย่างแรง กวาดเงินไปเกือบ 230 ล้านบาท เป็นรองแค่ The Batman ของพระเอกแถวหน้า “โรเบิร์ต แพททินสัน” และ Uncharted ของ “ทอม ฮอลแลนด์” เท่านั้น จากการเข้าฉาย 803 โรงภาพยนตร์ ด้วยราคาตั๋วใบละ 35 ดอลลาร์ ซึ่งแพงกว่าค่าตั๋วดูหนังปกติเกือบ 4 เท่า (ค่าตั๋วหนังโดยเฉลี่ยในอเมริกา = 9 ดอลลาร์) เรียกว่าปังจนสื่อตะวันตกยอมซูฮกเป็นครั้งที่ร้อยไปแล้วก็ว่าได้และแม้บรรยากาศจะแตกต่างไปจากทุกคอนเสิร์ตที่ผ่าน ๆ มา เพราะไร้เสียงกรี๊ดจากแฟน ๆ แต่หนุ่ม ๆ ก็ทุ่มสุดตัว โดยอาร์เอ็มบอกกับเหล่าอาร์มี่ว่าหลังจากเมื่อ 5 เดือนก่อนพวกเขาต้องเล่นคอนเสิร์ตต่อหน้ากล้องถ่ายทำเท่านั้น คราวนี้จะสร้างประวัติศาสตร์ไปด้วยกันกับคอนเสิร์ตที่ทำได้แค่เพียงปรบมือ ฟากชูก้าบอกว่าถึงจะกรี๊ดไม่ได้แต่ในที่สุดเราก็ได้มาเจอกันตัวเป็น ๆ ฟากหนุ่มวีดูจะตื่นเต้นกว่าใครเพื่อนเพราะคราวก่อนเขาต้องนั่งเก้าอี้โชว์คอนเสิร์ตเนื่องจากบาดเจ็บที่ขา มาคราวนี้ก็ได้แดนซ์เต็ม ๆ แล้ว ส่วนหนุ่มจิมินพูดขำ ๆ ว่าตอนแรกเขาแอบกังวลที่แฟน ๆ ไม่สามารถส่งเสียงกรี๊ดได้ แต่เมื่อเห็นบางคนใช้มือตบตีเข่าตัวเองแรง ๆ เขาก็เลิกกังวลไปโดยปริยาย.-ไนน์เอ็นเตอร์เทนข่าว/ ภาพ : koreaherald / koreadispatch / BigHitmusic เข้าชม 111 ครั้งดูข่าวเพิ่มเติม สื่อดัง Variety เผยว่า แค่เฉพาะในอเมริกาเหนือ คอนเสิร์ตครั้งนี้ของ BTS ก็ถล่มบ็อกซ์ออฟฟิศอย่างแรง กวาดเงินไปเกือบ 230 ล้านบาท เป็นรองแค่ The Batman ของพระเอกแถวหน้า “โรเบิร์ต แพททินสัน” และ Uncharted ของ “ทอม ฮอลแลนด์” เท่านั้น จากการเข้าฉาย 803 โรงภาพยนตร์ ด้วยราคาตั๋วใบละ 35 ดอลลาร์ ซึ่งแพงกว่าค่าตั๋วดูหนังปกติเกือบ 4 เท่า (ค่าตั๋วหนังโดยเฉลี่ยในอเมริกา = 9 ดอลลาร์) เรียกว่าปังจนสื่อตะวันตกยอมซูฮกเป็นครั้งที่ร้อยไปแล้วก็ว่าได้ และแม้บรรยากาศจะแตกต่างไปจากทุกคอนเสิร์ตที่ผ่าน ๆ มา เพราะไร้เสียงกรี๊ดจากแฟน ๆ แต่หนุ่ม ๆ ก็ทุ่มสุดตัว โดยอาร์เอ็มบอกกับเหล่าอาร์มี่ว่าหลังจากเมื่อ 5 เดือนก่อนพวกเขาต้องเล่นคอนเสิร์ตต่อหน้ากล้องถ่ายทำเท่านั้น คราวนี้จะสร้างประวัติศาสตร์ไปด้วยกันกับคอนเสิร์ตที่ทำได้แค่เพียงปรบมือ ฟากชูก้าบอกว่าถึงจะกรี๊ดไม่ได้แต่ในที่สุดเราก็ได้มาเจอกันตัวเป็น ๆ ฟากหนุ่มวีดูจะตื่นเต้นกว่าใครเพื่อนเพราะคราวก่อนเขาต้องนั่งเก้าอี้โชว์คอนเสิร์ตเนื่องจากบาดเจ็บที่ขา มาคราวนี้ก็ได้แดนซ์เต็ม ๆ แล้ว ส่วนหนุ่มจิมินพูดขำ ๆ ว่าตอนแรกเขาแอบกังวลที่แฟน ๆ ไม่สามารถส่งเสียงกรี๊ดได้ แต่เมื่อเห็นบางคนใช้มือตบตีเข่าตัวเองแรง ๆ เขาก็เลิกกังวลไปโดยปริยาย.-ไนน์เอ็นเตอร์เทนข่าว/ ภาพ : koreaherald / koreadispatch / BigHitmusic เข้าชม 111 ครั้งดูข่าวเพิ่มเติม ข่าว/ ภาพ : koreaherald / koreadispatch / BigHitmusic เข้าชม 111 ครั้ง "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6390376": {
            "title": "“ยุก ซองแจ – ฮยอนซิก BTOB” และ “จินโฮ PENTAGON” ปลดประจำการทหารแล้ว",
            "content": "สิ้นสุดการรอคอยสำหรับเหล่าแฟนคลับและทั้งสามศิลปิน เพราะในที่สุด 3 หนุ่ม “ยุก ซองแจ” และ “ฮยอนซิก” สมาชิกวง BTOB และ “จินโฮ” วง PENTAGON ก็ปลดประจำการทหารออกมาพร้อมกันเมื่อวันที่ 14 พฤศจิกายน หลังรายงานตัวเข้ากรมในวันเดียวกันคือเมื่อวันที่ 11 พฤษภาคมปีที่แล้ว (2020)ซึ่งถือว่าเป็นการปลดประจำการเร็วกว่าปกติเล็กน้อย เนื่องจากในภาวะที่มีโรคระบาดโควิด-19 ทหารเกณฑ์ที่ได้ใช้วันพักครั้งสุดท้าย ไม่ต้องกลับเข้ากรมทหารอีกเพื่อป้องกันการแพร่ระบาดของโรคโควิด-19 นั่นเอง ซึ่งทันทีที่ปลดประจำการอย่างเป็นทางการ ทั้ง 3 หนุ่มก็รายงานตัวกับเหล่าแฟนคลับทันที โดย “ซองแจ” โพสต์อินสตาแกรมว่า วันดีเดย์ ด้าน “ฮยอนซิก” โพสต์ข้อความที่เขียนด้วยลายมือตัวเองยาวเหยียดว่า เขาทำตามสัญญาแล้ว ปลดประจำการออกมาอย่างแข็งแรง ขอบคุณเหล่า “เมโลดี้” ที่รอคอยการกลับมาของเขา พร้อมสัญญาว่าจะตั้งใจทำงานให้ดีสมกับการรอคอยอันยาวนานอย่างแน่นอน เช่นเดียวกับหนุ่ม “จินโฮ” ที่ทวีตข้อความในทำนองเดียวกันงานนี้บอกเลยว่านอกจากบรรดาแฟนคลับแล้ว เพื่อน ๆ ร่วมวงก็คงแฮปปี้เช่นกันที่สมาชิกจะได้กลับมาลุยงานพร้อมหน้าพร้อมตากันอีกครั้ง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompi / IG:yook_can_do_it / IG:imhyunsik / twitterเข้าชม 324 ครั้งดูข่าวเพิ่มเติม งานนี้บอกเลยว่านอกจากบรรดาแฟนคลับแล้ว เพื่อน ๆ ร่วมวงก็คงแฮปปี้เช่นกันที่สมาชิกจะได้กลับมาลุยงานพร้อมหน้าพร้อมตากันอีกครั้ง.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : soompi / IG:yook_can_do_it / IG:imhyunsik / twitterเข้าชม 324 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6419049": {
            "title": "“มุน จุน ยอง” หัวหน้าวง ZE:A ถูกจับเมาแล้วขับ และขับรถสวนทางวันเวย์",
            "content": "ฉาวอีกครั้งสำหรับนักร้องหนุ่ม “มุน จุน ยอง” หัวหน้าวง ZE:A เพราะล่าสุด Koreadispatch  รายงานว่า เขาถูกจับฐานเมาแล้วขับและขับรถสวนทางวันเวย์ที่ย่านกังนัมและชินซาดง โดยเหตุเกิดเกือบตี 2 ของวันจันทร์ที่ผ่านมา (7 มีค 65) ยูทูบเบอร์รายหนึ่งแฉว่ามีชายคนหนึ่งขับรถสวนทางวันเวย์ เมื่อรถที่ขับสวนมาบอกให้เขาหลีกทาง เขาก็ไมยอม คู่กรณีจึงลงจากรถมาโต้เถียงกัน เลยได้รู้ว่าหนุ่มที่เมาแล้วขับคนนี้คือนักร้องดัง “มุน จุน ยอง” นั่นเอง แถมได้กลิ่นเหล้าคลุ้ง หน้าแดงก่ำ จึงแจ้งตำรวจให้มาจัดการ ซึ่งเจ้าหน้าที่ก็มาไวทันใจและให้หนุ่ม “มุน จุน ยอง” เป่าเครื่องวัดระดับแอลกอฮอล์ ปรากฏว่าสูงถึง 0.113 มิลลิกรัมเปอร์เซ็นต์ สูงกว่าเกณฑ์ที่กฎหมายเกาหลีใต้อนุญาต คือ 0.08 มิลลิกรัมเปอร์เซ็นต์ไปหลายเท่า จึงลงบันทึกประจำวันไว้แล้วให้นักร้องหนุ่มกลับบ้าน โดยจะมีหมายเรียกไปสอบสวนภายหลังนี่ไม่ใช่ครั้งแรกที่ “มุน จุน ยอง” ถูกจับฐานเมาแล้วขับ เมื่อปี 2018 เขาก็เคยถูกจับในคดีนี้มาแล้วครั้งหนึ่ง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : koreadispatct  เข้าชม 251 ครั้งดูข่าวเพิ่มเติม นี่ไม่ใช่ครั้งแรกที่ “มุน จุน ยอง” ถูกจับฐานเมาแล้วขับ เมื่อปี 2018 เขาก็เคยถูกจับในคดีนี้มาแล้วครั้งหนึ่ง.-ไนน์เอ็นเตอร์เทน ข่าว / ภาพ : koreadispatct  เข้าชม 251 ครั้งดูข่าวเพิ่มเติม "
        },
        "https://nineentertain.mcot.net/world-entertainment-update-6390047": {
            "title": "ส่งกำลังใจรัว ๆ “ชินดง ซูเปอร์จูเนียร์” ติดเชื้อโควิด-19!",
            "content": "ต้องพักงานและกักตัวเป็นการด่วนสำหรับนักร้องหนุ่ม “ชินดง” แห่งวงบอยแบนด์แถวหน้าซูเปอร์จูเนียร์ ที่ติดเชื้อโควิด-19 หลังจากสัมผัสใกล้ชิดบุคคลหนึ่งซึ่งต่อมาตรวจพบว่าติดเชื้อโควิด-19 หนุ่ม “ชินดง” จึงรีบตรวจหาเชื้อด้วยวิธี PCR ในวันที่ 10 พฤศจิกายนที่ผ่านมา และผลออกในวันรุ่งขึ้นว่าเขาพลอยติดเชื้อไปด้วย ซึ่งค่าย Label SJ ต้นสังกัดได้ออกแถลงการณ์ยืนยันแล้วว่า “ชินดง” ป่วยจริง แต่เพื่อน ๆ ร่วมวงซูเปอร์จูเนียร์คนอื่น ๆ ไม่มีความเสี่ยงใด ๆ เพราะไม่ได้เจอกับ “ชินดง” เช่นเดียวกับผู้ที่ร่วมรายการวาไรตี้โชว์ Knowing Bros ของ JTBC เทปเดียวกับ “ชินดง” ที่ไม่น่าจะจัดเป็นกลุ่มเสี่ยงเช่นกัน เพราะเขาไปถ่ายรายการนี้นานแล้วนั่นเอง.-ไนน์เอ็นเตอร์เทนข่าว / ภาพ : soompiเข้าชม 68 ครั้งดูข่าวเพิ่มเติม ข่าว / ภาพ : soompi เข้าชม 68 ครั้งดูข่าวเพิ่มเติม "
        }
    }
}