{
    "web": {
        "https://www.nme.com/news/music/pooh-shiesty-sentenced-to-five-years-in-prison-over-florida-shooting-3209449": {
            "title": "Pooh Shiesty sentenced to five years in prison over Florida shooting",
            "content": "Pooh Shiesty has been sentenced to five years in prison after pleading guilty to a single firearms conspiracy charge. The rapper – whose real name is Lontrell Donell Williams Jr. – was charged over his involvement in an October 2020 shooting at a hotel in Bay Harbor Islands in Florida. He is said to have shot a 28-year-old man in the buttocks. After Williams pleaded guilty to a single firearms conspiracy charge earlier this year, federal prosecutors dropped three additional charges that could have resulted in a lifetime prison sentence. The most serious of these charges alleged that Shiesty fired a gun during the confrontation at the Landon Hotel in Bay Harbor Islands on October 9, 2020. According to Stereogum, the rapper ultimately took a plea deal with prosecutors. He pleaded guilty to one federal charge of conspiracy to possess a firearm in furtherance of violent and drug-trafficking crimes, in exchange for the three other charges being dropped. Williams has now been sentenced to 63 months – which is equal to five years and three months – rather than the 97 months he had been facing with the three extra charges taken into account. “Listen, nobody’s happy to go to prison, but he was happy the judge listened to our argument, and the judge received the argument well. He was satisfied with the outcome,” Shiesty’s defence lawyer Bradford Cohen told Rolling Stone. “We’re happy with the decision of the court.” Pooh Shiesty (Picture: Paras Griffin/Getty Images) According to prosecutors, Williams allegedly drove a rented McLaren to the Landon Hotel on the day of the October 2020 shooting to “purchase a pair of high-end athletic sneakers and marijuana”. Video surveillance allegedly showed Williams pulling up to the hotel with another man described as his road manager riding in the front and a third man following behind them in a black Mercedes Maybach. After he accepted a bag of marijuana and examined a pair of sneakers, Williams allegedly pulled out a Draco subcompact weapon and ended up firing, hitting the alleged victim in the buttocks, investigators previously claimed. As Williams drove off, a Louis Vuitton bag stuffed with $40,912 in cash fell out of the driver’s seat of the McLaren, authorities claimed. Investigators said they linked the cash to the rapper by matching the full serial number on one of the recovered bills to a $100 bill shown on his Instagram account days before the alleged robbery. In June 2021, Pooh Shiesty was arrested in connection with a Memorial Day weekend shooting at a Miami strip club. The outcome of that case is not yet known. "
        },
        "https://www.nme.com/news/music/b-i-teases-new-global-album-project-for-2022-3209303": {
            "title": "B.I teases new “global album project” for 2022",
            "content": "Machine Gun Kelly (aka Colson Baker) has released the first trailer for Good Mourning, his directorial debut as a filmmaker.  First announced last August, it was confirmed last week that Good Mourning – a stoner comedy that Baker co-wrote, directed and stars in alongside fellow musician Mod Sun, fiancée Megan Fox and close friend Pete Davidson – will arrive on May 20. It’ll land simultaneously in cinemas and on demand, though it’s not clear as of yet which platform will host the film’s digital release. Baker stars in the film as London Clash, an actor in the midst of an existential crisis. So the logline goes, Clash’s “world is turned upside down” when, on the morning of a crucial meeting with the director of a Batman film, he “wakes up to an implied breakup text from the love of his life”.  The synopsis for Good Mourning continues: “Compounded by chaotic roommates and wildly unpredictable twists and turns, London’s day keeps going downhill until ultimately, he is forced to choose between pursuing his one true love and landing a life-changing, starring role in a major motion picture.” Watch the trailer for Good Mourning below:  In a statement shared with the announcement of the film’s release date, Open Road Films CEO Tom Ortenberg said: “We are looking forward to bringing this wild comedy to audiences in theaters and at home on demand. The film is a reminder of how fun movies can be to make and watch Colson and this incredible cast will bring audiences to their knees in laughter and leave their jaws on the floor.” The sentiment was shared by Cedar Park Studios’ Added Long, who added: “Our goal at Cedar Park Studios is to provide opportunities to fresh, creative voices in the industry and we couldn’t be more excited to be working with first-time filmmakers Colson and Mod. Bold in their approach, they have assembled a troupe of top-tier talent to join them on this hilarious ride. We’re ecstatic to be a part of their filmmaking debut.”  Good Mourning will mark Baker’s third film for 2022, following his cameo in Jackass Forever and a starring role in the music drama Taurus. It’ll also mark his third time linking up with Pete Davidson, having made cameos in Big Time Adolescence and The King Of Staten Island.   As Machine Gun Kelly, the multi-hyphenate released his sixth album, ‘Mainstream Sellout’, last month. In a four-star review of it, NME’s Ali Shutler said the album is “driven by a relatable sense of angst and its outsider anthems will continue to speak to the millions who see Machine Gun Kelly as the saviour of punk rock”. Shutler continued: “For better or worse, Baker makes no attempts to convert those who still doubt him, though. ‘Mainstream Sellout’ finds its author still refusing to play by the old rules, though it inevitably lacks the shock of the new that made ‘Tickets To My Downfall’ so exciting. Still, it seems that, like the pop-punk revival itself, Machine Gun Kelly won’t run out of steam any time soon.” B.I has announced his plans to release a “global album project” for this year. Today (April 21), a cryptic announcement video was uploaded to the singer-rapper’s YouTube channel, completely animated with a cyberpunk aesthetic that seems to signal the visual concept for the new project. At the end of the teaser, it is revealed that there are plans for a pre-release single and two EPs to be put out this year under the project, dubbed ‘Love Or Loved (LOL)’. More details are expected to arrive in the coming months.  It was first revealed in February this year that B.I has plans for singles, a global EP and tours this year, after the K-pop idol had signed a new deal with United Stated-based talent management agency Wasserman. He is also now managed by Billie Eilish‘s agent, Tom Windish, for promotions in North and South America, as well as Australia. B.I’s last music release was his six-track ‘Cosmos’ “half album” that arrived in November 2021, featuring a lead single of the same name. It was also his first project since releasing his debut solo album ‘Waterfall’ in June, which included collaborations with K-pop vocalist Lee Hi (on ‘Daydream’) and rapper Tablo of Epik High (on ‘Stay’).  In other news, TXT and Atlanta rapper Rich The Kid have dropped several cryptic hints about a potential collaboration on the group’s upcoming mini-album ‘minisode 2: Thursday’s Child’ in a series of social media posts on Weverse and Twitter. However, neither party has confirmed the rumours as of writing. The record’s tracklist will be revealed on May 1, before the album itself is released in full on May 9. "
        },
        "https://www.nme.com/news/music/big-thiefs-adrianne-lenker-asks-fans-to-stop-talking-during-support-act-sets-3209515": {
            "title": "Big Thief’s Adrianne Lenker asks fans to stop talking during support acts’ sets",
            "content": "Big Thief frontwoman Adrianne Lenker has asked fans in a video message to stop talking through their support acts’ sets. The Brooklyn band are currently out on a North American headline tour in support of their fifth studio album, ‘Dragon New Warm Mountain I Believe in You’, which came out in February via 4AD. Canadian musician and producer Kara-Lis Coverdale is currently opening for Big Thief at the ongoing concerts, per Stereogum. Earlier this week, Lenker took to Instagram to share a video message in which she outlined her “feelings r.e talking during openers and attention/creating respectful show environment in general”. “Hello, friends. Hello. This has been on my mind for a few days now. Actually, I should say this has been on my mind for a lot longer than that,” she began. “It’s really come forward in the last few days that: when music is happening in a room, there’s a performer on stage playing and doing their craft, when you enter into that space, try to be mindful of what’s happening and pay attention and don’t talk. “And if you want to talk and greet people and socialise, you can totally do that. But just when you do it in the room where a performance is going on, other people who are there to listen don’t have any say at all in what’s happening. And then suddenly the space is loud.”  A post shared by adrianne lenker (@adriannelenker)  Lenker went on to say that a sense of “real magic” is created in venues when there is silence from the audience: “Sometimes I have this feeling like, ‘If only the room were quiet, this could just be so incredible’. “Like, people are missing so much. Because every time there’s meant to be a silence, there’s all this sort of white noise chatter.” The musician then requested that those attending live gigs “be mindful” of other people when any sort of performance is taking place on stage. “Either listen or at least be quiet so that other people can listen,” she said. “Or go and put yourself elsewhere.” Lenker added: “I just think that because it’s a common space people should be able to enjoy the full breadth of what the artist has to offer. Speaking for myself, I feel that when there is quiet, it allows for so much more dynamics, and it makes me feel like I can breathe as somebody creating sound waves. “So if you can be as respectful as possible, and just mindful. Sometimes people walk in and aren’t aware of where they are. Their priority is to greet their friends or family who you’re seeing. But just look around and if there is somebody who’s on stage they’re probably, like, pouring their heart out, and it’s hard to sort of just be talked over.” She concluded: “Do your best, and I appreciate you.” You can watch the video in full above.  Big Thief are set to perform at a string of UK and European festivals this summer, including Glastonbury, Primavera Sound, Best Kept Secret and Tempelhof Sounds. You can find the band’s full live schedule here. Earlier this month, the group performed their recent single ‘Spud Infinity’ on The Tonight Show Starring Jimmy Fallon. "
        },
        "https://www.nme.com/news/music/the-kid-laroi-returns-with-new-single-and-video-thousand-miles-3209841": {
            "title": "The Kid LAROI returns with new single and video, ‘Thousand Miles’",
            "content": "The Kid LAROI has shared his first new music of 2022 – a single entitled ‘Thousand Miles’. The song, released today (April 22), is the official follow-up to last July’s ‘Stay’ with Justin Bieber. That song went on to be the most successful of LAROI’s career, hitting Number One in over 20 countries and achieving multiple Platinum certifications – including seven in his native Australia. ‘Thousand Miles’ was co-written by LAROI with Andrew Watman, Louis Bell and Billy Walsh. Bell also co-produced the song alongside longtime Post Malone collaborator Andrew Watt. Both he and Watman are working with LAROI for the first time on this song, while Walsh served as producer on LAROI’s 2021 hit ‘Without You’. A music video for ‘Thousand Miles’ was also released. Directed by Christian Breslauer, it shows LAROI being violently tortured by an evil version of himself. Identified by his blood red outfits, the evil LAROI drags his innocent counterpart (clad in all-white) down a street, drops a grand piano on him, and drives into him with a steam train. Have a look at the video below:  Prior to the release of ‘Thousand Miles’, LAROI teased the single’s release by using a snippet as audio for two separate TikToks, asking his followers to show him their “last mistake”. The first of these saw LAROI splice the footage with photos of his former manager Scooter Braun, who was relieved of his role last year only months after coming on board. The second then saw LAROI poke fun at himself, adding in an early photo of himself with a regrettable haircut. Earlier this week, a seven-second teaser for the song and its music video was posted to LAROI’s YouTube channel. The clip saw LAROI licking an ice cream cone on a park bench, before suddenly looking up and having a piano fall on top of him.  A minute-long trailer for the music video was then shared, which gave context to the previous teaser. The video, directed by Christian Breslauer, seemingly depicts two separate LAROIs – with one, donning red attire, attempting to sabotage the other that is donning white attire. The video is set to premiere on LAROI’s YouTube channel on Friday night Pacific Time (PT) in the United States. "
        },
        "https://www.nme.com/news/music/harry-styles-coachella-crowd-reportedly-surpassed-100000-people-3209342": {
            "title": "Harry Styles’ Coachella crowd reportedly surpassed 100,000 people",
            "content": "Harry Styles drew a huge audience during his headline performance at Coachella 2022 last weekend. Sources have now told Variety that at least 100,000 fans gathered at the California festival’s main stage to watch the singer top the bill on Friday night (April 15). With an official total capacity of 125,000, this year’s Coachella was listed as sold out. The remaining 20,000-plus festivalgoers are said to have attended other sets that were being hosted on Coachella’s smaller stages. Back in 2015, Kaskade was reported to have broken the record for the biggest-ever Coachella audiences across the festival’s two weekends. The exact figures from that year’s event are not available, however, and it’s therefore unclear as to whether Styles’ crowd topped that feat. Harry Styles. Credit: Kevin Mazur/Getty Images A representative for Goldenvoice – the promoters behind Coachella – declined to give out official attendance numbers to Variety. Following Styles’ bill-topping concert, Kaskade called out a tweet for allegedly “[using] a photo from my 2015 show [at Coachella]” and passing it off as “people waiting for Harry Styles”. The former One Direction singer kicked off his Coachella 2022 performance by debuting ‘As It Was’, the first single from his upcoming third solo album ‘Harry’s House’. Billie Eilish, Swedish House Mafia and The Weeknd also headlined this year’s festival.  In a four-star review of Styles’ show, NME wrote: “[…] It’s clear that he’s no longer aiming for the rock star lane, but is firmly blazing his own path through it.” The second weekend of Coachella 2022 kicks off tomorrow (April 22) in Indio, California – check out NME’s round-up of the first instalment here. "
        },
        "https://www.nme.com/news/music/man-sentenced-to-190-years-in-prison-for-murder-of-music-legend-clarence-avants-wife-jacqueline-3208800": {
            "title": "Man sentenced to 190 years in prison for murder of music legend Clarence Avant’s wife Jacqueline",
            "content": "A man has been sentenced to 190 years in prison for murdering Jacqueline Avant, the wife of legendary music executive Clarence Avant. Aariel Maynor, 30, was sentenced yesterday (April 19) after pleading guilty to murder and other charges in Los Angeles’ Superior Court last month and admitting he used an AR-15 style semi-automatic rifle to shoot Avant in her Beverly Hills home on December 1 2021, before firing several rounds at her security guard as he fled, reports Billboard. According to prosecutors, Maynor shot Avant in the back when she surprised him after he broke into the couple’s house during a burglary attempt in which he hoped to steal $50,000 (£38,288). After fleeing the scene, prosecuters claimed that he broke into a separate home in the Hollywood Hills and then accidentally shot himself in the foot as he was leaving. It was alleged that Maynor had searched for information on Clarence Avant and the couple’s address the day before the killing. Jacqueline Avant and Clarence Avant. CREDIT: Xavier Collin/Image Press Agency Jacqueline was known for her philanthropic efforts including being on the board of directors of UCLA’s International Student Center and having acted as president of the Neighbors of Watts. Her husband, Clarence, has been celebrated by artists including JAY-Z and Diddy for cultivating African American artists’ careers. He’s known for his work at Motown Records, among other labels. The Avants’ daughter Nicole is married to Netflix CEO Ted Sarandos and produced a 2019 documentary for the platform about her father titled The Black Godfather. In a statement, the Avant and Sarandos families said at the time of Jacqueline’s murder that they were grateful for the “outpouring of love, support and condolences” in the wake of the senseless tragedy.” “Jacqueline was an amazing woman, wife, mother, philanthropist, and a 55 year resident of Beverly Hills, who has made an immeasurable positive contribution and impact on the arts community,” the statement said. “She will be missed by her family, friends and all of the people she has helped throughout her amazing life.” "
        },
        "https://www.nme.com/news/music/viagra-boys-announce-new-album-cave-world-and-share-video-for-single-aint-no-thief-3208815": {
            "title": "Viagra Boys announce new album ‘Cave World’ and share video for single ‘Ain’t No Thief’",
            "content": "Viagra Boys have announced a new album, ‘Cave World’, and shared the first taster from the record, ‘Ain’t No Thief’. The follow-up to 2021’s ‘Welfare Jazz’, which has been produced by Pelle Gunnerfeldt and DJ Haydn, is released on July 8 via Year0001. You can view the full tracklisting below. According to a press release, the album is “inspired by current events”, and “aims to tear through the insanity and confusion the world currently finds itself in.” “I just wrote down, ‘Who is the true ape?’” Murphy also added in a statement. “People look down at apes as primitive life forms, but we’re just this horrible, lazy society killing each other and starting wars, while they’re able to love and feel. Does that make them the true ape or us?” The band have also shared new single ‘Ain’t No Thief’, the video for which sees frontman Sebastian Murphy playing an Evangelical preacher. You can view the clip below.  News of the new album comes just months after guitarist and founding member Benjamin Vallé died at the age of 47. The tracklisting for ‘Cave World’ is as follows: 1. ‘Baby Criminal’2. ‘Cave Hole’3. ‘Troglodyte’4. ‘Punk Rock Loser’5. ‘Creepy Crawlers’6. ‘The Cognitive Trade-Off Hypothesis’7. ‘Globe Earth’8. ‘Ain’t No Thief’9. ‘Big Boy’10. ‘ADD’11. ‘Human Error’12. ‘Return To Monke’ The band are also currently on the road in the US and are set to tour Europe and the UK next month. The dates, which you can view below, include a one off show at Kentish Town’s O2 Forum on May 11. Tickets for the US tour and European/UK can be purchased here and here. *slaps roof of upcoming LA show on 4/20*  *tickets out friday at noon : https://t.co/16cgMGPL0K* pic.twitter.com/6Ea0xLgmEp — Viagra Boys (@ViagraBoys) February 14, 2022  The band will also return for further dates in the US with Shame in September, and then Europe and the UK in December with a show pencilled in at London’s O2 Academy Brixton on January 25, 2023.  You can view the European/UK dates below: DECEMBER 20227 – Berlin – Astra8 – Karlsruhe – Substage10 – Utrecht The – Tivoli11 – Paris – Bataclan12 – Antwerp – Trix14 – Zurich – X-tra15 – Milan – Fabrique JANUARY 202320 – Nottingham – Rock City21 – Glasgow – Barrowlands23 – Dublin – Olympia24 – Cardiff – Great Hall25 – London – Brixton Academy28 – Stockholm Annexet29 – Copenhagen – Vega30 – Oslo – Rockefeller31 – Helsinki – Vanha Ylioppilastalo "
        },
        "https://www.nme.com/news/music/ed-sheeran-shares-lil-baby-remix-of-2step-with-royalties-going-to-ukraine-relief-3210230": {
            "title": "Ed Sheeran shares Lil Baby remix of ‘2step’, with royalties going to Ukraine relief",
            "content": "Ed Sheeran has teamed up with Lil Baby to share a new remix of ‘2step’ – watch the video below. The original track appeared on Sheeran’s fifth studio album ‘=’, which was released last year. This new version has arrived with an accompanying music video that was filmed in Kyiv, Ukraine before Russia began its invasion of the country in February. Sheeran has announced that all royalties from the record will be donated to the Disasters Emergency Committee (DEC) Ukraine Humanitarian Appeal, to support victims of the violence. The singer said in a press statement: “I filmed the video for ‘2step’ in the city of Kyiv, Ukraine before the devastating acts of violence started to take place. It was my first time visiting the country and I felt so welcomed during my stay there – everyone from the production crew to the many people I met across my days off. “Ukraine is a proud and resilient country and I’m grateful to have had the chance to film my video there. I stand with Ukraine and will be donating my record royalties from YouTube streams of the video to the DEC’s Ukraine Humanitarian Appeal x”  The Ukrainian production company behind the clip, Radioaktivefilm, added: “This video really reminds us of the best of times; it was the last video we did before our world fell apart. Watching it gives us some normality and happiness, and we hope you enjoy this video as much as we do right now.” Sheeran also took part in the Concert For Ukraine, which aired on ITV in March in aid of the DEC Ukraine Humanitarian Appeal. The concert raised over £12million, with the figure expected to keep rising. It was expected to bring in around £3million in funds. Multiple figures in the music industry have taken part in initiatives to support the people of Ukraine in recent weeks. Earlier this month, Sonic Youth shared a live album on their Bandcamp, featuring a set recorded in Kyiv, Ukraine on April 14, 1989, to benefit World Central Kitchen.  Pink Floyd also released their first new music in decades to aid the relief effort in Ukraine. Julian Lennon, son of John Lennon, performed ‘Imagine’ for the first time to help raise money for Ukraine. The cover was done as part Stand Up For Ukraine campaign, a global fund-raising effort broadcast from Warsaw, Poland. Portishead, IDLES and Billy Nomates have been announced for a special War Child concert in Bristol, taking place at the city’s O2 Academy on Bank Holiday Monday (May 2). All donations will help the unfolding crisis in Ukraine, while matched funding from the UK government will go to Yemen, where millions of children are also in need of protection from conflict. Ticket details can be found here. "
        },
        "https://www.nme.com/news/music/drake-granted-three-year-restraining-order-against-alleged-stalker-3209294": {
            "title": "Drake granted three-year restraining order against alleged stalker",
            "content": "Drake has reportedly been granted a three-year restraining order against an alleged stalker. According to legal documents obtained by Complex, the Canadian rapper – real name Aubrey Drake Graham – filed the order through his lawyers last month after being harassed for a number of years. Larry Stein and Ashley Yeargan, who are representing Drake, later secured a temporary restraining order for their client. It is claimed in their filing that the alleged stalker had been arrested in 2017 for trespassing on Drake’s estate in the Hollywood Hills, Los Angeles. The alleged perpetrator was subsequently identified as a 29-year-old woman called Mesha Collins. According to Drake’s legal team, Collins had sent disturbing emails to Drake referring to him and his family. In one of the alleged messages, it was suggested that Drake should shoot himself and his son. “Put a bullet through your head now bitch,” it read (via Complex). Stein and Yeargan have also accused Collins of attempting to reach Drake by filing a $4billion (£3.02billion) defamation lawsuit against the rapper, which was ultimately dismissed late last year. Los Angeles Superior Court judge Virginia Keeny declared that Collins had “not demonstrated any of defendant [Drake’s] statements were about plaintiff Collins or that he used her identity, name, or likeness in his Instagram posts or endorsements”. Drake performs live (Picture: Getty) Drake’s attorneys previously called the complaint “frivolous” and said that Collins had filed it based on “delusional figments of her imagination” in a bid to make contact with their client. Stein said the claims that Drake defamed Collins were “pure fiction”, and assured that “until he was served with this lawsuit, [Drake] had no idea who Collins was”. According to TMZ, Collins is required to stay at least 100 yards away from Drake, his four-year-old son, his mother and his father under the restraining order, which is due to expire on April 11, 2025. It is reported that Collins did not attend this week’s court hearing, but will receive “timely and proper notice” of the verdict. In other news, speculation around potential new music from Drake was sparked last month after the ‘Certified Lover Boy’ artist was pictured in a recording studio. "
        },
        "https://www.nme.com/news/music/oya-festival-confirms-full-line-up-for-2022-including-h-e-r-and-little-simz-3209358": {
            "title": "Øya Festival confirms full line-up for 2022, including H.E.R. and Little Simz",
            "content": "Øya Festival has confirmed its full line-up for 2022, with the likes of H.E.R. and Little Simz joining the bill. The Norwegian festival will return to Oslo’s Tøyenparken from August 9-13 this year, with Gorillaz, Nick Cave & The Bad Seeds and Florence + The Machine set to headline. Øya has now confirmed the final names on the line-up (which is split 50/50 between male and female artists) for their 2022 festival, with H.E.R., Little Simz, Fred Again.., Perfume Genius and Freddie Gibbs among the latest additions. Remi Wolf, Aldous Harding, Kings Of Convenience, Jenny Hval and CMAT are also set to perform at Øya in August. Øya Festival (Picture: Press) Day tickets for Øya Festival are on sale now, with weekend passes sold out. You can find those, and more information about this year’s festival, here. This year’s Øya marks the first event since 2019 after its 2020 and 2021 editions were cancelled due to the coronavirus pandemic.  Little Simz cancelled her forthcoming North American tour this week due to the “huge deficit” it would leave her in financially. “I take my live shows seriously and would only want to give you guys nothing but the best of me,” she told her followers on Instagram about the decision. “Being an independent artist, I pay for everything encompassing my live performances out of my own pocket and touring the US for a month would leave me in a huge deficit. “As much as this pains me to not see you at this time, I’m just not able to put myself through that mental stress. It’s important for me to speak my truth about this and be honest. I appreciate the love and excitement you guys have for seeing me live. Rest assured I will be there soon, back bigger and better.” "
        },
        "https://www.nme.com/news/music/no-music-on-a-dead-planet-announce-plans-for-earth-day-3208809": {
            "title": "‘No Music On A Dead Planet’ announce plans for Earth Day",
            "content": "Music Declares Emergency has announced a new partnership with music industry organisations and a number of global artists to celebrate Earth Day 2022. A week of activities have been planned that emphasise “the power of music to make real changes that benefit all life on Earth and carry the message of climate action to all corners of the globe”. “From new technologies to smarter finance, bringing the world together in song to revealing new releases from some of the biggest names in music, the week is a celebration of the ability of music to power real change,” organisers said in a statement. Under the banner ‘No Music On A Dead Planet’, some of the artists taking part include KT Tunstall, Annie Lennox, Hamilton, The Wombats, Meas Soksophea, Star Feminine Band, South Africa’s Soweto Gospel Choir, Harmony Chorus Bangalore, Stewart Sukuma, The NHS Choir and many more. The global project will see these artists take ‘Resolution Song’ and perform it for the camera to call for peace, unity, global harmony and action on climate, celebrating the differences and similarities that bring us all together. “‘Resolution Song’ is a joyous demonstration of the power of humanity when we come together,” organisers said. Find out more info here. An EP was released to DSPs last Friday (April 15), which you can hear below, and an album is set to arrive this Friday (April 22) along with access to the entire performance collection online.  There will also be “over 100 unheard, unreleased, and brand new tracks available to buy from Bandcamp in support of the most impactful climate charities”. While the full line-up of artists behind the tracks won’t be announced until 7am on Earth Day (April 22), ‘No Music On A Dead Planet’ have confirmed involvement from Brian Eno, Hot Chip, Coldplay, Murkage Dave, Declan McKenna, The Weather Station and Laura Misch. With artists to be announced on the day, organisers have announced that this inaugural song drop will be a regular feature for Earth Days in the years to come. Find out more info here. Organisations involved include Planet Resolution, EarthPercent, The Music Venue Trust, The BPI, The European Arenas Association, Evolution Music, Julie’s Bicycle, Rough Trade, Secretly Group, Beggars Group, Involved Music Group, Key Production, 4AD, Shabba Party, ecolibirum, Believe. Meanwhile, Architects have voiced their support for the Music Venue Trust and Music Declares Emergency’s campaign for music fans to #GoLocal during this week’s Earth Day. The two organisations are asking people to #GoLocal on April 22 by attending a gig in their hometown, and to either walk, cycle or use public transport to go to and from music venues. "
        },
        "https://www.nme.com/news/music/smashing-pumpkins-have-completed-their-big-and-epic-12th-album-says-jeff-schroeder-3209284": {
            "title": "Smashing Pumpkins have completed their “big” and “epic” 12th album, says Jeff Schroeder",
            "content": "According to Smashing Pumpkins’ longstanding guitarist Jeff Schroeder, the band have finished working on their “big” and “epic” 12th studio album. Word of the LP first came before the release of 2020’s ‘CYR’, when frontman Billy Corgan said it would be a sequel to both their 1995 album ‘Mellon Collie And The Infinite Sadness’ and 2000’s ‘Machina’ records. He described it at the time as “kind of a rock opera”, and confirmed last March that he and the rest of the Pumpkins had begun recording material for it. Work seemed to progress quickly, as Schroeder said last July that the band was “about halfway through” the recording process. During an appearance on the Audio Ink Radio podcast, Schroeder reconfirmed that the Pumpkins’ 12th album would end the saga started with ‘Mellon Collie’ and continued with ‘Machina’, and that it would sport a sprawling 33-song tracklist. In another interview with Audio Ink Radio, released today (April 21), Schroeder told host Anne Erickson that the as-yet-untitled album was finally completed, though he conceded that there was “nothing [he] can give details on quite yet”. He did hint that it would be released this year, though, noting that the Pumpkins had “some pretty exciting announcements [to make] at some point during [their upcoming North American tour]”. Listen to Schroeder’s full appearance on Audio Ink Radio below:  Smashing Pumpkins are due to begin their ‘Rock Invasion 2’ tour at the end of April, kicking off with an appearance at the Beale Street Music Festival in Memphis. Find dates, details and tickets for the tour here. In a three-star review of ‘CYR’, NME’s Damian Jones wrote: “For the most part, the songs furrow a similar path throughout the 20 tracks and, unlike most double albums, which are either loaded with fillers or come in two bloated parts, ‘CYR’ feels like a single complete record crammed full of pop anthems.   “Pumpkin detractors may well hate this record’s simplicity, and they’d be right to criticise it for sounding same-y to a point. But there’s no denying Corgan’s ability to craft a tune, or the fact that the return of original members James Iha and Jimmy Chamberlin has clearly brought back some of that Pumpkins chemistry of old.” "
        },
        "https://www.nme.com/news/music/seventeen-announce-studio-album-face-the-sun-release-date-details-3210192": {
            "title": "SEVENTEEN announce new studio album ‘Face The Sun’, reveal release date",
            "content": "SEVENTEEN have announced their upcoming studio album ‘Face The Sun’, and have unveiled details about the upcoming release. The K-pop group announced today (April 22) at midnight KST that their forthcoming fourth full-length album will be titled ‘Face The Sun’. SEVENTEEN also unveiled the first concept image for the comeback, along with the record’s release date of May 27 at 1pm KST/12am EST. The forthcoming arrival of the new record was first confirmed by the group’s label Pledis Entertainment in March, who at the time announced that the boyband were “preparing to make a comeback with a full-length studio album in May”. SEVENTEEN (세븐틴) 4th Album'Face the Sun' 🌤 2022.05.27 1PM (KST)🌤 2022.05.27 0AM (ET)#SEVENTEEN #세븐틴#FacetheSun pic.twitter.com/vbeplTQMY4 — 세븐틴(SEVENTEEN) (@pledis_17) April 21, 2022  The upcoming project will be SEVENTEEN’s first domestic release of 2022, and will come almost three years after their previous full-length record ‘An Ode’, which dropped in September 2019. That album featured 11 tracks, led by the title track ‘Fear’. Earlier this month, SEVENTEEN released the fully English single ‘Darl+ing’. The track is SEVENTEEN’s first-ever English single performed by all 13 members of the band, and serves as a pre-release track for the group’s full-length album. Prior to this, sub-units and solo members of the group had released songs in English. These include Vernon and Joshua on ‘2 Minus 1’ from SEVENTEEN’s most recent mini-album ‘Attacca’, which was released in May 2021, and Woozi with his solo mixtape ‘Ruby’.  SEVENTEEN recently partnered with Apple for the first-ever K-pop ‘Today at Apple’ session spotlighting ‘Darl+ing’, which will feature the members of the boyband sharing about their creative process, after which participants will be guided through using the tech company’s music creation software GarageBand. The first session ‘Music Lab: SEVENTEEN Remix’ will take place on April 15 at the Apple store in Myeongdong, Seoul. The K-pop ‘Today At Apple’ session is set to also launch in several other Apple stores across Asia. "
        },
        "https://www.nme.com/news/music/aap-rocky-arrested-in-connection-with-shooting-in-2021-3208779": {
            "title": "A$AP Rocky arrested in connection with shooting in 2021",
            "content": "A$AP Rocky has been arrested in connection with a shooting which allegedly took place in 2021. The Harlem rapper (real name Rakim Mayers) arrived at Los Angeles International Airport on a private plane from Barbados after visiting his girlfriend Rihanna, when he was detained by law enforcement officials earlier today (April 20), according to NBC News. It is alleged that Rocky had been under investigation by the Los Angeles Police Department over a shooting near Vista Del Mar and Selma Ave at around 10:20pm local time on November 6 last year. The alleged victim reportedly told police that the rapper was walking with two others and approached him with a handgun on the street before shooting him three to four times. He also claimed one of the bullets grazed his left hand. Rocky’s attorney, Alan Jackson, confirmed to NBC News that his client had been arrested. A$AP Rocky. CREDIT: Michael Campanella/Redferns/Getty Images NME has reached out for a comment from the rapper’s representatives. Rocky’s arrest comes almost three years after he was detained in Stockholm on suspicion that he and his entourage had assaulted a man. He was later released that August before being found guilty of assault and handed a suspended sentence and ordered to pay damages. A strange turn of events in the case came when US President Donald Trump appeared to get involved, along with his son-in-law Jared Kushner and a hostage negotiator from the State Department. Speaking about Trump’s involvement in a later interview, Rocky said in the documentary Stockholm Syndrome, that the involvement of the former US president “made it a little worse”. “In reality, I had no problem saying thank you to the man [Trump], especially if he helped me,” Rocky said. “That’s the narrative they pushin’: that he got me out. And he didn’t free me. If anything, he made it a little worse.” "
        },
        "https://www.nme.com/news/music/epik-high-tablo-says-big-bang-taeyang-favourite-person-to-work-with-3210235": {
            "title": "Epik High’s Tablo says Big Bang’s Taeyang is his “favourite” person to work with",
            "content": "Epik High‘s Tablo has revealed that Big Bang’s Taeyang is his “favourite” person to work with, while hinting at more to come with the K-pop idol. The Korean-American rapper had hosted an “ask me anything” (AMA) session on Twitter yesterday (April 21), where he responded to various questions from fans. “I know you collaborated [with] a lot of artists, but do you have a [favourite]?” asked one fan, to which Tablo responded with Big Bang’s Taeyang, whom he has worked with on several times before. taeyang — tablo (@blobyblo) April 20, 2022  The duo first teamed up on Tablo’s 2011 album ‘Fever’s End Pt. 2’ on the track ‘Tomorrow’, while both artists were still under YG Entertainment. Thereafter, they joined forces again on the English version of Taeyang’s hit 2014 song ‘Eyes Nose Lips’. When asked about the chances of collaborating with Taeyang on a future project again, Tablo briefly responded by saying they were “fairly high”, prompting fans to speculate that a new song from both musicians is in the works. fairly high — tablo (@blobyblo) April 20, 2022  Elsewhere during the AMA session, another fan also asked Tablo if there was an artist he has yet to collaborate with but really wants to, which he briefly answered by naming American singer-rapper Lil Nas X. Both artists have notably performed at Coachella 2022, with Tablo joined by the rest of Epik High. The Korean hip-hop trio are to return to Coachella for another performance on April 22. lil nas x — tablo (@blobyblo) April 20, 2022  In February, Epik High returned with their long-awaited record ‘Epik High Is Here 下, Part 2’, the follow-up to last year’s ‘Epik High Is Here 上, Part One’. The album dropped alongside a music video for lead single ‘Gray So Gray’, which features singer Younha, who had previously worked with the trio on their 2014 song ‘Umbrella’.  Meanwhile, Big Bang recently released their first music in four years with a single titled ‘Still Life’, with their last being their 2018 song ‘Flower Road’. Notably, it’s also the group’s first release as a quartet, following the departure of ex-member Seungri. "
        },
        "https://www.nme.com/news/music/liam-gallagher-shares-clip-of-new-song-and-video-better-days-3209806": {
            "title": "Liam Gallagher shares clip of new song and video, ‘Better Days’",
            "content": "Liam Gallagher has shared a clip of a new song and video, ‘Better Days’ – check it out below. Gallagher posted the snippet on Instagram and announced that the new song would be released tomorrow (April 21). He is due to release his third solo studio album, ‘C’mon You Know’, on May 27 via Warner. He’s so far previewed the project with two singles, ‘Everything’s Electric’ and the record’s title track. Check out the clip here:  A post shared by Liam Gallagher (@liamgallagher)  Last week, the former Oasis frontman hinted that his upcoming album will include a few ballads, despite being a rock’n’roll record overall. But, as reported in the Daily Star‘s WIRED column, he also revealed that he has some “more chilled” songs leftover which he thinks could go towards an entire album of love songs. He told the publication: “During the pandemic everyone was having a moment about how beautiful the world is and what we’ve done to it and, ‘Is this the end?’. Everyone was going through these mad things and I thought if we do get a chance to do a record maybe everyone will be coming back with these rocking records and saying how much they hate the Government and all this nonsense. “And so I thought that maybe we would come at it from a different angle, maybe we’ll do an album full of love songs, something a bit more chilled like Simon and Garfunkel kind of thing.” He continued: “There were a couple of songs like that on the go but then it went back to the mad stuff, the rock’n’roll stuff. Then it went back to the love, kind of chilled stuff and then we ended up with ‘C’mon You Know’. I reckon there’s half a record left which is a more chilled record.”  Gallagher echoed this sentiment in a recent interview with NME about the new album. “I just thought, ‘Fuck that shit – I don’t want to fucking hear about [the pandemic] ever again’, do you know what I mean? ‘Maybe we’ll come out and make a love album – really lovely; not a rock’n’roll record.’” Though he had a change of heart around the record, he noted that he would like to one day go back to that idea and complete a “trippier” album, adding: “There’s plenty of time for that.” Earlier this week, Gallagher announced his latest collaboration with Adidas and confirmed details of an intimate live show in Blackburn next week. LG will showcase the upcoming album on a string of huge headline shows this summer, including a two-night billing at Knebworth. You can find the full schedule and buy any remaining tickets here. "
        },
        "https://www.nme.com/news/music/watch-jack-white-perform-whats-the-trick-on-the-late-show-with-stephen-colbert-3209325": {
            "title": "Watch Jack White perform ‘What’s The Trick’ on ‘The Late Show with Stephen Colbert’",
            "content": "Machine Gun Kelly (aka Colson Baker) has released the first trailer for Good Mourning, his directorial debut as a filmmaker.  First announced last August, it was confirmed last week that Good Mourning – a stoner comedy that Baker co-wrote, directed and stars in alongside fellow musician Mod Sun, fiancée Megan Fox and close friend Pete Davidson – will arrive on May 20. It’ll land simultaneously in cinemas and on demand, though it’s not clear as of yet which platform will host the film’s digital release. Baker stars in the film as London Clash, an actor in the midst of an existential crisis. So the logline goes, Clash’s “world is turned upside down” when, on the morning of a crucial meeting with the director of a Batman film, he “wakes up to an implied breakup text from the love of his life”.  The synopsis for Good Mourning continues: “Compounded by chaotic roommates and wildly unpredictable twists and turns, London’s day keeps going downhill until ultimately, he is forced to choose between pursuing his one true love and landing a life-changing, starring role in a major motion picture.” Watch the trailer for Good Mourning below:  In a statement shared with the announcement of the film’s release date, Open Road Films CEO Tom Ortenberg said: “We are looking forward to bringing this wild comedy to audiences in theaters and at home on demand. The film is a reminder of how fun movies can be to make and watch Colson and this incredible cast will bring audiences to their knees in laughter and leave their jaws on the floor.” The sentiment was shared by Cedar Park Studios’ Added Long, who added: “Our goal at Cedar Park Studios is to provide opportunities to fresh, creative voices in the industry and we couldn’t be more excited to be working with first-time filmmakers Colson and Mod. Bold in their approach, they have assembled a troupe of top-tier talent to join them on this hilarious ride. We’re ecstatic to be a part of their filmmaking debut.”  Good Mourning will mark Baker’s third film for 2022, following his cameo in Jackass Forever and a starring role in the music drama Taurus. It’ll also mark his third time linking up with Pete Davidson, having made cameos in Big Time Adolescence and The King Of Staten Island.   As Machine Gun Kelly, the multi-hyphenate released his sixth album, ‘Mainstream Sellout’, last month. In a four-star review of it, NME’s Ali Shutler said the album is “driven by a relatable sense of angst and its outsider anthems will continue to speak to the millions who see Machine Gun Kelly as the saviour of punk rock”. Shutler continued: “For better or worse, Baker makes no attempts to convert those who still doubt him, though. ‘Mainstream Sellout’ finds its author still refusing to play by the old rules, though it inevitably lacks the shock of the new that made ‘Tickets To My Downfall’ so exciting. Still, it seems that, like the pop-punk revival itself, Machine Gun Kelly won’t run out of steam any time soon.” B.I has announced his plans to release a “global album project” for this year. Today (April 21), a cryptic announcement video was uploaded to the singer-rapper’s YouTube channel, completely animated with a cyberpunk aesthetic that seems to signal the visual concept for the new project. At the end of the teaser, it is revealed that there are plans for a pre-release single and two EPs to be put out this year under the project, dubbed ‘Love Or Loved (LOL)’. More details are expected to arrive in the coming months.  It was first revealed in February this year that B.I has plans for singles, a global EP and tours this year, after the K-pop idol had signed a new deal with United Stated-based talent management agency Wasserman. He is also now managed by Billie Eilish‘s agent, Tom Windish, for promotions in North and South America, as well as Australia. B.I’s last music release was his six-track ‘Cosmos’ “half album” that arrived in November 2021, featuring a lead single of the same name. It was also his first project since releasing his debut solo album ‘Waterfall’ in June, which included collaborations with K-pop vocalist Lee Hi (on ‘Daydream’) and rapper Tablo of Epik High (on ‘Stay’).  In other news, TXT and Atlanta rapper Rich The Kid have dropped several cryptic hints about a potential collaboration on the group’s upcoming mini-album ‘minisode 2: Thursday’s Child’ in a series of social media posts on Weverse and Twitter. However, neither party has confirmed the rumours as of writing. The record’s tracklist will be revealed on May 1, before the album itself is released in full on May 9. Jack White performed his song ‘What’s The Trick’ on last night’s episode of The Late Show with Stephen Colbert (April 20) – you can watch his performance and interview with Colbert below. The track is taken from the guitarist’s recently released solo album ‘Fear Of The Dawn’, the first of two LPs that are set to be released by the White Stripes musician in 2022. White and his live band delivered an electric performance of ‘What’s The Trick’ during yesterday’s episode of The Late Show following an interview with host Colbert. White spoke to Colbert about his recent on-stage marriage to Olivia Jean and recalled a piece of advice he once received from the late Prince: “Don’t let anyone tell you how to play your guitar, Jack.”  You can watch White’s performance of ‘What’s The Trick’ in the above clip, and see White’s interview with Colbert below.  White has also this week shared the Jason Lester-directed video for ‘What’s The Trick’, which you can only watch on White’s Facebook page here. The clip features a host of Nashville musicians, including Regina McCrary (of the McCrary Sisters) and the singer-songwriters Adia Victoria and Lola Kirke.  Recordings of shows from Jack White‘s ongoing world tour are currently being made available to stream or download via the live concert streaming platform Nugs.net. White’s tour will visit London for two dates in late June, with support from Chubby and The Gang and Yard Act. Any remaining tickets for the gigs are available to buy here. "
        },
        "https://www.nme.com/news/music/japans-fuji-rock-festival-adds-headliner-vampire-weekend-jpegmafia-and-more-acts-3210196": {
            "title": "Japan’s Fuji Rock Festival adds headliner Vampire Weekend, JPEGMAFIA and more acts",
            "content": "Japan’s Fuji Rock Festival has added new acts to its 2022 line-up, including headliner Vampire Weekend. Vampire Weekend, who will headline the first day of the festival, is joined by three other new additions: rapper and producer JPEGMAFIA, Mongolian metal band The Hu and Indian metal outfit Bloodywood. The four freshly added acts will join previously announced performers that include Jack White, Halsey, Foals, Bonobo, Fontaines D.C., Dinosaur Jr, Syd, Arlo Parks, Black Pumas, Tom Misch, Mura Masa, Hiatus Kaiyote, Superorganism, Japanese Breakfast, Snail Mail and more. More acts are expected to be announced in the coming weeks. ⚡️LINE UP UPDATED⚡️7/29（金）ヘッドライナーにVAMPIRE WEEKEND 決定！第2弾ラインナップ発表！≫ https://t.co/9rieugS4hR#fujirock #フジロック pic.twitter.com/aA28zyXEWl — FUJI ROCK FESTIVAL (@fujirock_jp) April 22, 2022  The annual festival, which was established in 1997, will return to Naeba Ski Resort in Niigata Prefecture from July 29 to 31 this year. Advance tickets for this year’s festival are now on sale until June 16. This marks the return of international artists to Fuji Rock Festival following a 2021 edition comprising an all-Japanese line-up. The festival was cancelled in 2020 due to the coronavirus pandemic, and screened classic sets from past years of Fuji Rock online instead. Friday, July 29: Vampire WeekendBonoboDawes Hiatus KaiyoteJonas BlueSYDD.A.N.The HuJPEGMAFIAKikagaku MoyoMichael KanekoNight TempoOGRE YOU ASSHOLEOriginal LoveSPECIAL OTHERSWONK Saturday, July 30: Jack WhiteFoalsArlo ParksBlack PumasDinosaur Jr.Tokyo Ska Paradise OrchestraBloodywoodCreativeDrugStoreThe fin.GLIM SPANKYGRAPEVINEKyoto Jazz Sextet feat. Takeo MoriyamaYoshie NakanoYuta OrisakaSoushi SakayamaSay Sue MeSherbetsSnail Mailtoconoma Sunday, July 31: HalseyMura MasaTom MischHanaregumiPUNPEEZUTOMAYOALTIN GÜNElephant GymFONTAINES D.C.go!go!vanillasIshizaki HuwieJapanese BreakfastKroiMacaroni EmpitsuKaho NakamuraNariaki ObukuroKakubarhythmHayato SuminoSUPERORGANISM "
        },
        "https://www.nme.com/news/music/shakira-returns-with-new-single-te-felicito-3210201": {
            "title": "Shakira returns with new single ‘Te Felicito’",
            "content": "Shakira has shared her new single ‘Te Felicito’ – watch the video below. ‘Te Felicito’, which translates to ‘I congratulate you’, sees Shakira teaming up with Puerto Rican singer and rapper Rauw Alejandro, in a song that fuses electro-pop and reggaeton. The track is the singer’s first single of 2022, following last year’s ‘Don’t Wait Up’, which was also her first completely English single since 2016’s ‘Try Everything’. The accompanying music video for ‘Te Felicito’, directed by Jaume de la Iguana and filmed in Barcelona, features Shakira playfully dancing in a futuristic environment with a robot. She then constructs a robot boyfriend (Alejandro), who joins in as the pair take on some robot-inspired choreography.  Shakira’s last album ‘El Dorado’ was released in 2017, and included the singles ‘Chantaje’, ‘Me Enamoré’, ‘Perro Fiel’ and ‘Trap’, the latter of which featured guest vocals from Maluma. In 2020, Shakira teamed up with Jennifer Lopez to perform at the Super Bowl halftime show. The highly praised performance at Miami’s Hard Rock Stadium saw them rattle through 20 songs in 12 minutes. “Hola Miami!” Shakira told the crowd as she opened with ‘She Wolf’. She then segued into ‘Empire’ – which saw her unexpectedly covering Led Zeppelin’s ‘Kashmir’ on a black sequinned guitar. A duet with Latin star Bad Bunny saw the pair covering Cardi B’s ‘I Like It’, before she eventually closed her set with ‘Hips Don’t Lie’. She appeared again for the finale, which was a joint performance with Lopez of ‘Waka Waka’.  Meanwhile, last year, Shakira was involved in a bizarre incident where wild boars snatched her handbag while she was relaxing in a Barcelona park. “It’s just crazy!” she reflected to Glamour of the incident as well as the social media reaction to her story. “I was taking my son, Milan, for a walk in the park and I got him a little ice cream,” she explained. “We sat on one of those park benches and we were just minding our own business. And then two huge wild boars came from the back and ambushed [us] and took my purse! And I was like, ‘Oh, my God! Oh, my God!’ and screaming, because they were taking it away, with my phone in it, my car keys, everything! Like they could understand me! And people were just watching and they weren’t doing anything!” "
        },
        "https://www.nme.com/news/music/travis-scott-hold-that-heat-first-single-since-astroworld-tragedy-3210166": {
            "title": "Travis Scott features on ‘Hold That Heat’, his first official release since Astroworld tragedy",
            "content": "Travis Scott has appeared on a widely-available single for the first time since last year’s Astroworld festival, where a tragic crowd crush led to the death of 10 people and many more injuries. ‘Hold That Heat’ is a collaboration between 808 Mafia producer Southside, rapper Future and Scott, and arrives alongside a Philip Andelman-directed video that features Scott holding an alligator on a chain. It marks Scott’s second appearance since the events of Astroworld back in November. The rapper featured on Kanye West‘s ‘Donda 2’ track ‘Pablo’, also alongside Future. As with the rest of ‘Donda 2’, the song is only officially available for listening through West’s Donda Stem Player device. Watch the video for ‘Hold That Heat’ below:  10 people were killed – with hundreds more injured – as a result of a crowd surge that took place during Scott’s headline set at Astroworld in Houston on November 5, 2021. The following month, the cause of death for all 10 victims was ruled as accidental compressive asphyxiation. In December, Scott gave his first interview since the Astroworld tragedy, telling Charlamage Tha God he had a “responsibility to figure out what happened” during the incident. Scott’s response was criticised by family members of some of the victims of the tragedy, saying the rapper should have been more proactive about stopping the set. Last month, he announced the launch of his multi-million dollar Project HEAL initiative, and said he would “always honor the victims of the Astroworld tragedy”. The rapper was accused of violating a gag order by announcing the initiative. Scott is currently facing hundreds of combined lawsuits over the events that unfolded at Astroworld. The rapper has slowly been reappearing in public life since the tragedy took place. He reportedly performed a short set at a private pre-Oscars party late last month in Bel Air, and a brief DJ set at a Coachella afterparty over the weekend.  A day prior to Astroworld, Scott released two singles, ‘Escape Plan’ and ‘Mafia’. It’s unclear if either song will feature on the rapper’s forthcoming album ‘Utopia’, details of which have not been revealed. Earlier this month, billboards teasing the album appeared in California, reading: “PSST……. Looking for UTOPIA? WRONG WAY!” along with the logo of Scott’s Cactus Jack label. "
        },
        "https://www.nme.com/news/music/chris-martin-thinks-coldplay-wont-ever-be-able-to-match-bts-collaboration-3209200": {
            "title": "Chris Martin thinks Coldplay won’t “ever be able to match” BTS collaboration",
            "content": "Chris Martin has shared some of his thoughts on ‘My Universe’, Coldplay‘s hit 2021 collaboration with BTS. In the latest episode of the Audacy podcast, the Coldplay frontman discussed future plans for the British band, revealing that they have three upcoming projects in the pipeline with “more surprises to come”. However, later during his appearance, he went on to add that he believes the forthcoming “surprises” linked to these new projects won’t be able to compare to their collaboration with K-pop juggernauts BTS on the single ‘My Universe’ in September last year. “I don’t think we’ll ever be able to match the BTS surprise,” he stated, recalling the immense success of ‘My Universe’y when it was first released. “That was surprising even for us.” Martin also recalled what the experience of collaborating with the K-pop group felt like at the time, saying: “The journey from the first time it was mentioned – I was just like ‘how could that ever work?’ – to the song itself arriving and me thinking, ‘that could be for BTS’ – to now it feeling like the most natural collaboration in the world.” “It’s an amazing lesson for myself in keeping an open mind all the time, because you just never know what life or music is gonna throw you,” Martin concluded.  In other BTS news, the seven-piece announced details of a new album set for release in June earlier this week. The forthcoming record was first teased at the last of the band’s recent four-night Las Vegas residency, when a date of ‘2022.06.10’ – June 10 – came up on screen at the end of the show, alongside the tagline: “We are bulletproof.” "
        },
        "https://www.nme.com/news/music/watch-amyl-and-the-sniffers-make-their-us-television-debut-on-seth-meyers-3210217": {
            "title": "Watch Amyl and the Sniffers make their US television debut on ‘Seth Meyers’",
            "content": "Amyl and the Sniffers have made their US television debut with an appearance on Late Night With Seth Meyers, delivering a raw, blistering rendition of their song ‘Hertz’. The track is lifted from the band’s second studio album, last year’s ‘Comfort To Me’, serving as its final single. Upon its release, frontwoman Amy Taylor called the song “a daydream about being repulsed by confinement, and frustrated over being stuck in one place”. Watch Amyl and the Sniffers perform ‘Hertz’ on Seth Meyers below:  Amyl and the Sniffers are currently in the midst of a North American tour that includes appearances at Coachella and headline shows in Texas, Atlanta, San Francisco, Seattle, Chicago, Toronto, New York and more. Next month, the band will embark on a UK and European run that will include a slot at Wide Awake Festival in London, plus headline dates at O2 Academy Brixton, Bristol and Oxford. See all tour dates here. ‘Comfort To Me’, the Australian punks’ second studio album, arrived back in September of last year. In a four-star review, NME called the album “louder, sillier and at times more introspective than its predecessor” – their 2019 self-titled debut LP – “showing a more versatile side to the band”.  On May 13, the band will release an expanded edition of ‘Comfort To Me’ that features live versions of every track on the album. Recorded on the docks in Williamston, on the outskirts of the band’s home of Melbourne, the versions were initially recorded as part of a one-take, live-streamed concert film that was premiered last October. "
        },
        "https://www.nme.com/news/music/watch-the-trailer-for-machine-gun-kellys-directorial-debut-good-mourning-3209288": {
            "title": "Watch the trailer for Machine Gun Kelly’s directorial debut, ‘Good Mourning’",
            "content": "Machine Gun Kelly (aka Colson Baker) has released the first trailer for Good Mourning, his directorial debut as a filmmaker.  First announced last August, it was confirmed last week that Good Mourning – a stoner comedy that Baker co-wrote, directed and stars in alongside fellow musician Mod Sun, fiancée Megan Fox and close friend Pete Davidson – will arrive on May 20. It’ll land simultaneously in cinemas and on demand, though it’s not clear as of yet which platform will host the film’s digital release. Baker stars in the film as London Clash, an actor in the midst of an existential crisis. So the logline goes, Clash’s “world is turned upside down” when, on the morning of a crucial meeting with the director of a Batman film, he “wakes up to an implied breakup text from the love of his life”.  The synopsis for Good Mourning continues: “Compounded by chaotic roommates and wildly unpredictable twists and turns, London’s day keeps going downhill until ultimately, he is forced to choose between pursuing his one true love and landing a life-changing, starring role in a major motion picture.” Watch the trailer for Good Mourning below:  In a statement shared with the announcement of the film’s release date, Open Road Films CEO Tom Ortenberg said: “We are looking forward to bringing this wild comedy to audiences in theaters and at home on demand. The film is a reminder of how fun movies can be to make and watch Colson and this incredible cast will bring audiences to their knees in laughter and leave their jaws on the floor.” The sentiment was shared by Cedar Park Studios’ Added Long, who added: “Our goal at Cedar Park Studios is to provide opportunities to fresh, creative voices in the industry and we couldn’t be more excited to be working with first-time filmmakers Colson and Mod. Bold in their approach, they have assembled a troupe of top-tier talent to join them on this hilarious ride. We’re ecstatic to be a part of their filmmaking debut.”  Good Mourning will mark Baker’s third film for 2022, following his cameo in Jackass Forever and a starring role in the music drama Taurus. It’ll also mark his third time linking up with Pete Davidson, having made cameos in Big Time Adolescence and The King Of Staten Island.   As Machine Gun Kelly, the multi-hyphenate released his sixth album, ‘Mainstream Sellout’, last month. In a four-star review of it, NME’s Ali Shutler said the album is “driven by a relatable sense of angst and its outsider anthems will continue to speak to the millions who see Machine Gun Kelly as the saviour of punk rock”. Shutler continued: “For better or worse, Baker makes no attempts to convert those who still doubt him, though. ‘Mainstream Sellout’ finds its author still refusing to play by the old rules, though it inevitably lacks the shock of the new that made ‘Tickets To My Downfall’ so exciting. Still, it seems that, like the pop-punk revival itself, Machine Gun Kelly won’t run out of steam any time soon.” "
        },
        "https://www.nme.com/news/music/warpaint-share-brooding-new-single-hips-announce-2022-north-american-tour-3210266": {
            "title": "Warpaint share brooding new single ‘Hips’, announce 2022 North American tour",
            "content": "Warpaint have shared a slinky new single titled ‘Hips’, coinciding with the news of a 14-date run of North American shows. ‘Hips’ is the third single to come from Warpaint’s upcoming fourth album, ‘Radiate Like This’ – due out on May 6 via Heirlooms/Virgin – following the release of ‘Champion’ in January and ‘Stevie’ last month. First announced back in January, ‘Radiate Like This’ will mark the LA indie rockers’ first studio album in six years; their prior effort, ‘Heads Up’, dropped in September of 2016. Listen to ‘Hips’ below:  Following a run in the UK and Europe – which ends with an appearance at this year’s Primavera Sound – Warpaint will embark on two short stints across North America. First up will be a six-date run along the east coast, with gigs booked in Philadelphia, Washington, Cambridge, Brooklyn, Toronto and Detroit. A west coast tour will follow in August, with shows spread between Santa Ana and Portland. Support for the east coast shows will come courtesy of Belief, the deep house side-project of Warpaint drummer Stella Mozgawa (alongside Bryan Hollon of Neon Neon). Tickets for all 14 of the dates go on sale tomorrow (April 23) – find them here. Speaking to NME last April, Warpaint’s Theresa Wayman shared some details about the subject matter of ‘Radiate Like This’. “There’s a song from my higher self to my lower self on there, and a song about not needing to have anchors to anything,” she said.  JULYWednesday 20 – Philadelphia, Brooklyn BowlFriday 22 – Washington, Capital TurnaroundSaturday 23 – Cambridge, The SinclairSunday 24 – Brooklyn, Brooklyn MadeWednesday 27 – Toronto, Opera HouseThursday 28 – Detroit, El Club AUGUSTThursday 18 – Santa Ana, The ObservatoryFriday 19 – Los Angeles, The Ford TheatreSaturday 20 – Las Vegas, Psycho FestivalMonday 22 – Berkeley, The UC TheatreTuesday 23 – Sacramento, Ace Of SpadesThursday 25 – Seattle, The CrocodileFriday 26 – Vancouver, The Commodore BallroomSaturday 27 – Portland, Revolution Hall "
        },
        "https://www.nme.com/news/music/baby-queen-releases-new-single-colours-of-you-from-netflix-heartstopper-nme-radar-3210933": {
            "title": "Baby Queen releases new single ‘Colours Of You’ from Netflix’s ‘Heartstopper’",
            "content": "Baby Queen has released new single ‘Colours Of You’ taken from the official soundtrack to Netflix’s Heartstopper – check it out below. The dreamy pop track is the first new material from Baby Queen since the release of 2021’s “underdog’s anthem” ‘Wannabe’. The song was written specifically for Netflix’s coming-of-age teen romance series Heartstopper. “To be asked to be a part of a story as beautiful and culturally important as Alice Oseman’s Heartstopper was unbelievable, and still feels completely surreal,” said Baby Queen (real name Bella Latham) in a statement. Listen to ‘Colours Of You’ below.    “‘Colours Of You’ is a song I wrote about one of the lead character’s journeys through the discovery and acceptance of his own sexuality. The song means a lot to me and is different to a lot of the music people have heard from me before, so I feel like I get to show a different side to myself as an artist and a writer,” she added. Speaking about the show on social media, Latham wrote: “This story is so important. I wish I’d been able to watch a show like this when I was younger, because it would have made a difference to the way I looked at myself and my own sexuality. But I am so happy that it exists now.”  Baby Queen is currently on a tour of the UK ahead of an appearance at The Great Escape Festival and a support tour with Olivia Rodrigo. Check out the remaining dates below and get tickets here. April24 Newcastle, The Cluny27 London, Electric Ballroom MAY01 Sound City, Liverpool12-14 The Great Escape, Brighton JUNE29 Cork, Ireland – Live At The Marquee (w/ Olivia Rodrigo)30 Dublin, Ireland – Fairview Park (w/ Olivia Rodrigo) JULY02 Glasgow, UK – O2 Academy Glasgow (w/ Olivia Rodrigo)03 Manchester, UK – O2 Apollo Manchester (w/ Olivia Rodrigo)04 Birmingham, UK – O2 Academy Birmingham (w/ Olivia Rodrigo)06 London, UK – Eventim Apollo (w/ Olivia Rodrigo)07 London, UK – Eventim Apollo (w/ Olivia Rodrigo) "
        },
        "https://www.nme.com/news/music/green-man-festival-adds-tune-yards-sofia-kourtesis-nia-archives-and-more-to-2022-line-up-radar-3209406": {
            "title": "Green Man Festival adds Tune-Yards, Sofia Kourtesis, Nia Archives and more to 2022 line-up",
            "content": "Green Man Festival has announced the second wave of artists for their 2022 line-up. The Brecon Beacons, Wales festival will return for its 20th anniversary event from August 18-21. With Kraftwerk, Michael Kiwanuka, Beach House, Metronomy and Bicep already set to headline this year’s festival, Green Man has now announced another wave of acts for their 2022 event. Tune-Yards, Sofia Kourtesis and Nia Archives lead the latest additions to the line-up, with Charlotte Adigéry and Bolis Pupul, Mary Lattimore, Donny Benét, Carwyn Ellis & Rio 18 (who will be accompanied by the National Orchestra of Wales), Penelope Isles, Nathan Fake and The Long Blondes also on the bill. Green Man Festival 2022 line-up poster Charles Watson, Art School Girlfriend, Cerys Hafana, Ural Thomas & The Pain, John Mouse, El Goodo, Mandrake Handshake, Joe & The Shitboys, Honeyglaze, Eli Smart, Bonnie Kemplay and Social Gathering are also set to perform. Further line-ups of music, science, film, comedy and literature will be revealed by Green Man in the coming months. Tickets for Green Man Festival 2022 have already sold out, but you can find out more information about this year’s event by heading here. “We’re so excited about Green Man’s 20th birthday, and we’re planning to celebrate his big anniversary with lots of wonderful surprises and the best party ever!” Green Man boss Fiona Stewart previously said in a statement about this year’s festival.  Last year’s Green Man Festival was headlined by Mogwai, Caribou and Fontaines D.C.. "
        },
        "https://www.nme.com/news/music/wet-leg-north-american-tour-2022-radar-3209189": {
            "title": "Wet Leg announce 13-date run of North American headline shows",
            "content": "Wet Leg have announced a string of 13 headline shows for cities in the US, Canada and Mexico, bridging the gap between a handful of festival sets and their trio of gigs supporting Florence + The Machine. Following their appearances as this year’s Lollapalooza, Mo Pop and Osheaga festivals, the Isle of Wight duo will take to the Phoenix Concert Centre in Toronto, Canada on Monday August 1. They’ll head to Vancouver next, playing the Commodore Ballroom that Thursday (August 4). After another handful of festival sets – including Outside Lands in San Francisco, as well as the Netherlands’ Lowlands – Wet Leg will return to theatres for gigs in San Antonio, New Orleans, Orlando, Atlanta, Louisville, St Louis, Kansas City, Abiquiu, Salt Lake City and Phoenix. The US stint will end with a set at the Life Is Beautiful fest in Las Vegas, with one last headline show slated for Tuesday October 4 in Mexico City. From there, the pair will head back up to the States to play in Seattle, San Francisco and San Diego with Florence + The Machine, opening for them on a run in support of their forthcoming fifth album, ‘Dance Fever’. Tickets for those shows are on sale now from here, while Wet Leg’s headline shows go on sale at 10am local time tomorrow (April 22) – find those tickets here.  HOWDY NORTH AMERICA ✨💖 We’ve only just left you but we’re coming back later this year for another big adventure. Tickets on sale Friday 💕 https://wetleg.ffm.to/live Posted by Wet Leg on Wednesday, April 20, 2022 Wet Leg released their self-titled debut album on April 8. It featured the singles ‘Chaise Longue’, ‘Wet Dream’, ‘Too Late Now’, ‘Oh No’, ‘Angelica’ and ‘Ur Mum’, and debuted at Number One in the UK after outselling Father John Misty‘s ‘Chloë And The Next 20th Century’ by a ratio of four-to-one. In a five-star review of the album, NME’s Rhian Daly said it “feels like a giddy race around a funfair, those pesky lows batted away with wit and wisecracks like a game of verbal whack-a-mole”. Daly continued in her write-up: “It rushes with liberating, infectious joy that makes you want to grab your own partner-in-crime and speed off on an adventure to find somewhere that’s, as ‘Angelica’s mantra suggests, is ‘good times all the time’. With Wet Leg as your soundtrack, it seems inevitable you’ll find that place.”  JULYFriday 29 – Chicago, Lollapalooza^Saturday 30 – Detroit, Mo Pop^Sunday 31 – Montreal, Osheaga^ AUGUSTTuesday 2 – Toronto, Phoenix Concert TheatreThursday 4 – Vancouver, Commodore BallroomFriday 5 – Happy Valley, Pickathon^Saturday 7 – San Francisco, Outside Lands^Friday 26 – Seattle, Thing Festival^Sunday 28 – Los Angeles, This Ain’t No Picnic^Tuesday 30 – San Antonio, Aztec TheatreWednesday 31 – Dallas, Here & There^ SEPTEMBERThursday 1 – New Orleans – Tipitina’s UptownSaturday 3 – Orlando, The Plaza LiveSunday 4 – Atlanta, Variety PlayhouseTuesday 6 – Louisville, Headliners Music HallWednesday 7 – St Louis, Delmar HallFriday 9 – Kansas City, The TrumanSaturday 10 – Denver, Westworld^Sunday 11 – Abiquiu, Ghost RanchTuesday 13 – Salt Lake City, The DepotThursday 15 – Phoenix, The Van BurenFriday 16 – Las Vegas, Life Is Beautiful^ OCTOBERTuesday 4 – Mexico City, LunarioThursday 6 – Seattle, Climate Pledge Arena*Sunday 9 – San Francisco, Shoreline Amphitheatre*Wednesday 12 – San Diego, Cal Coast Credit Union* ^ festival appearance* supporting Florence + The Machine "
        },
        "https://www.nme.com/news/music/sigrid-shares-new-track-with-bring-me-the-horizon-new-collaboration-bad-life-3209824": {
            "title": "Listen to Sigrid and Bring Me The Horizon’s new collaboration, ‘Bad Life’",
            "content": "Sigrid and Bring Me The Horizon have released a new collaboration together – listen to  ‘Bad Life’ below. Sigrid had teased the collaboration on TikTok last week (April 14), sharing a behind the scenes montage between BMTH frontman Oli Sykes and herself. The video was set to an audio clip of the forthcoming single, with the lyrics “It’s just a bad day/ Not a bad life” sung by the pair. It’s the first time the hardcore outfit have collaborated with the Norwegian singer-songwriter. Speaking about the track, Sigrid said: “I’m so excited about ‘Bad Life’ being out in the world with the Bring Me boys! We’re really proud of this one, and we hope it can bring some comfort. “It might not be the most likely collab, but we’ve been fans of each other for a while and we’re so happy we could collaborate on this song. And filming the video was an amazing and crazy experience in itself!” Sigrid added of the track: “It tells the story of when things are rough and it can feel like you’re never going to stop feeling sad.” Sykes added: “Jordan and myself wrote this song in lockdown, remotely. We loved the message but it wasn’t really fitting with the brief of the record we are currently creating.“When we found out Sigrid was a fan we felt like it was the perfect fit for her, although initially I was reluctant as I felt like it was such a special record. Then Sigrid asked if I’d duet with her on the track and that sealed the deal!”A statement about the collaboration explained more about how the collaboration came about. “After a chance meeting with UK rock band Bring Me The Horizon backstage [At Reading & Leeds Fesitval], they realised they were both fans of each other’s music,” the statement read. “This led to vocalist Oli Sykes and keyboardist Jordan Fish sending a demo, they all got in the studio to lay down lyrics, and the tear-stained rock ballad ‘Bad Life’ was born.”Speaking about the video to accompany the track, director Raja Verdi added: “The concept for this one shot film was to lean into the themes of having to get through the bad to eventually reach the other side – life can certainly feel like a rollercoaster sometimes.”The song marks the latest in a strong of collaborations released by BMTH. Earlier this month, the band featured on the Masked Wolf single ‘Fallout’, while March marked another team up with Machine Gun Kelly with the release of ‘maybe’. In other Sigrid news, the singer announced in March the forthcoming release of a new album, ‘How To Let Go’. Set to drop on May 6, the second studio effort serves as the follow-up to 2019’s ‘Sucker Punch’. From it, the artist has shared the singles ‘It Gets Dark’, ‘Burning Bridges’ and ‘Mirror’. "
        },
        "https://www.nme.com/news/music/jim-jarmusch-directs-cat-powers-music-video-for-pogues-cover-3209839": {
            "title": "Jim Jarmusch directs Cat Power’s music video for Pogues cover",
            "content": "Cat Power, aka Chan Marshall has today (April 21) shared a new video for her cover of The Pogues hit, ‘A Pair Of Brown Eyes’ – check out the video below. The video has been directed by Paterson director Jim Jarmusch and it’s the first time the pair have collaborated on a work together. Speaking about the project, Jarmusch said: “As someone who deeply loves Cat Power’s music, getting to collaborate with [Cat Power] on this video was like a dream come true,” “She’s so inspiring to me, of course as an artist, but she’s also just such an extraordinary person.” Watch the video here:  The track is taken from Power’s latest album, ‘Covers’, which sees the musician interpreting other people’s songs. In a review of the album, NME said: “There’s nothing in the world like a Cat Power cover version. The artist also known as Chan Marshall made herself known as one of the 21st century’s finest interpreters of other artists’ material – her re-imaginings as emotionally devastating as they are decidedly dreamlike – at the very beginning of the millennium. “…Often, cover records are dismissed as simply a bit of fun or as an indulgent aside to an artists’ original output, but when Cat Power does it, it’s nothing less than soul-nourishing.”  Meanwhile, Cat Power is among the new support acts that have been announced for Pearl Jam‘s pair of Hyde Park shows this summer. Pearl Jam will play at the BST Hyde Park series in central London on July 8 and 9, with Pixies already set to support the band on the opening night. BST Hyde Park announced a host of support acts for both shows. Cat Power, White Reaper, The Murder Capital, The Glorious Sons, Simon Townshend, La Luz, Sick Joy and Dream Nails will all play on July 8 prior to Pearl Jam’s headline slot. While Stereophonics lead the support acts on July 9, with Imelda May, The Last Internationale, La Luz, JJ Wilde and The Wild Things also set to perform. "
        },
        "https://www.nme.com/news/music/pinkpantheress-recruits-willow-for-hazy-new-single-where-you-are-radar-3210237": {
            "title": "PinkPantheress recruits Willow for hazy new single ‘Where You Are’",
            "content": "After confirming its existence earlier this month, PinkPantheress has released ‘Where You Are’ – a hazy, retro-tinged pop tune featuring Willow. ‘Where You Are’ builds on the style that PinkPantheress has become renowned for, with airy and atmospheric production, chilled-out synths and an ultra-crisp drum machine beat recalling Top 40 hits of the early 2000s. Willow’s verse adds a wealth of colour to the soundscape, her sharper and more sober tone gelling with PinkPantheress’ more angelic vocal melody. The song also samples ‘Never Let This Go’ by Paramore, appearing on their 2005 debut album, ‘All We Know Is Falling’. Paramore are credited as co-writers of ‘Where You Are’, while Skrillex and Mura Masa are listed as producers (alongside PinkPantheress herself). Listen to ‘Where You Are’ below:  The rising Bath-born, London-based artist – who recently featured in the NME 100 for 2022 – first teased the tune back in January. After sharing a preview of the track on TikTok, a fan commented: “I feel like Willow Smith needs to be on this.” PinkPantheress replied with a snippet of Willow’s verse, assuring the fan that they “have been heard”. The track was then formally announced last Monday (April 11). Earlier this year, PinkPantheress was named as the winner of BBC Radio 1’s Sound Of 2022. “I’m honestly gassed, my dad’s going to be so happy!” she told the BBC about the win. “I had self-belief from the beginning but when other people start telling you stuff like this, it genuinely keeps you going.” She also said that her fans should “expect a feature or two” in terms of new music in 2022. “I’ve been a bit of a lone wolf so far, but I’ve been really been trying to get into my collaboration bag. That’s the thing I’m most excited for.” PinkPantheress will perform at Manchester’s Parklife festival in June. The line-up for the event also features the likes of Tyler, The Creator, 50 Cent, Megan Thee Stallion, Lewis Capaldi, Bicep, Chase & Status, Loyle Carner, Jamie xx, Arlo Parks and Headie One. In February, PinkPantheress appeared alongside Lil Uzi Vert and Shygirl on Mura Masa’s ‘bbycakes’ single, a reimagining of 3 Of A Kind’s 2004 hit ‘Babycakes’. Mura Masa had previously worked with PinkPantheress as a producer, adding his touch on her track ‘Just For Me’.  Meanwhile, Willow recently joined Camila Cabello on Saturday Night Live for a performance of their collaborative track ‘Psychofreak’ – watch it here. "
        },
        "https://www.nme.com/news/music/got7-comeback-2022-new-music-full-group-may-details-spoilers-3210333": {
            "title": "GOT7 to reportedly return with new music as a full group in May",
            "content": "GOT7 are set to return as a full group with new music next month, according to new media reports. South Korean media outlet JoyNews24 reported today (April 22) that the K-pop boyband will be making a “full group comeback” this May. The news site also claimed that the group are currently in the “final stages of preparation” for a “new album”, citing unnamed music industry officials. JoyNews24 also reports that, as a result of the group’s impending comeback, solo activities for all members will be “suspended for the time being” in order for them to focus on the group’s upcoming return to music. None of the GOT7 members have officially confirmed comeback plans, as of writing, however, member BamBam did hint at the possibility on Twitter. Soon after news broke, the Thai-born singer tweeted a cryptic “7”, potentially in refence to the group. 7 — BamBam (@BamBam1A) April 22, 2022  Even prior to this tweet, BamBam has been dropping hints about a potential GOT7 comeback in recent weeks. One such incident includes a fan asking the K-pop idol about a possible timeframe for when a comeback could happen, to which Bam Bam replied by simply nodding, seemingly acknowledging the fan’s speculation. Ahgase: GOT7 comeback month – 5th/6th i.e May or JuneBambam: Nods!!Its a chaos!!! 😭💚💚#2ndPREMIUMLIVE_B_DAY3 #BamBam @BamBam1A pic.twitter.com/Px6rMYqtRI — 파비♥️ปาวี (@pviiig7) April 17, 2022  If news of GOT7’s comeback proves true, it will be their second music as a full group since all seven members had departed from longtime agency JYP Entertainment in January last year, with their first being the single ‘Encore’ in February 2021. Since leaving JYP, the members of GOT7 have embarked on new record deals and solo endeavours. In recent months, Mark Tuan has been releasing a slew of English-language solo singles in the lead up to an as-yet-unnamed album, with Jackson Wang doing the same.  Meanwhile, Yugyeom, JAY B, Youngjae and BamBam have been focusing on their solo music careers in Korea. On the other hand, Jinyoung has been involved in a number of acting projects, including roles in Yumi’s Cells and Yaksha: Ruthless Operations.  "
        },
        "https://www.nme.com/news/film/johnny-depp-once-gave-marilyn-manson-a-pill-so-that-he-would-stop-talking-so-much-3210296": {
            "title": "Johnny Depp once gave Marilyn Manson a pill “so that he would stop talking so much”",
            "content": "Johnny Depp has opened up about his drug use during his defamation suit against ex-wife Amber Heard, mentioning his interactions with Marilyn Manson. The actor has been permitted by a Virginia judge to pursue his case against his ex-wife, suing her for defamation over a 2018 Washington Post op-ed in which she wrote about surviving domestic violence. Heard did not mention Depp by name in the article, but Depp’s lawyers have argued that it falsely implies she was sexually and physically abused by Depp during their marriage. Heard has also filed a counterclaim against Depp, arguing he has created a smear campaign against her. During his cross-examination in the ongoing trial this week, Depp was asked by Heard’s lawyer about his drug use with Manson, with the intention of further delving into the actor’s history with substance abuse. “We drank together, we’ve had cocaine together maybe a couple of times,” Depp said. Heard’s lawyer then asked if pills were involved, and Depp replied with a chuckle: “I once gave Marilyn Manson a pill so that he would stop talking so much.”  Later, the lawyer showed the court a photo of a Keith Richards demo CD next to four apparent lines of cocaine and glasses of beer. There was also a box in the photo with Depp’s initials and a skull and crossbones. When Heard’s lawyer asked if the box contained cocaine, Depp said: “I can’t say that I carried cocaine in it … but it looks like it would fit some cocaine.” The trial continues, with James Franco and Elon Musk among the names set to testify. According to Deadline, Franco and Musk are being brought in to testify on behalf of Heard after Depp accused them both of having an affair with his ex-wife. Amber Heard and Johnny Depp (Picture: Getty Images) In 2020 Depp lost a libel lawsuit against The Sun, which concerned the newspaper publishing an article in April 2018 referring to him as a “wife beater”. Judge Mr Justice Nicol said in a ruling that he found the words to be “substantially true”. Depp said last year that he believes he is being boycotted by Hollywood, suggesting that the industry is taking note of his “unpleasant and messy situation”. "
        },
        "https://www.nme.com/news/music/watch-lorde-cover-the-strokes-the-end-has-no-end-in-new-york-3209143": {
            "title": "Watch Lorde cover The Strokes’ ‘The End Has No End’ in New York",
            "content": "Lorde paid tribute to New York City indie heroes The Strokes by covering their single ‘The End Has No End’ in their hometown. After covering Rosalía’s ‘Hentai’ during the first of her two shows at Radio City Music Hall in New York City, Lorde followed it up at her second show with a rendition of The Strokes’ fan favourite from their second album ‘Room On Fire’. “We’re in New York, you know? Got to do it,” Lorde told the crowd on night two before beginning a stripped-back rendition of the local indie rockers’ ‘Room On Fire’ cut, singing along to a dreamy guitar backing. Watch Lorde cover ‘The End Has No End’ at Radio City Music Hall below: LOOK AT OUR GIRL!!! Another video of Lorde covering The Stroke’s “The End Has No End” tonight in NYC #SolarPowerTour pic.twitter.com/j050eVFx8i — Lorde Updates ☀️ (@LordeUpdatesBR) April 20, 2022  Lorde is currently on the North American leg of her current world tour in support of her 2021 album, ‘Solar Power’. The New Zealand artist will head to the UK and Ireland in May and June – tickets can be found here. Following that run, she’ll perform a string of European headline dates, as well as festival appearances at Primavera and Glastonbury, before wrapping up the tour in New Zealand and Australia in 2023. ‘Solar Power’, Lorde’s third studio album, arrived back in August of last year after being previewed with its title track – which recently won Best Song In The World at this year’s BandLab NME Awards 2022 – along with ‘Stoned At The Nail Salon’ and ‘Mood Ring’.  In a five-star review of ‘Solar Power’, NME called it “an album that grows in quiet stature with every listen, new nuggets of wisdom making their way to the surface, peeking through its beautiful instrumentation that weaves a stunning, leafy tapestry”. “Few artists strike gold on every record they create but, for the third time in a row, Lorde has done it again, crafting yet another world-beater.” "
        },
        "https://www.nme.com/news/music/rush-had-to-be-dishonest-to-fans-about-neil-pearts-cancer-diagnosis-3208828": {
            "title": "Rush had to be “dishonest” to fans about Neil Peart’s cancer diagnosis",
            "content": "Trey Songz has been hit with a $5million (£3.87million) settlement demand after a fourth woman came forward to accuse him of sexual assault. In a video obtained by TMZ, Songz is seen approaching a woman and then pulling down her bikini top, exposing her breast. The woman, Megan Johnson, is demanding the settlement payment to keep the matter out of court. According to the demand letter, Johnson was having a friend take a picture of her when Songz approached her from the side, pulling down her top. “Ms. Johnson immediately pulled her top back on preparing herself for another assault,” the letter states. “With intended premeditation, [Neverson] further terrorised and humiliated Ms. Johnson with [the] degrading chant, ‘Titties in the Open’.” Johnson’s legal team claimed that since the incident, which took place in 2013, she has “engaged in self-harm, [and] suffered severe emotional distress”. Songz has faced several accusations of sexual assault throughout his career and in recent months. In 2018, he was charged over a domestic violence case – during which he claimed via Twitter that he was being “falsely accused for someone’s personal gain”. Songz also publicly responded to two separate allegations via Twitter in mid-2020, and faced a further two accusations in early 2022 – one a historical claim from basketball player Dylan Gonzalez, the other as part of a $20million lawsuit. Earlier this month, the Las Vegas Metropolitan Police Department (LVMPD) dropped an investigation into a sexual assault case pertaining to Songz, five months after it was filed. TMZ reported that a LVMPD representative had given a statement on the case, which was originally filed in November 2021 following an incident at Las Vegas hotel and resort The Cosmopolitan. The statement noted that the department’s investigation had “concluded”, and that they had “determined that no criminal charges will be filed”. “If any new evidence comes to light, the case will be reopened for further investigation,” the statement concluded. A further statement was also issued to TMZ from Songz’ attorneys, David Chesnoff and Richard Schonfeld. The pair noted that they were “pleased that Trey Songz has been cleared of wrongdoing”. Rush’s Geddy Lee has revealed that bandmate Neil Peart wanted to keep his cancer diagnosis a secret prior to his death. The visionary Hall of Fame drummer died on January 7, 2020, after quietly battling brain cancer for three years. Speaking in a new interview, Lee and Rush guitarist Alex Lifeson discussed Peart’s final years and how he wanted to keep his illness quiet, which forced the band to protect his privacy by keeping fans in the dark. “[Peart] didn’t want anyone to know [about his illness],” Lee said on Canadian talk show House Of Strombo. “He just didn’t. He wanted to keep it in the house. And we did. And that was hard. I can’t tell you it was easy, ’cause it was not easy. “And it was ongoing. His diagnosis was… he was given 18 months at the most, and it went on three and a half years. And so that was a constant flow of us going to see him, giving him support.” Lee then explained that the band had to be “dishonest” to fans in order to protect Peart’s privacy. “What his family had to live through was really difficult, so it was a lot of back-and-forth,” he said. “And when you’re in that state, it’s very hard to function normally, because you can’t talk to anybody about it, ’cause no one’s supposed to know. And so people hear rumblings and they bring things up to you, and you deflect it. And so that feels, on one hand, it feels dishonest, but on the other hand you’re being loyal to your friend. So fuck the dishonesty part. That wins.” He continued: “I would say that was the most difficult time for us to move forward, during that whole thing, because we were in this bubble of grief sort of walking towards an inevitable and terrible conclusion.”  Elsewhere in the interview, the two remaining members expressed disappointment in how things essentially ended for Rush, prior to finding out about Peart’s cancer diagnosis. “Let’s be honest, it was frustrating to end when we ended,” said Lee. “I was frustrated, because I worked so hard on that [40th anniversary] tour in terms of design and putting it all together and the whole concept of going backwards, a chronology that exposes itself or exploits itself while going back in time. And so I was really proud of it. I wanted to take it to Europe to play for the European fans, I wanted to take it to South America, and that wasn’t gonna happen.” Lifeson added: “I thought we were all playing really, really well, and I probably could have continued to do another 30 shows, and I think Geddy felt the same way. But it was becoming really difficult for Neil to play at that level, and unless he could play a hundred percent at that level, he really didn’t wanna do any more shows … And it was hard for him – a three-hour show playing the way he played. It’s a miracle that he was even able to play.” Meanwhile, Rush’s Geddy Lee has opened up on the affect of Taylor Hawkins‘ death on him, saying the Foo Fighters drummer’s passing “broke my heart”. "
        },
        "https://www.nme.com/news/music/trey-songz-facing-5million-settlement-demand-for-allegedly-exposing-womans-breast-3210368": {
            "title": "Trey Songz facing $5million settlement demand for allegedly exposing woman’s breast",
            "content": "Trey Songz has been hit with a $5million (£3.87million) settlement demand after a fourth woman came forward to accuse him of sexual assault. In a video obtained by TMZ, Songz is seen approaching a woman and then pulling down her bikini top, exposing her breast. The woman, Megan Johnson, is demanding the settlement payment to keep the matter out of court. According to the demand letter, Johnson was having a friend take a picture of her when Songz approached her from the side, pulling down her top. “Ms. Johnson immediately pulled her top back on preparing herself for another assault,” the letter states. “With intended premeditation, [Neverson] further terrorised and humiliated Ms. Johnson with [the] degrading chant, ‘Titties in the Open’.” Johnson’s legal team claimed that since the incident, which took place in 2013, she has “engaged in self-harm, [and] suffered severe emotional distress”. Songz has faced several accusations of sexual assault throughout his career and in recent months. In 2018, he was charged over a domestic violence case – during which he claimed via Twitter that he was being “falsely accused for someone’s personal gain”. Songz also publicly responded to two separate allegations via Twitter in mid-2020, and faced a further two accusations in early 2022 – one a historical claim from basketball player Dylan Gonzalez, the other as part of a $20million lawsuit. Earlier this month, the Las Vegas Metropolitan Police Department (LVMPD) dropped an investigation into a sexual assault case pertaining to Songz, five months after it was filed. TMZ reported that a LVMPD representative had given a statement on the case, which was originally filed in November 2021 following an incident at Las Vegas hotel and resort The Cosmopolitan. The statement noted that the department’s investigation had “concluded”, and that they had “determined that no criminal charges will be filed”. “If any new evidence comes to light, the case will be reopened for further investigation,” the statement concluded. A further statement was also issued to TMZ from Songz’ attorneys, David Chesnoff and Richard Schonfeld. The pair noted that they were “pleased that Trey Songz has been cleared of wrongdoing”. "
        },
        "https://www.nme.com/news/music/architects-spin-out-of-control-in-dizzying-video-for-new-track-when-we-were-young-3208791": {
            "title": "Architects spin out of control in dizzying video for new track ‘When We Were Young’",
            "content": "Fatboy Slim, Romy and Mura Masa are among the leading names who have been announced on the 2022 line-up for Glastonbury‘s Silver Hayes area. The Worthy Farm festival is set to return this year from June 22-26, with Billie Eilish, Paul McCartney and Kendrick Lamar to headline the Pyramid Stage. The latest 2022 line-up announcement from Glastonbury has been made today (April 22) for the festival’s Silver Hayes area, which offers “the best names in electronic, R&B, bass, rap, drum & bass and dub music”. As well as Fatboy Slim, Romy and Mura Masa, the likes of Berwyn, Leon Vynehall, Bad Boy Chiller Crew, Sofia Kourtesis, India Jordan, Kojey Radical, ArrDee, Gorgon City, Groove Armada (DJ set), Lava La Rue, Logic1000, Nia Archives, Potter Payper and Shy FX are all set to play at Silver Hayes this year. Glastonbury’s Silver Hayes line-up (Picture: Glastonbury / Press) You can check out the full music line-up for Glastonbury’s Silver Hayes area above. In a statement, Glastonbury confirmed that, this year, Silver Hayes will see “SONIC & WOW make a welcome return, whilst new additions come in the form of THE LONELY HEARTS CLUB – an art deco cinema structure standing over 40 foot high – and FIRMLY ROOTED, a space celebrating all things sound-system culture”.  This latest line-up announcement follows on from Glastonbury confirming the bill for their Field Of Avalon area last week. The likes of The Damned, Imelda May and John Cooper Clarke will all perform there during this year’s festival. Architects have released a brand new single called ‘When We Were Young’ – listen to the track below. The Brighton metalcore band’s soaring new record is their first new music since the release of their 2021 album, ‘For Those That Wish To Exist’. “‘When We Were Young’ is a song that recognises what is gained and what is lost as we get older,” drummer Dan Searle said of the track. “As the world unfolds around us we can become overwhelmed by its endless complexity.” He continued: “When I was 20 I thought I had the whole thing sussed, today I’m pretty sure I’ll never understand reality. We lose our innocence as we age, and although fatalism and cynicism can creep in, we also begin to shift our focus toward gratitude for existence and for those that we love.” The song comes alongside a dizzying video, directed by Searle and produced by Jamie Whymark, which sees the band set up in the centre of a rotating camera rig which captures every angle of their explosive performance. Watch the video for ‘When We Were Young’ below:  Architects are gearing up to head out on tour in the UK next month – you can see the full list of dates below and find any remaining tickets here.  Meanwhile, Architects frontman Sam Carter and his fiancé Abby Kirk have released a children’s book about their fox dog Sophia. Sophia Fox Dog Gets Adopted aims to educate children on what foster dogs go through before they find their forever homes, while also giving a voice to young people who may have been through adoption and foster care themselves. In addition to the book, the pair are also selling a Sophia plushie and a signed card from Carter and Kirk, and a paw print from Sophia.  You can purchase the book and plushie here. A large portion of the proceeds will go to Wunder Dog Rescue and Romanian Rescue Appeal to “help more dogs like Sophia find their forever families”. "
        },
        "https://www.nme.com/news/music/megan-thee-stallion-plan-b-3210135": {
            "title": "Listen to Megan Thee Stallion’s new single ‘Plan B’",
            "content": "Megan Thee Stallion has officially released her new single ‘Plan B’, after debuting it live at Coachella last weekend. During her set at Coachella, Meg introduced the track as “very motherfucking personal” to her and said it was addressed “to whom the fuck it may concern”. Prior to the performance, she tweeted that “every time I play it for a woman they start jumping and clapping”. “Ladies, love yourself, ’cause this shit could get ugly,” she raps over a ’90s hip-hop beat that samples Jodeci, Raekwon and Ghostface Killah‘s ‘Freek’n You (Remix)’. Listen below:  In March, Megan dropped a collaboration with Dua Lipa titled ‘Sweetest Pie’. Both singles are set to feature on the Houston rapper’s forthcoming second studio album, though details on that are yet to be revealed. Last month also saw Meg speak out about the “crazy double standards” that women in rap face. “I feel like we get critiqued so heavy because everybody just knows that women are the shit,” the rapper said in an appearance on Lipa’s podcast, At Your Service. “So they are looking for us to be the shit all the time.” Elsewhere in the conversation, Lipa touched on the controversy surrounding Megan and Cardi B‘s 2020 hit single ‘WAP’. “A boy could start rapping about popping pills and enjoying four women at one time, and nobody would have a problem with that. But if Megan Thee Stallion says, ‘Eat my pussy’ one time, there’s uproar,” she said. “If you get offended by a woman talking about how she likes to be pleased, then I think you need to take a step back and re-evaluate what you’re into.” ‘Good News’, Meg’s debut studio album, arrived back in November of 2020. In a four-star review, NME said the album found the rapper “determined to retain her freewheeling positivity in a difficult year”.  Last October, Meg released ‘Something For Thee Hotties’, a compilation record that features freestyles and previously-unreleased songs along with ‘Thot Shit’, which was released as a standalone single earlier that year. "
        },
        "https://www.nme.com/news/music/calvin-harris-sets-summer-release-date-for-funk-wav-bounces-vol-2-3208771": {
            "title": "Calvin Harris sets summer release date for ‘Funk Wav Bounces Vol.2’",
            "content": "Foals kicked off their 2022 tour in Edinburgh last night (April 20) and gave live debuts to their tracks ‘2am’ and ‘2001’ – you can see fan-shot footage from the gig below. The three-piece are set to continue their ‘Life Is Yours’ UK tour throughout this month and into May, with headline dates in Manchester and Leeds also set for this summer. Foals’ show at Usher Hall in Edinburgh last night saw the band perform their new tracks ‘2am’, which was released as a single back in February, and ‘2001’ live for the first time. Both songs will feature on their forthcoming new record ‘Life Is Yours’, which is set for release on June 17. You can see fan-shot footage from Foals’ Edinburgh show below.  A post shared by Charlotte (@choiroffuriesssss)   A post shared by Charlotte (@choiroffuriesssss)  New #FOALS song snippet: the title track from #LifeIsYours album, live from the Edinburgh gig at Usher Hall (20/04/22). @foals pic.twitter.com/nP2ARAIt7p — Doug (@douglashunter90) April 20, 2022    A post shared by James Wilson-Taylor (@jameswilsontaylor)  You can see Foals’ setlist from last night’s Usher Hall gig below. ‘Wake Me Up’‘Mountain At My Gates’‘The Runner’‘Olympic Airways’‘My Number’‘Black Gold’‘Exits’‘2am’‘In Degrees’‘Birch Tree’‘2001’‘Late Night’‘Spanish Sahara’‘Providence’‘Inhaler’ ‘Black Bull’‘What Went Down’‘Two Steps, Twice’ Foals’ UK tour continues in Edinburgh tonight (April 21) ahead of a run of festival appearances this summer. You can see their upcoming live dates below and find tickets here. April21 – Usher Hall, Edinburgh23 – Utilita Arena, Birmingham25 – Bonus Arena, Hull26 – O2 City Hall, Newcastle27 – Centre, Brighton29 – Olympia, London30 – Olympia, London May1 – Olympia, London2 – Olympia, London5 – Empress Ballroom, Blackpool6 – Empress Ballroom, Blackpool8 – O2 Academy Brixton, London29 – Radio 1’s Big Weekend, Coventry June22–26 – Glastonbury Festival27 – Fairview Park, Dublin29 – Sounds of the City, Castlefield Bowl, Manchester July8 – Sounds of the City, Millennium Square, Leeds9 – TRSNMT, Glasgow23 – Latitude Festival, Suffolk  Speaking to NME back in February about their upcoming new LP, Foals frontman Yannis Philippakis said that “this is our idea of a going out record”. “We were thinking about parties, club nights and being drunk on the bus at 2am trying to get home. All of it: the excitement before you go out, meeting up with your friends, the wild abandon. ‘Who’s got the pingers? Where are we going?’ This is all of that youthful excess of going out.” Calvin Harris has announced that he’ll be releasing a new album, ‘Funk Wav Bounces Vol.2’, this coming summer. Taking to Twitter this afternoon, the DJ and producer shared an image of a billboard displaying the album’s title. While not revealing the exact release date, Harris captioned the image: “Summer ’22.” His forthcoming sixth studio album will be his first in five years – his last one being the first volume of ‘Funk Wav Bounces’, which arrived in 2017. That album included the singles ‘Slide’, ‘Heatstroke’, ‘Rollin’, ‘Faking It’, and the chart-topping  ‘Feels’ featuring Pharrell, Katy Perry and Big Sean. No further info has been shared on what to expect from volume two, however, with Harris set to perform at a number of big festivals this summer it’s fair to assume that new music will be released soon, or even debuted during some of his forthcoming sets. Summer ‘22 pic.twitter.com/ojGsbIarsH — Calvin Harris (@CalvinHarris) April 20, 2022  Earlier this year Harris shared a new track called ‘Lonely’, using his Love Regenerator alias. It’s the latest in a group of records the DJ has shared since launching the alias back in January 2020. The track hears Harris collaborate with Riva Starr and Sandara Maitreya. Among the Scottish producer’s upcoming shows, he’ll play a huge Glasgow stadium show at Hampden Park in July. It will mark the first time he’s played his home country since he headlined T In The Park in 2016. Harris looks set for a busy summer of performing, with slots at EXIT Festival, Creamfields South, Sziget and the Belfast-based Belsonic all confirmed so far. He’s also set for a residency at Ushuaïa Ibiza from June through to September.  Elsewhere, he will play alongside Megan Thee Stallion on the line-up for the inaugural edition of Munich festival SUPERBLOOM. The new event will take place at the Olympiapark and Olympiastadion München in Munich, Germany across two days on September 3-4. "
        },
        "https://www.nme.com/news/music/foals-debut-new-songs-2am-and-2001-as-they-kick-off-2022-tour-in-edinburgh-setlist-3209701": {
            "title": "Foals debut new songs ‘2am’ and ‘2001’ live as they kick off 2022 tour in Edinburgh",
            "content": "Foals kicked off their 2022 tour in Edinburgh last night (April 20) and gave live debuts to their tracks ‘2am’ and ‘2001’ – you can see fan-shot footage from the gig below. The three-piece are set to continue their ‘Life Is Yours’ UK tour throughout this month and into May, with headline dates in Manchester and Leeds also set for this summer. Foals’ show at Usher Hall in Edinburgh last night saw the band perform their new tracks ‘2am’, which was released as a single back in February, and ‘2001’ live for the first time. Both songs will feature on their forthcoming new record ‘Life Is Yours’, which is set for release on June 17. You can see fan-shot footage from Foals’ Edinburgh show below.  A post shared by Charlotte (@choiroffuriesssss)   A post shared by Charlotte (@choiroffuriesssss)  New #FOALS song snippet: the title track from #LifeIsYours album, live from the Edinburgh gig at Usher Hall (20/04/22). @foals pic.twitter.com/nP2ARAIt7p — Doug (@douglashunter90) April 20, 2022    A post shared by James Wilson-Taylor (@jameswilsontaylor)  You can see Foals’ setlist from last night’s Usher Hall gig below. ‘Wake Me Up’‘Mountain At My Gates’‘The Runner’‘Olympic Airways’‘My Number’‘Black Gold’‘Exits’‘2am’‘In Degrees’‘Birch Tree’‘2001’‘Late Night’‘Spanish Sahara’‘Providence’‘Inhaler’ ‘Black Bull’‘What Went Down’‘Two Steps, Twice’ Foals’ UK tour continues in Edinburgh tonight (April 21) ahead of a run of festival appearances this summer. You can see their upcoming live dates below and find tickets here. April21 – Usher Hall, Edinburgh23 – Utilita Arena, Birmingham25 – Bonus Arena, Hull26 – O2 City Hall, Newcastle27 – Centre, Brighton29 – Olympia, London30 – Olympia, London May1 – Olympia, London2 – Olympia, London5 – Empress Ballroom, Blackpool6 – Empress Ballroom, Blackpool8 – O2 Academy Brixton, London29 – Radio 1’s Big Weekend, Coventry June22–26 – Glastonbury Festival27 – Fairview Park, Dublin29 – Sounds of the City, Castlefield Bowl, Manchester July8 – Sounds of the City, Millennium Square, Leeds9 – TRSNMT, Glasgow23 – Latitude Festival, Suffolk  Speaking to NME back in February about their upcoming new LP, Foals frontman Yannis Philippakis said that “this is our idea of a going out record”. “We were thinking about parties, club nights and being drunk on the bus at 2am trying to get home. All of it: the excitement before you go out, meeting up with your friends, the wild abandon. ‘Who’s got the pingers? Where are we going?’ This is all of that youthful excess of going out.” "
        },
        "https://www.nme.com/news/music/watch-hayley-williams-join-billie-eilish-at-coachella-2022-to-cover-paramores-misery-business-3210917": {
            "title": "Watch Hayley Williams join Billie Eilish at Coachella 2022 to cover Paramore’s ‘Misery Business’",
            "content": "Paramore‘s Hayley Williams joined Billie Eilish on stage at Coachella 2022 tonight (April 23) to perform ‘Misery Business’ – see footage below. Eilish was headlining the second weekend of the California festival at the time, with last weekend’s first edition seeing her joined onstage by Damon Albarn for two-songs – Eilish’s track ‘Getting Older’ and his Gorillaz hit, ‘Feel Good Inc’. After being introduced to the crowd by Eilish, Williams said: “This is my first Coachella. Woah! Thanks for sharing this with me – this is sick!” They then went on to perform an acoustic version of ‘Misery Business’, a song Williams and Paramore retired from their live sets back in 2018 amid an ongoing debate over whether its message was “anti-feminist.” Before playing ‘Misery Business’ one last time four years ago, Williams explained: “This is a choice that we’ve made because we feel that we should. We feel like it’s time to move away from it for a little while.” Watch the full performance from tonight’s Coachella below. hayley williams on billie eilish show at coachella! pic.twitter.com/8FB03gI7AB — ★ yelyah content ★ (@YELYAHCONTENT) April 24, 2022  Billie Eilish brings out Hayley Williams of Paramore for a performance of ‘Misery Business’ at #Coachella. pic.twitter.com/zYj9vyAuhf — Pop Base (@PopBase) April 24, 2022    Back in 2020, Williams reaffirmed her stance on the controversial lyrics of Paramore‘s breakout hit, after being made aware that the single had made its way onto Spotify’s ‘Women Of Rock’ playlist, along with her solo track ‘Simmer’. “SIMMER” is on this playlist. thx Spotify,” Williams wrote on Instagram Stories. “But so is ‘Misery Business’. I know it’s one of the band’s biggest songs but it shouldn’t be used to promote anything having to do with female empowerment or solidarity.” Elsewhere on the second weekend of Coachella 2022, Harry Styles – who headlined Friday night (April 22) – was joined by Lizzo to cover One Direction and ‘I Will Survive’, while Billie Eilish presented Girl In Red with a Norwegian Grammy and Kendrick Lamar joined Baby Keem onstage. Check back at NME all weekend for more reviews, news, interviews, photos and more from Coachella 2022.  "
        },
        "https://www.nme.com/news/music/foals-launch-their-own-holy-fire-hot-honey-hot-sauce-3208701": {
            "title": "Foals launch their own ‘Holy Fire Hot Honey’ hot sauce",
            "content": "Foals have announced the launch of their very own hot sauce, ‘Holy Fire Hot Honey’ – you can purchase the spicy condiment here. Released in collaboration with Sauce Shop, the limited edition hot honey drizzle is the brainchild of the Oxford band’s drummer Jack Bevan, who is a long-time hot sauce fan. Swapping the studio for the kitchen, Bevan devised a combination of sweet honey and habaneros before adding activated charcoal to make a unique dark elixir, “perfect for drizzling on pizzas, chicken wings, or anything else you fancy,” a press release reads. Speaking on his new sauce, the drummer said: “I’ve been a fan of Sauce Shop’s sauces for ages, so it only felt right to collaborate for Foals’ first-ever food launch. This is going to be a staple for me on our new tour and tastes amazing drizzled on anything!” The collaboration marks the band’s first foray into food products, with ‘Holy Fire Hot Honey’ set to be sold as part of the band’s official tour merchandise when Foals kick off their UK tour tonight (April 20) in Edinburgh. Hot Fire Hot Sauce. CREDIT: Sauce Shop Run by Pam and James Digva, Sauce Shop is the UK-based creative condiment maker behind ‘Brussel Sprout Ketchup’ and ’12:51′ by Chef James Cochran’s Scotch Bonnet Chilli Jam. “We feel so lucky to collaborate with Jack on his hot sauce, we are huge Foals fans and are excited to see Holy Fire Hot Honey as part of the official band merchandise,” Pam said of their collaboration with Foals. “Jack was great to work with when creating the sauce and we are so proud of our collaboration.” ‘Holy Fire Hot Honey’ is available now on sauceshop.co and amazon.co.uk for £5.99 per 190g bottle. Speaking about their 2022 UK tour in a recent interview with NME, frontman Yannis Philippakis said: “Honestly, once this new music comes out, it’s just solid good times – an explosion of energy and emotion. Come with your friends, lose your mind, enjoy the live music and fucking get down. That’s going to be the vibe.” Tickets for the remaining shows can be found here.  Earlier this month, Foals shared new single ‘Looking High’, the latest preview of the trio’s upcoming new album ‘Life Is Yours’, which is set for release on June 17. "
        },
        "https://www.nme.com/news/music/declan-mckenna-shares-limited-edition-charity-single-elephant-3210930": {
            "title": "Declan McKenna shares limited-edition charity single ‘Elephant’",
            "content": "Declan McKenna has shared new track ‘Elephant’ with all proceeds going to charity – however it’s only available for the next two weeks. Described by McKenna as a demo, ‘Elephant’ carries on the dystopian themes of 2020’s second album ‘Zeroes’ but pushes things further, taking on a more industrial vibe. The track is available until May 6 with at least £1.30 of the £1.99 price tag going to Brian Eno’s climate change charity EarthPercent. Check out the song here. Announcing it on Twitter, McKenna wrote: “A new tune ‘Elephant’ is available from Bandcamp for the next 2 weeks only. Pay what you like.” It’s the first new material McKenna has released since 2021’s standalone single ‘My House’. A new tune “Elephant” is available from bandcamp for the next 2 weeks only, all proceeds go to @earthpercentorg pay what you likeVvvVvvVhttps://t.co/8JnADL4z2f pic.twitter.com/ZEGFzkAACP — Declan mckenna (@DeclanMcKenna) April 22, 2022  Founded in 2021 by Brian Eno, EarthPercent aims “to offer simple and innovative ways for businesses and artists to donate to the most impactful organisations addressing the climate emergency”. To mark Earth Day (April 22), EarthPercent shared a list of exclusive tracks – including live versions, collaborations and previously unreleased songs – that have been donated by such artists as Coldplay, Michael Stipe, Anna Calvi and Jarvis Cocker‘s JARV IS…. Proceeds from sales of these songs will go towards funding EarthPercent’s five core areas of work: “greening music, energy transition, climate justice, legal and policy change, and protecting nature”. You can find out more about EarthPercent by heading here. “EarthPercent’s Earth Day campaign on Bandcamp brings artists together to offer exclusive tracks to their fans, to be sold on behalf of climate justice and environmental protection organisations. This is what unleashing the power of music in service of the planet looks like,” Eno said in a statement before comparing it to the ‘Free Nelson Mandela’ movement and Rock Against Racism.  In other news, Declan McKenna has been confirmed to appear at Glastonbury 2022 alongside headliners Paul McCartney, Kendrick Lamar and Billie Eilish. He’ll also be playing a headline show at London’s Royal Albert Hall on May 2, backed by a band that includes Alfie Templeman and CMAT. Get tickets here. "
        },
        "https://www.nme.com/news/music/tom-grennan-postpones-show-following-attack-in-new-york-3209835": {
            "title": "Tom Grennan postpones show following attack in New York",
            "content": "Tom Grennan has postponed an upcoming show after he was attacked following his show in New York today (April 21). A statement posted on Grenan’s social media account this evening (April 21) said Grennan was still in hospital following the “unprovoked attack and robbery”, which took place outside a Manhattan bar. A statement about the incident read: “In the early hours of this morning after Tom’s New York show he was the victim of an unprovoked attack and robbery outside a bar in Manhattan. “Tom is currently in hospital being assessed by doctors for his injuries which include a ruptured Ear, torn Ear-Drum and issue with his previously fractured jaw. “Despite this Tom is in good spirits but needs to temporarily recuperate whilst doctors assess his ability to continue with touring.” STATEMENT pic.twitter.com/Zwm3p6ebMx — Tom Grennan (@Tom_Grennan) April 21, 2022  “Tom is desperate not to let anyone down, however we have taken the precautionary decision to postpone the Washington show tomorrow to a later date, with details to follow. d”We will update on future shows should changes need to be mate. We wish to thank Tom’s incredible US fans for their support and understanding.”  Grennan shared his soaring new single, ‘Remind Me’ last month. Speaking about the track, he said: “I wanted to write a song that reminded me of a moment in my life where I realised I had given up something that was really making a difference in my life – in a good way. “It’s about reconnecting. It’s that feeling when you’re at the top of the rollercoaster and you’re like: this is the best feeling”. He also went on to explain that he’s at work now in the studio on his next album. “I have a new story to tell,” Grennan added. “I’m on a run, I’m in sixth gear.” Last year, Grennan scored his first UK Number One album with his second studio album, ‘Evering Road’. The Bedford singer-songwriter’s album debuted at the top spot with over 17,000 chart sales – 73 per cent of which were physical copies, including CD, vinyl and cassette. "
        },
        "https://www.nme.com/news/music/the-subways-share-new-song-oi-you-boy-bands-and-you-kill-my-cool-video-3208732": {
            "title": "The Subways share new song ‘Oi You Boy Bands’ and ‘You Kill My Cool’ video",
            "content": "The Subways have shared a new B-side called ‘Oi You Boy Bands’ along with a video for recent single ‘You Kill My Cool’ – check them both out below. The band announced their return earlier this month with ‘You Kill My Cool’ and the news that their fifth studio album would be out later this year. Along with the new music news, the band also revealed that, following the departure of their founding member and drummer Josh Morgan, Camille Phillips of The Ramonas will be playing drums as a permanent addition to the band’s line-up. “‘You Kill My Cool’ was written at a time when I felt love so strongly that I wanted to be consumed by it, to give myself over to it entirely,” frontman Billy Lunn said of the single. Blake Claridge, director of the video – which you can watch below – added: “I’d always wanted to do something with a perpetual motion, and in the end it was a butchered slider, many clamps, sand bags, a piece of rope, a lot of heavy lifting, a crash mat, and throwing in a Roll Rig. I like to call it the ‘Drop-Cam’ but for insurance purposes I don’t think it would catch on.” Watch The Subways’ ‘You Kill My Cool’ video and hear new B-side ‘Oi You Boy Bands’ below.   With a new record coming later this year, the band is set for a run of UK headline tour dates in September and October. Tickets will be available here now. The excursion features appearances at Truck Festival, Standon Calling, High Tide Festival, Gateways Festival and Southsea Victorious. See a full list of dates below. MAY20 – Bremen – Schlachthof21 – Braunschweig – Westand23 – Hamburg – Markthalle24 – Cologne – Kantine25 – Frankfurt – Batschkapp26 – Karlsruhe – Substage28th – Kronach – DIE FESTUNG ROCKT29th – Munch – Technikumthe JUNEJune 1st – Leipzig – UT ConnewitzJune 2nd – Dresden – BeatpolJune 3rd – Berlin – ColumbiatheatreJune 4th – Amsterdam – BitterzortJuly 2nd – Bournemouth – HIGH TIDE FESTIVALJuly 21st – Hertfordshire – STANDON CALLING FESTIVALJuly 22nd – Oxford – TRUCK FESTIVALJuly 23rd – Skipton – GATEWAYS FESTIVAL AUGUSTAugust 18th – GAMPEL OPEN AIR FESTIVALAugust 20th – CZECH REPUBLIC BRNO TRUTNOFF OPEN AIR FESTAugust 27th – SOUTHSEA VICTORIOUS FESTIVAL SEPTEMBER21 – Sunderland – Independent22 – Glasgow – King Tuts23 – Stoke – The Sugarmill24 – Manchester – O2 Ritz29 – London – Electric Ballroom30 – Brighton – Chalk OCTOBER1 – Cambridge – Mash2 – Cardiff – Clwb Ifor Bach  Last year, the band signed to Alcopop! Records and shared the first preview of their forthcoming album which will be their first since 2015’s self-titled LP, with the Black Lives Matter-inspired single ‘Fight’. “’Fight’ is a letter in two parts: a gesture of solidarity with the Black community and communities of colour, as they face their daily oppression at the hands of systemic racism,” said Lunn of the track. "
        },
        "https://www.nme.com/news/music/watch-omar-apollo-join-daniel-caesar-at-coachella-2022-to-perform-invincible-3210923": {
            "title": "Watch Omar Apollo join Daniel Caesar at Coachella 2022 to perform ‘Invincible’",
            "content": "Omar Apollo joined Daniel Caesar at weekend two of Coachella 2022 to perform their recently released collaborative single ‘Invincible’ – watch footage below. After performing his own set on the Outdoor Theatre earlier in the day, Apollo joined Caesar during his set on the Coachella Stage to run through their sleek pop song ‘Invincible’. At the end of the track, Caesar introduced Apollo to the crowd and called him “the greatest”. Check out footage below. um omar apollo came out for daniel caesar 😭😭 so weekend two is better huh pic.twitter.com/gOUZithJxF — Tomás Mier (@Tomas_Mier) April 23, 2022  Apollo released the Caesar-featuring song ‘Invincible’ in February alongside news of his debut album. ‘Ivory’ was then released earlier this month (April 8). In a four-star review of the album, NME wrote: “The arrangements are consistently lush and layered, while Apollo’s pleas of confusion, unrequited crushes and disappointments often evolve into glossy alt-R&B triumphs.” During Weekend One of Coachella 2022, Daniel Caesar brought out Justin Bieber during his ten-track set on the main stage. The pair performed their pop R&B megahit ‘Peaches’. Caesar also gave ‘Please Do Not Lean’, the lead single from his upcoming third album, its live debut. The track was officially released earlier this week (April 22) and sees the popstar teaming up with BADBADNOTGOOD.  About the new track, Caesar explained, “‘Please Do Not Lean’ represents a deeper understanding of myself and acknowledging the responsibilities I currently hold, respecting them and knowing my limits of when I can take on more. This is an introduction to the sound and tone of the next chapter in my career.” Meanwhile, following his performance at Coachella, Apollo is set to take ‘Ivory’ on the road across America and Europe, including a headline show at the soon-to-be-reopened KOKO in London.   Elsewhere at weekend two of Coachella, Billie Eilish was joined by Paramore’s Hayley Williams for an acoustic run through of ‘Misery Business’ while Harry Styles was joined by Lizzo to cover One Direction and ‘I Will Survive’. Billie Eilish also presented Girl In Red with a Norwegian Grammy while Kendrick Lamar joined Baby Keem onstage. Check back at NME all weekend for more reviews, news, interviews, photos and more from Coachella 2022.    "
        },
        "https://www.nme.com/news/music/george-harrison-widow-olivia-writes-book-of-poetry-dedicated-to-late-beatle-3209717": {
            "title": "George Harrison’s widow Olivia writes poetry book dedicated to late Beatle",
            "content": "George Harrison‘s widow Olivia has written a book of poetry dedicated to her late husband. The collection, titled Came The Lightening, contains 20 poems that Olivia penned to George following his death in 2001. The work is set for publication on June 21 via Genesis Publications and is available to pre-order here. In a statement about the work, Olivia said: “Here on the shore, 20 years later, my message in a bottle has reached dry land. Words about our life, his death but mostly love and our journey to the end.” According to a statement from Genesis Publications, the poems will explore “the intimacy and emotional connection” of the Harrisons’ relationship, as well as “delve into the phenomenon of losing a partner and the passage of time”. The collection will also contain some never-before-seen images of the couple. My book of 20 poems for George, in the 20th year of his passing, will be released on June 21st. ☀ I hope you enjoy these personal stories, recollections and reflections. Olivia Harrison Pre-order here – https://t.co/IXlIJndsPs pic.twitter.com/UjIJjOb2ql — George Harrison (@GeorgeHarrison) April 21, 2022  Martin Scorsese, who directed a wide-ranging documentary about George called Living in the Material World and who has written the introduction to the book, said: “Olivia evokes the most fleeting gestures and instants, plucked from the flow of time and memory and felt through her choice of words and the overall rhythm. “She might have done an oral history or a memoir. Instead, she composed a work of poetic autobiography.”  A Beatles fan recently turned George Harrison’s childhood home into an Airbnb and a “living museum”. Ken Lambert bought the property at 25 Upton Green in the suburb of Speke, Liverpool last November for around £171,000. According to the listing, Harrison lived at the three-bedroom house between 1949 and 1962. The house was also used as a practice space for The Beatles, then known as The Quarrymen. "
        },
        "https://www.nme.com/news/music/psy-bae-suzy-celeb-single-music-video-3209275": {
            "title": "Psy drops music video teaser for new song ‘Celeb’, starring Bae Suzy",
            "content": "The Kid LAROI has shared his first new music of 2022 – a single entitled ‘Thousand Miles’. The song, released today (April 22), is the official follow-up to last July’s ‘Stay’ with Justin Bieber. That song went on to be the most successful of LAROI’s career, hitting Number One in over 20 countries and achieving multiple Platinum certifications – including seven in his native Australia. ‘Thousand Miles’ was co-written by LAROI with Andrew Watman, Louis Bell and Billy Walsh. Bell also co-produced the song alongside longtime Post Malone collaborator Andrew Watt. Both he and Watman are working with LAROI for the first time on this song, while Walsh served as producer on LAROI’s 2021 hit ‘Without You’. A music video for ‘Thousand Miles’ was also released. Directed by Christian Breslauer, it shows LAROI being violently tortured by an evil version of himself. Identified by his blood red outfits, the evil LAROI drags his innocent counterpart (clad in all-white) down a street, drops a grand piano on him, and drives into him with a steam train. Have a look at the video below:  Prior to the release of ‘Thousand Miles’, LAROI teased the single’s release by using a snippet as audio for two separate TikToks, asking his followers to show him their “last mistake”. The first of these saw LAROI splice the footage with photos of his former manager Scooter Braun, who was relieved of his role last year only months after coming on board. The second then saw LAROI poke fun at himself, adding in an early photo of himself with a regrettable haircut. Earlier this week, a seven-second teaser for the song and its music video was posted to LAROI’s YouTube channel. The clip saw LAROI licking an ice cream cone on a park bench, before suddenly looking up and having a piano fall on top of him.  A minute-long trailer for the music video was then shared, which gave context to the previous teaser. The video, directed by Christian Breslauer, seemingly depicts two separate LAROIs – with one, donning red attire, attempting to sabotage the other that is donning white attire. The video is set to premiere on LAROI’s YouTube channel on Friday night Pacific Time (PT) in the United States. Psy has dropped a teaser for the music video of an upcoming track titled ‘Celeb’, starring former Miss A member Bae Suzy. The South Korean unveiled the eccentric visual at midnight KST today (April 21), where both Bae and Psy are seen performing snippets of the song’s choreography in the middle of a Psy-themed amusement park. “You so popular / Be my formula / May I call you a celeb?” Psy sings in English in the 20-second teaser. ‘Celeb’ is a cut from Psy’s upcoming ninth full-length album ‘Psy 9th’, which will be his first release after a five-year absence from music. ‘Celeb’, along with the album, is due out on April 29 at 6pm KST.    Notably, ‘Celeb’ and its music video first premiered in-person nearly three years ago during Psy’s ‘Summer Swag 2019’ concert, where it was revealed that Psy and rapper Zico co-wrote and -composed the song. However, ‘Celeb”s inclusion in ‘Psy 9th’ will be the first time the song will be released officially. ‘Celeb’ is the latest track from the forthcoming record to have been revealed so far, following ‘Happier’ featuring K-R&B singer Crush, and a remake of Jermaine Jackson and Pia Zadora’s 1984 hit single ‘When The Rain Begins To Fall’ with MAMAMOO member Hwasa. Psy is also set to work with Epik High‘s Tablo, Heize, Sung Si-kyung and more.  A year after the release of Psy’s eighth full-length album ‘Psy 8th 4X2=8’ in 2017, the singer left longtime agency YG Entertainment. He later established his own company P Nation in early 2019, and in the same year he signed Korean-American rapper and singer Jessi, HyunA and former PENTAGON member DAWN to the label. "
        },
        "https://www.nme.com/news/music/phoebe-bridgers-says-she-might-release-more-new-music-this-year-3209255": {
            "title": "Phoebe Bridgers says she might release more new music this year",
            "content": "Phoebe Bridgers has suggested she may release more new music this year, saying that she always “tries to do things that are exciting”. Last week saw the Los Angeles singer-songwriter return with ‘Sidelines’, a standalone song that was recorded for the upcoming TV adaptation of Sally Rooney’s novel Conversations With Friends. Bridgers wrote the track with bandmate and collaborator Marshall Vore and Ruby Rain Henley. According to a press release, ‘Sidelines’ will be her only original new song of the year. During an interview with KROQ at last weekend’s Coachella, the musician was asked whether this was the case. “Who knows, actually,” Bridgers replied. “I try to do things that are exciting so I never really know what I’m gonna do.” The singer went on to joke that she would be “dropping a mixtape tomorrow”. When asked about how ‘Sidelines’ came about, Bridgers explained: “[Marshall Vore] had this like love song idea… he sent it to me right in the beginning of the pandemic. And I was like, ‘This is insane’.”  She continued: “I was so obsessed with it, I was playing it all the time in the house. And when the show asked me to make something, I was like, ‘But I don’t have anything that fits’. And Marshall was like, ‘What about that ‘Sidelines’ one?'” Bridgers said that the pair then re-wrote some of the song and “changed some stuff around” before re-recording it for Conversations With Friends. “And it just kind of magically fit and was exactly what I wanted,” she added. Bridgers, who’s a longtime fan of Sally Rooney, wrote ‘Sidelines’ from the perspective of someone fearless before the introduction of love gives the character “something to lose”.  During her performance at Coachella last Friday (April 15), Phoebe Bridgers was joined onstage by Arlo Parks to perform ‘Graceland Too’ and ‘I Know The End’. Both tracks appear on Bridgers’ second studio album, 2020’s ‘Punisher’. The second weekend of Coachella 2022 kicks off tomorrow (April 22) in Indio, California – check out NME’s review of the first instalment here. "
        },
        "https://www.nme.com/news/music/fatboy-slim-romy-mura-masa-and-many-more-announced-for-glastonburys-silver-hayes-3210388": {
            "title": "Fatboy Slim, Romy, Mura Masa and many more announced for Glastonbury’s Silver Hayes",
            "content": "Fatboy Slim, Romy and Mura Masa are among the leading names who have been announced on the 2022 line-up for Glastonbury‘s Silver Hayes area. The Worthy Farm festival is set to return this year from June 22-26, with Billie Eilish, Paul McCartney and Kendrick Lamar to headline the Pyramid Stage. The latest 2022 line-up announcement from Glastonbury has been made today (April 22) for the festival’s Silver Hayes area, which offers “the best names in electronic, R&B, bass, rap, drum & bass and dub music”. As well as Fatboy Slim, Romy and Mura Masa, the likes of Berwyn, Leon Vynehall, Bad Boy Chiller Crew, Sofia Kourtesis, India Jordan, Kojey Radical, ArrDee, Gorgon City, Groove Armada (DJ set), Lava La Rue, Logic1000, Nia Archives, Potter Payper and Shy FX are all set to play at Silver Hayes this year. Glastonbury’s Silver Hayes line-up (Picture: Glastonbury / Press) You can check out the full music line-up for Glastonbury’s Silver Hayes area above. In a statement, Glastonbury confirmed that, this year, Silver Hayes will see “SONIC & WOW make a welcome return, whilst new additions come in the form of THE LONELY HEARTS CLUB – an art deco cinema structure standing over 40 foot high – and FIRMLY ROOTED, a space celebrating all things sound-system culture”.  This latest line-up announcement follows on from Glastonbury confirming the bill for their Field Of Avalon area last week. The likes of The Damned, Imelda May and John Cooper Clarke will all perform there during this year’s festival. "
        },
        "https://www.nme.com/news/music/bad-bunny-announces-new-album-via-classified-car-advert-3210932": {
            "title": "Bad Bunny announces new album via classified car advert",
            "content": "Bad Bunny has announced details of his sixth studio album via an advert for a supercar. Earlier this week (April 21), the reggaeton star posted an ad for a Bugatti Chiron 110, released in 2019 to mark the 110th anniversary of the French car maker. The ad, which appears in Clasificados Online, was posted under the superstar’s real name, Benito A. Martinez Ocasio. It listed the car for $3.5million (£2.7m) and left a phone number. When fans called the number, a voicemail message played a snippet of an unreleased Bad Bunny song and a text message in Spanish was then sent to everyone who phoned up. Translated into English, it read: “Hello! Thank you for calling. There’s little time left until the album comes out. I can’t say the date yet.” “But I can tell you the name: ‘Un Verano Sin Ti’,” it added, with the title translating as ‘A Summer Without You’. Escucha un adelanto de lo que vendrá en el nuevo álbum de Bad Bunny, \"UN VERANO SIN TI\". pic.twitter.com/BozvNShbCD — Bad Bunny Info (@badbunnyinfope) April 21, 2022  Bad Bunny’s new album will be called “UN VERANO SIN TI” 🏝 pic.twitter.com/lJx0Q2JVna — Conejo Toxico (@conejo_toxico) April 21, 2022  Later this year, Bad Bunny is set to head out on his first North and South American stadium tour, with dates beginning in August. The tour – which the rapper is dubbing World’s Hottest Tour – will kick off in Orlando, Florida on August 5. From there, Bad Bunny will venture across North America through the month and all of September, before venturing into South America in October. Find full tour dates below. Appearing at different shows in support will be Alesso and Diplo. In December, the rapper was declared the the world’s most-listened-to artist on Spotify for the second year running. The same month, he also surprised fans with a music video for ‘Te Deseo Lo Mejor’ made in collaboration with The Simpsons. See the upcoming tour dates below.  AUGUSTFriday 5 – Orlando, Camping World StaidumTuesday 9 – Atlanta, Truist ParkFriday 12 – Miami, Hard Rock StadiumThursday 18 – Boston, Fenway ParkSaturday 20 – Chicago, Soldier FieldTuesday 23 – Washington D.C., Nationals ParkSaturday 27 – New York, Yankee StadiumSEPTEMBERThursday 1 – Houston, Minute Maid ParkWednesday 7 – San Antonio, AlamodomeFriday 9 – Dallas, AT&T StadiumWednesday 14 – Oakland, RingCentral ColiseumSaturday 17 – San Diego, PETCO ParkFriday 23 – Las Vegas, Allegiant StadiumWednesday 28 – Phoenix, Chase FieldFriday 30 – Los Angeles, SoFi Stadium OCTOBERFriday 21 – Santo Domingo, Estadio Olímpico Félix SánchezFriday 28 – Santiago, Estadio Nacional Julio Martínez Prádanos NOVEMBERFriday 4 – Buenos Aires, Estadio de Vélez – José AmalfitaniFriday 11 – Asuncion, Estadio La Nueva OllaSunday 13 – Lima, Estadio NacionalWednesday 16 – Quito, Estadio Olímpico AtahualpaFriday 18 – Medellin, Estadio Atanasio GirardotTuesday 22 – Panama City, Estadio Rommel Fernández GutiérrezThursday 24 – San Jose, Estadio NacionalSaturday 26 – San Salvador, Estadio CuscatlánTuesday 29 – San Pedro Sula, Estadio Olímpico Metropolitano DECEMBERThursday 1 – Guatemala City, Explanada Cardales de CayaláSaturday 3 – Monterrey, Estadio BBVAFriday 9 – Mexico City, Estadio Azteca "
        },
        "https://www.nme.com/news/music/les-claypool-and-eugene-hutz-share-tribute-song-to-zelensky-the-man-with-the-iron-balls-3209761": {
            "title": "Les Claypool and Eugene Hütz share tribute song to ‘Zelensky: The Man With The Iron Balls’",
            "content": "Primus‘ Les Claypool and Gogol Bordello’s Eugene Hütz have shared a tribute song to Eukraine’s president Volodymyr Zelensky. You can listen to it below. Called ‘Zelensky: The Man With The Iron Balls’, the charity track also features The Police’s Stewart Copeland on drums, John Lennon’s son Sean on guitar and vocals, Hütz’s bandmate Sergey Ryabtseb on violin and Billy Strings on acoustic guitar. The lyrics of the song hear the collective sing: “One person can make a difference/ Be they short, thin, fat, or tall/ That person can live with dignity/ If they stand with some iron balls.” You can listen to the track here:  Speaking about the track to Rolling Stone, Hütz, who was born in Ukraine, said: “As soon as Russian aggression broke out, Les and I connected to address the catastrophe ASAP. “We jumped on creating affirmative music that calls for unity and pays respect to the real doers in Ukrainian defence, such as President Zelensky, who demonstrated previously unheard of stamina and heroism.” Claypool said the track “is not intended to be a song of condemnation,” but one of “unity.” All proceeds from the track will go to Nova Ukraine, a non-profit organisation that provides humanitarian relief and support to the people of Ukraine. “It is our way to show that heavyweights like Les, Stewart, Billy, and Sean stand with the people of Ukraine and the country’s sovereignty from the very start of Russian-led terror,” Hütz added.  Russian President Vladimir Putin ordered the country’s military to launch a full-scale invasion of Ukraine on February 24. The Office of the UN High Commissioner for Human Rights (OHCHR) has recorded 5,121 civilian casualties in the country: 2,224 killed and 2,897 injured as of April 20. Ukrainian electro-pop duo Bloom Twins spoke to NME last month about the situation in their home country, describing it as “terrifying”. “It has really affected us,” singer Anna Kuprienko said. “We were only there two months ago. We were hopeful that this situation with Russia wouldn’t go where it has and that it would resolve.” You can donate here to the Red Cross to help those affected by the conflict, and contribute to organisations that aid refugee reflief through Choose Love. "
        },
        "https://www.nme.com/news/music/placebo-to-sell-over-100-pieces-of-music-gear-used-throughout-their-career-3210343": {
            "title": "Placebo to sell over 100 pieces of music gear used throughout their career",
            "content": "Placebo have partnered with Reverb to sell guitars, amps and other music equipment used by the band across their career. Reverb, the online marketplace dedicated to buying and selling new, used and vintage musical instruments, will host a collection of the band’s gear which has been used on albums like ‘Without You I’m Nothing’, ‘Sleeping With Ghosts’ and ‘Meds’, as well as tours around the world. The official Placebo Reverb Shop is set to launch on April 27, with over 100 guitars, basses, effects pedals, amps and more up for sale. You can preview the shop here. Placebo bassist-guitarist Stefan Olsdal said of the sale: “Having spent years collecting some of the most interesting and creative music gear to use on studio recordings and live performances, we felt it was now time to let go and part ways with some of this gear we have amassed. “Knowing the Reverb shop has already been used by other established recording artists, we felt comfortable in the knowledge that the gear would be directed towards genuine collectors and enthusiasts.” The official Placebo @reverb shop is launching soon, featuring over 100 pieces of music gear used by the band throughout their career.  More info here: https://t.co/kl7g3wcDQU pic.twitter.com/1XPXmpEkoO — PLACEBO (@PLACEBOWORLD) April 21, 2022  The Placebo Reverb Shop is set to include items such as the Takamine acoustic guitar used on the 1999 single ‘Every You, Every Me’, a Korg 800DV synth used as a live synth from 1999 to 2001, and on the song ‘Pure Morning’, and a Guild Hollow Body bass that Olsdal used on the band’s MTV Unplugged episode. Olsdal added: “We’ve had a great run with this gear, but now it’s time for each piece to move on. As well as some highly collectable vintage pieces, there are also some more accessible items for fans to get their hands on.” Other artists that have partnered with Reverb to sell their music gear recently include Green Day, Mark Hoppus of Blink-182 and Peter Frampton.  Reviewing Placebo’s latest record, ‘Never let Me Go’, NME called it the band’s “best and most consistent album since 2006’s dark, intoxicated ‘Meds’” and said it “might prove their most rejuvenating since 2003’s arena-filling ‘Sleeping With Ghosts’. “‘Never Let Me Go’ is a true renaissance record. It’s no ‘Metal Machine Music’ or ‘Yeezus’, but a record that finds Placebo inspired and ready for a new era, reinventing the rock veterans for the modern age.” "
        },
        "https://www.nme.com/news/gaming-news/wu-tang-clan-comes-to-fortnite-in-fortangerous-crossover-3210297": {
            "title": "Wu-Tang Clan comes to ‘Fortnite’ in “Fortangerous” crossover",
            "content": "Epic Games has announced that a line of Wu-Tang Clan cosmetics are coming to Fortnite, which RZA has dubbed “Fortangerous”. Set to release tomorrow (April 23), the Wu-Tang Clan crossover will bring two outfits and a slew of other cosmetics and emotes. The Throwback BG Outfit comes with the WuWear Worldwide Back Bling and the Neck Protector Pickaxe; while the B.R.I.T.E. Outfit will launch with the Wu-Tang Represent Back Bling and the Triumphant Tagger Pickaxe cosmetic. Fortnite. Credit: Epic Games. Just like Fortnite‘s recent Coachella-themed outfits, the Wu-Tang Back Bling items will be music reactive, and will create different visual effects whenever the player hears music playing in the game. Both outfits will also include a Ruckus Red Alt Style. Beyond that, Fortnite will also release a Shimmy Surfer Glider, a Wu Wrap, and a Wu-Tang is Forever Emote, which plays a short snippet of Wu-Tang Clan’s 1993 song ‘C.R.E.A.M. (Cash Rules Everything Around Me)’ as players throw up their hands in a W shape. On the crossover, Wu-Tang Clan’s RZA shared the following: “Fortnite has been in my household for years. It’s been a pleasure and joy watching the game evolve, while becoming the go to pastime. This collaboration is a multigenerational ‘drip’ of swag and cool. If what you say is true, Fortnite and Wu-Tang could be Fortangerous….” RZA attends The Launch Of Sophia Chang’s Audio Memoir THE BADDEST BITCH IN THE ROOM Hosted by Audible And Hello Sunshine at The Standard, High Line In NYC on September 24, 2019 in New York City. (Picture: Dia Dipasupil/Getty Images for Audible) Wu-Tang Clan join several other artists who have made their way into Fortnite. In February, Silk Sonic joined the battle royale with their own Outfits, bringing tracks from ‘An Evening With Silk Sonic’ with them. Earlier in the month, Wu-Tang Clan’s album ‘Enter The Wu-Tang (36 Chambers’ was archived in the Library Of Congress, along with albums by A Tribe Called Quest and Alicia Keys.  In other gaming news, four Syphon Filter games have been rated for release on PS4 and PS5. "
        },
        "https://www.nme.com/news/music/watch-aloe-blacc-sing-wake-me-up-to-mark-four-years-since-aviciis-death-3209815": {
            "title": "Watch Aloe Blacc sing ‘Wake Me Up’ on fourth anniversary of Avicii’s death",
            "content": "Aloe Blacc has paid tribute to Avicii by singing ‘Wake Me Up’ in several different languages on the fourth anniversary of Avicii’s death. Avicii, real name Tim Bergling, died by suicide in 2018. Wednesday (April 20) marked four years since his passing. Blacc, who was a frequent collaborator with Avicii, recorded his vocals on the track in Mandarin and Spanish and shared the ‘Universal Language Mix’ to YouTube. When sharing the video, he wrote: “Avicii’s music touched the world. Writing the lyrics and recording the vocals on ‘Wake Me Up’ was a transformative experience for me. Everywhere I’ve been, no matter the country, music lovers and fans sing the lyrics with me in English.” “In honour of Avicii…I present a very special international version of ‘Wake Me Up’ in multiple languages.”  The song peaked at number four on the Billboard Hot 100 and held the record for the most weeks at number one on the ‘Hot Dance/Electronic Songs’ chart. Other figures from the world of dance also paid tribute to Avicii on Wednesday. David Guetta shared a home video of Avicii and wrote on Twitter: “4 years ago already, we all miss you very much.” Timmy Trumpet shared a video of him playing Avicii’s ‘S.O.S.’, writing: “Music is eternal. RIP Avicii forever in our hearts.” Beatport added: “Four years ago today we lost a true icon of the dance music world, Avicii. His music continues a lasting legacy.”  Last year, Nile Rodgers said that he wanted to release several unheard collaborations that he did with Avicii. The Chic star – who first worked with the late EDM producer on the track ‘Lay Me Down’, taken from the latter’s 2013 album ‘True’, told Swedish TV show Skavlan that he wants to put out some of the tracks he and Avicii worked on, provided he got the blessing of the Swedish producer’s family and estate. “I love Tim. We wrote a lot,” Rodgers said. “I used to say – and I’ve said this many times – that if you put Tim and I in a room together for one week, we could write the entire Top 10. I mean, that’s how talented he was. He was a natural melody writer. Even though he didn’t read music, he didn’t understand it technically, but for some reason, spiritually and artistically, he had a gift.” “We adored each other,” Rodgers added, before sharing why he thinks the music he and Avicii worked on has yet to be released. "
        },
        "https://www.nme.com/news/music/watch-pearl-jams-eddie-vedder-interview-crew-aboard-international-space-station-3210902": {
            "title": "Watch Pearl Jam’s Eddie Vedder interview crew aboard International Space Station",
            "content": "Pearl Jam‘s Eddie Vedder has teamed up with NASA to interview the crew aboard the International Space Station. The ISS is currently orbiting more than 250 miles above Earth, and onboard are NASA astronauts Kayla Barron, Raja Chari, Thomas Marshburn, and Mark Vande Hei, as well as ESA (European Space Agency) astronaut Matthias Maurer. Speaking to Vedder yesterday (April 22) in celebration of Earth Day, they shared their thoughts on having a front-row seat to the global effects of climate change; reflected on the stewardship of Earth; and space’s ability to unite everyone. The interview is the second time the frontman has collaborated with NASA. Last month, Vedder released his ‘Invincible’ music video inspired by NASA’s Artemis I Moon mission. The song is taken from the musician’s recent solo album ‘Earthling’. You can check out Vedder’s chat with the crew of the ISS below:  Pearl Jam recently confirmed they’ve started working on a new album. Stone Gossard has said the grunge legends have started sessions on the follow-up to 2020’s ‘Gigaton’ and some tracks have already been recorded. “We’ve recorded some songs. We’re on our way. We’re making music,” he told Consequence Of Sound last month. He also confirmed that producer, guitarist and songwriter Andrew Watt, who has a history with Justin Bieber and recently worked on frontman Eddie Vedder‘s album ‘Earthling’, is on board. “We’re psyched,” Gossard said. “Andrew is a total character. Really, like immediately, we were writing quickly. Spontaneously. Bring in a riff. Let’s knock it out. [Drummer] Matt Cameron is playing his ass off. We didn’t bring any gear down. We were just doing some recording in Andrew’s basement in Beverly Hills, basically. So far, so good.”  Meanwhile, Pearl Jam are set to hit the road for a North American tour in May. The jaunt will span 19 shows and tickets can be purchased here. "
        },
        "https://www.nme.com/news/music/watch-rico-nastys-trippy-video-for-new-single-vaderz-3208750": {
            "title": "Watch Rico Nasty’s trippy video for new single ‘Vaderz’",
            "content": "Rico Nasty has shared the video for her new single ‘Vaderz’, featuring Bktherula. The trippy clip, which you can view below, sees the duo referencing everyone from Gordon Ramsay to Marilyn Manson. “This ain’t no double life, bitch it’s really the way that I live/ Talk down on us then you might lose a limb/ I be stepping on bitches like I’m wearing Timbs,” raps Nasty. It comes after the rapper teamed up with Doja Cat at Coachella over the weekend for ‘Tia Tamera’, a single taken from the deluxe version of Doja Cat’s debut album ‘Amala’.  Earlier this year, Nasty spoke out out about how she finds fans encouraging her to twerk on stage during a performance “disrespectful”. Discussing how fans often hold their phones up to her with the word “twerk” while she’s on stage performing, she said: “This is probably the worst thing that you could put up while a female rapper is performing, even if she is gonna twerk, even if that’s what she does. This is so disrespectful.” She continued: “It’s pointing to this ever being why I’m on stage or pertaining to anything I’ve ever done in my career. That’s not what I do. You go on my Instagram right now. Do I have videos doing this? There’s people that do and they look great doing it but I don’t do this. “And for all my young girls…I mean, you do what you want to do and it’s all lit and fun… I’m just trying to make art and perform my songs and go. I’m not trying to be something that I’m not. You shouldn’t try to make somebody something that they’re not.” Her comments echoed similar remarks she made in The Big Read with NME in 2020 after she discussed the impact of Cardi B and Megan Thee Stallion‘s controversial track ‘WAP’, and how it offered liberation to many with regards to sexuality.  “Let these guys know that they can’t tell you what to do. I’mma shake this ass, and you’re going to watch it and you’re going to pay my bills,” she said at the time. “I love it because it’s time women stop worrying about what men think about them. We might not say we are, but [women can be] really mean and like ‘That’s that hoe shit!’ and it’s really not. It’s really just having fun and enjoying your life.” "
        },
        "https://www.nme.com/news/music/angel-olsen-covers-harry-styles-unreleased-track-boyfriends-3210907": {
            "title": "Angel Olsen covers Harry Styles’ unreleased track ‘Boyfriends’",
            "content": "Angel Olsen has covered an unreleased new Harry Styles song – hear her rendition of ‘Boyfriends’ below. ‘Boyfriends’ was one of a pair of songs Styles debuted live at the first of his two headline sets at Coachella 2022 last weekend, which was reportedly attended by over 100,000 people. Taking to TikTok, Olsen shared a stripped-down cover of ‘Boyfriends’ and captioned the post: “This new Harry song is a beauty (debuted at Coachella).” Watch it below. This new Harry song is a beauty (debuted at Coachella) #harrystyles #bigtime #fyp  ♬ original sound – Angel Olsen    ‘Boyfriends’ was debuted alongside another new song called ‘Late Night Talking’. Both are assumed to be taken from Styles’ forthcoming third studio album, ‘Harry’s House’. Following on from the star’s 2017 self-titled debut and 2019’s ‘Fine Line’, the new 13-track record will arrive globally on May 20. In a four-star review of Styles’ first Coachella show, NME wrote: “[…] It’s clear that he’s no longer aiming for the rock star lane, but is firmly blazing his own path through it.” The second weekend of Coachella 2022 is taking place right now in Indio, California – and Styles headlined once again last night (April 23). At the second show, he was joined on stage by Lizzo to cover Gloria Gaynor’s 1978 disco anthem ‘I Will Survive’ and One Direction single ‘What Makes You Beautiful’. During his first Coachella headline set, Harry Styles brought out Shania Twain to perform her hits ‘Man! I Feel Like a Woman!’ and ‘You’re Still The One’. He also debuted his recent single ‘As It Was’.  Check out NME’s round-up of the first instalment here. "
        },
        "https://www.nme.com/news/music/bambam-new-single-wheels-up-golden-state-warriors-3208277": {
            "title": "BamBam drops new single ‘Wheels Up’ in collaboration with Golden State Warriors",
            "content": "GOT7’s BamBam has partnered with American basketball team Golden State Warriors on his new single ‘Wheels Up’. READ MORE: Dreamcatcher – ‘Apocalypse: Save Us’ review: a refreshing, albeit naive take on the world Earlier this week, the basketball team announced the launch of Golden State Entertainment, an affiliate company that will release music and documentaries on sports and culture from the Bay Area. To formally launch the company’s music division, Golden State Entertainment released the song ‘Wheels Up’ today (April 22), a new single performed by BamBam. The song also features Bay Area rapper Mayzin on the track. “I’m on a mission, and can’t nobody stop me / King of the empire, and can’t nobody top me / ‘Cause I know what I’m destined to be, destined to be / Whoever wanna go and stand in my way,” BamBam sings.  Prior to the announcement, BamBam had performed the track during the Warriors’ game against the Los Angeles Lakers on April 7. ‘Wheels Up’ is slated for release on April 22, with further details about the track are expected to be released in the coming days. OK @BamBam1A 🔥pic.twitter.com/4OlGPAD3XZ — Warriors on NBCS (@NBCSWarriors) April 8, 2022  In January, BamBam made his return with his sophomore mini-album ‘B’, which was led by the single ‘Slow Mo’. Notably, the track was co-written by BamBam and American singer Pink Sweat$, a collaboration that the pair first hinted at late last year.  In other news, K-pop boyband Stray Kids announced the venues and dates for the North American leg of their upcoming world tour ‘Maniac’. On April 19, the group took to social media to share a new poster for the forthcoming leg of the tour, along with additional details on venues, dates and ticketing. According to their announcement, ticket sales open on April 22 at 3pm local time through Ticketmaster. The ‘Maniac’ tour is the follow-up to the boyband’s ‘District 9: Unlock’ world tour, which took place from late 2019 to early 2020, before the remaining tour was cancelled or postponed due to the COVID-19 pandemic. "
        },
        "https://www.nme.com/news/music/watch-billie-eilish-meet-lisa-simpson-in-disney-short-when-billie-met-lisa-3210865": {
            "title": "Watch Billie Eilish meet Lisa Simpson in Disney+ short ‘When Billie Met Lisa’",
            "content": "Billie Eilish has teamed up with Lisa Simpson in the latest Disney+ Simpsons short – you can watch a snippet of When Billie Met Lisa below. The short, which was released yesterday (April 22), features Eilish and her brother, Finneas, as well as the pop star duo’s mother and father, as they invite Lisa to a jam session in the studio. Lisa, who begins the short looking for a quiet place to practice her saxophone, is discovered by the chart-topping pair playing the instrument under a bridge. Once they get to the studio, Eilish fires her in-house orchestra in favour of Lisa and the pair get to work on putting a new spin on The Simpsons theme song. You can can see a clip from the episode below: We, too, would profusely sob at the chance to jam with @BillieEilish. @TheSimpsons: When Billie Met Lisa is now streaming only on #DisneyPlus! pic.twitter.com/osJSidPnR0 — Disney+ (@disneyplus) April 22, 2022  When Billie Met Lisa is streaming now on Disney+. This marks the fourth short from The Simpsons to be released on the streaming service, following the Star Wars-themed Maggie Simpson in The Force Awakens From Its Nap, the Marvel-inspired The Good, The Bart, And The Loki and last year’s The Simpsons in Plusaversary to celebrate Disney+ Day on November 12. The Simpsons has featured a huge roster of musical guests over the years, including Paul McCartney, Johnny Cash, James Brown, Red Hot Chili Peppers and recently, The Weeknd. Eilish previously teamed up with Disney+ for concert film Happier Than Ever: A Love Letter To Los Angeles, which released in September last year. Eilish is set to headline Glastonbury 2022 in June, sharing the stage with fellow headliners Paul McCartney and Kendrick Lamar.  Meanwhile, Eilish surprised Girl In Red this weekend by presenting her with a Spellemann award at Coachella 2022. The Norwegian artist, real name Marie Ulven, won the statue – often referred to as a Norwegian Grammy – in the Album Of The Year category for her acclaimed 2021 debut ‘If I Could Make It Go Quiet’. Ulven was also named Songwriter Of The Year at the Spellemanns – check out the full list of winners here. "
        },
        "https://www.nme.com/news/film/broker-trailer-starring-iu-song-kang-ho-3209232": {
            "title": "Watch the trailer for ‘Broker’, starring IU and ‘Parasite’’s Song Kang-ho",
            "content": "The first trailer for Hirokazu Kore-eda’s new film Broker, starring South Korean singer IU and Parasite star Song Kang-ho, has finally arrived. The clip opens with a woman (played by IU) humming to herself as she tends to a crying baby, before cutting to a man in the driver’s seat of a car, glancing at a baby in a casket in the seat next to him. We see him transporting the baby to an undisclosed location with the help of a team, saying: “In a way, I guess you could say it’s an act of good faith?” It’s then revealed that the man has plans to sell the baby, and is part of an illegal operation that does so, with two detectives hot on their heels.  Broker marks acclaimed Japanese filmmaker Hirokazu Kore-eda’s first-ever Korean-language film, which will premiere in competition at the 2022 Cannes Film Festival next month. Kore-eda previously bagged the Palme d’Or prize at the festival for Shoplifters in 2018. Featuring a star-studded cast, including Parasite’s Song Kang-ho, singer-actress IU, Bae Doo-na (The Silent Sea, Sense8), Gang Dong-won (Peninsula) and Lee Joo-young (Itaewon Class, Times), Broker follows Sang-hyun (played by Song) who sets up a baby box where parents are able to anonymously leave their babies for him find new parents for. Self-described as a “broker” of goodwill, Sang-hyun works with Dong-soo (Gang) in this line of work, during which they cross paths with So-young (IU), who leaves her own baby in the baby box. Bae and Lee portray the lead detectives in the cast against the broker, who are determined to uncover the operation.  The film was first announced in August 2020, during which it was revealed that Kore-eda, who both wrote and directed the project, had conceived the original screenplay roughly seven years ago as of 2022. "
        },
        "https://www.nme.com/news/music/kaytranada-announces-headline-summer-london-show-tickets-3208843": {
            "title": "Kaytranada announces headline summer London show",
            "content": "Kaytranada has announced that he’ll be heading to London this summer for a headline show at O2 Academy Brixton – get tickets here. The two-time Grammy-winning producer will head to Europe in June for a run of shows in Germany, Malta, Netherlands, France and Italy. The UK date takes place on June 19. The announcement follows the release of recent single ‘Iced Tea’ and last year’s ‘Intimidated’ EP, a three-track project that features guest appearances from H.E.R., Thundercat and Mach-Hommy. He also joined forces with IDK earlier this month for a new track called ‘Taco’, the first single to be released from the Maryland rapper’s upcoming new album ‘Simple’. See Kaytranada’s European tour announcement below; buy tickets for the London date here when they go on sale on Friday (April 22) at 10am. european tickets on sale friday 10AM GMT at https://t.co/VbJ8FbMPxa pic.twitter.com/WfsVd0ymf0 — KAYTRA (@KAYTRANADA) April 20, 2022  Kaytranada was recently announced as one of the openers for Swedish House Mafia’s upcoming tour. The Scandinavian dance trio – comprising Axwell, Steve Angello and Sebastian Ingrosso – released their long-awaited debut full-length ‘Paradise Again’ last week (April 15). The group will be heading out on a world tour this summer in support of the album, with Alesso, Zhu, Vintage Culture, Grimes, and Kaytranada confirmed as opening acts at various dates. They’ve also added some extra shows to the schedule – see full dates below and buy tickets here. JULY 202229 – FTX Arena, Miami31 – Amway Center, Orlando AUGUST 20222 – Madison Square Garden, New York3 – Madison Square Garden, New York5 – Scotiabank Arena, Toronto7 – îleSoniq Festival, Montreal9 – TD Garden, Boston10 – Wells Fargo Center, Philadelphia11 – Capital One Arena, Washington13 – United Center, Chicago17 – Little Caesars Arena, Detroit21 – Ball Arena, Denver25 – Moody Center, Austin26 – American Airlines Center, Dallas27 – Toyota Center, Houston SEPTEMBER 20222 – T-Mobile Arena, Las Vegas4 – Pechanga Arena, San Diego9 – Banc of California Stadium, Los Angeles13 – Rogers Arena, Vancouver14 – Climate Pledge Arena, Seattle16 – Chase Center, San Francisco17 – Chase Center, San Francisco29 – AO Arena, Manchester30 – OVO Hydro, Glasgow OCTOBER 20222 – The O2, London6 – 3Arena, Dublin8 – Utilita Arena, Birmingham10 – Accor Arena, Paris14 – IFEMA Madrid Live, Madrid15 – Altice Arena, Lisbon18 – Mediolanum Forum, Milan19 – Hallenstadion, Zurich21 – Tauron Arena, Krakow22 – O2 Arena, Prague25 – Lanxess Arena, Cologne27 – Olympiahalle, Munich29 – Sportpaleis, Antwerp31 – Ziggo Dome, Amsterdam NOVEMBER 20223 – Stadthalle, Vienna5 – Festhalle, Frankfurt6 – Mercedes-Benz Arena, Berlin8 – Barclaycard Arena, Hamburg9 – Royal Arena, Copenhagen11 – Telenor Arena, Oslo13 – Uros Arena, Tampere Swedish House Mafia. CREDIT: Alexander Wessely/NME Swedish House Mafia headlined the third night of Coachella at the weekend with The Weeknd, replacing Kanye West, who pulled out of his closing night headline sets earlier this month. The Weeknd opened his set with ‘Sacrifice’ and ‘How Can I Make You Love Me’, joined by Swedish House Mafia at the end of their own full-length set. His set then ended with a performance of their collaborative 2021 track, ‘Moth To A Flame’. "
        },
        "https://www.nme.com/news/music/florence-the-machine-share-bill-nighy-starring-video-for-new-single-free-3208692": {
            "title": "Florence + The Machine share Bill Nighy-starring video for new single ‘Free’",
            "content": "Florence + The Machine have shared a brand new single called ‘Free’ – watch its Bill Nighy-starring video below. Florence Welch and her band’s fifth album is set for release on May 13 via Polydor, and has been previewed so far by the singles ‘My Love’, ‘King’, and ‘Heaven Is Here’. Its full tracklist was then shared last week. As with the other videos in the ‘Dance Fever’ campaign so far, the new ‘Free’ video was directed by Autumn De Wilde. In it, Welch plays herself, while Nighy takes on the role of Florence’s anxiety. See the pair interacting in the ‘Free’ video below.  Earlier this week, Welch and co. previewed new ‘Dance Fever’ tracks – including ‘Free’ – at a handful of intimate UK gigs, ending last night (April 19) in London. Reviewing the London gig at the Theatre Royal Drury Lane, NME wrote: “It’s apt that Florence + The Machine have chosen to wrap up an intimate tour in support of forthcoming fifth album ‘Dance Fever’ in such a grand setting. There is much religious symbolism at work: the coiled frustration of ‘Big God’ is healed by the earthly, groove-led balm of ‘What The Water Gave Me’. “The upper register of Welch’s voice reaches a scream at ‘King’’s heaving peak, before ‘Heaven Is Here’ is blasted at the rafters.” ‘Dance Fever’ serves as the follow-up to 2018’s ‘High As Hope’, with Welch previously describing the album as “a fairytale in 14 songs”. It was co-produced by the singer alongside Jack Antonoff and Glass Animals frontman Dave Bayley, the latter of whom recently remixed ‘My Love’. The band will embark on a full UK arena tour in November, while a huge North American tour will also take place later this year, with support from Arlo Parks, Sam Fender, King Princess, Yves Tumor, Japanese Breakfast and Wet Leg on select dates. Tickets for the shows can be found here and here, and you can see the full list of dates below.  MAY 20226 – New York, NY – Alice Tully Hall at Lincoln Center SEPTEMBER 20222 – Montreal, QC – Place Bell3 – Toronto, ON – Budweiser Stage7 – Chicago, IL – Huntington Bank Pavilion at Northerly Island8 – St. Paul, MN – Xcel Energy Center10 – Clarkson, MI – Pine Knob Music Theatre12 – Washington, DC – Capital One Arena14 – Boston, MA – TD Garden16 – New York, NY – Madison Square Garden20 – Ascend Amphitheater – Nashville, TN21 – Alpharetta, GA – Ameris Bank Amphitheater23 – Orlando, FL – Amway Center24 – Miami, FL – FTX Arena27 – Austin, TX – Moody Center28 – Irving, TX – The Pavilion at Toyota Music Factory OCTOBER 20221 – Denver, CO – Ball Arena4 – Vancouver, BC – Rogers Arena6 – Seattle, WA – Climate Pledge Arena7 – Portland, OR – Theater of the Clouds9 – Mountain View, CA – Shoreline Amphitheatre12 – Cal Coast Credit Union Open Air Theatre – San Diego, CA14 – Los Angeles, CA Hollywood Bowl NOVEMBER 202214 – Accor Arena, Paris16 – Motorpoint Arena, Cardiff18 – The O2, London19 – The O2, London21 – BIC, Bournemouth22 – AO Arena, Manchester24 – Utilita Arena, Birmingham25 – First Direct Arena, Leeds27 – OVO Hydro, Glasgow28 – Motorpoint Arena, Nottingham30 – Arena, Dublin "
        },
        "https://www.nme.com/news/music/glass-animals-team-up-with-the-strokes-albert-hammond-jr-for-new-version-of-i-dont-wanna-talk-i-just-wanna-dance-3210313": {
            "title": "Glass Animals team up with The Strokes’ Albert Hammond Jr. for new version of ‘I Don’t Wanna Talk (I Just Wanna Dance)’",
            "content": "Glass Animals have teamed up with The Strokes’ Albert Hammond Jr. for a new version of ‘I Don’t Wanna Talk (I Just Wanna Dance)’ – you can listen to the track below. The original version of the song was released back in September and added as a bonus track to Glass Animals’ 2020 album ‘Dreamland’. Glass Animals have now linked up with Hammond Jr. for a new version of ‘I Don’t Wanna Talk (I Just Wanna Dance)’, which has been released digitally today (April 22) and will be released physically as a special picture disc for tomorrow’s Record Store Day (April 23). “EXCEPTIONALLY excited to announce a collab w/ the one and only Albert Hammond Jr.!!” Glass Animals’ Dave Bayley said in a statement on Twitter. “We wrote and recorded a whole new massive exploding wig-out outro. Grew up listening to Albert’s records, and learning his guitar parts was a huge part of how I learned guitar myself. “Anyway – a dream,” he added. “Thank u so much albert!!” Hammond Jr. said of the collaboration: “I met David over Zoom and we spoke of coffee and Jetway. Two things I still owe him. I was hoping we would write a song one day, but being so far from each other and mid-pandemic it didn’t seem likely. Then, out of the blue, he sent me ‘I Don’t Wanna Talk…’  “I knew exactly what I needed to do. I got some distortion and went to work. David, thanks for having me – to many more things to come.” Speaking about the song last year, Bayley said that ‘I Don’t Wanna Talk (I Just Wanna Dance)’ was inspired by the frustration of the COVID-19 lockdowns. “It felt like we were all put in a pressure cooker, but there was no way to let out the steam,” he said. “That’s what this track is about – that pressure cooker exposing and expanding so many cracks, but struggling to fill them in and decompress. “I want people to switch their devices off, put this song on, close their eyes and have that release for a moment.”  Glass Animals recently shared their remix of Florence + The Machine’s ‘My Love’, which was originally co-written and co-produced by Bayley. The band also covered Lorde’s ‘Solar Power’ last month for a special edition of the Spotify Singles series which celebrated the Best New Artist category at this year’s Grammys. "
        },
        "https://www.nme.com/news/music/watch-foals-play-recent-single-looking-high-for-the-first-time-3210823": {
            "title": "Watch Foals play recent single ‘Looking High’ for the first time",
            "content": "Foals gave their latest single ‘Looking High’ its live debut during a show in Edinburgh this week – check out the fan-shot footage below. The song is set to appear on the Oxford band’s seventh studio album ‘Life Is Yours’, which comes out on June 17. On Wednesday (April 20), Foals performed ‘2am’ and the as-yet-unreleased cut ‘2001’ for the first time as they kicked off their 2022 UK headline tour at Edinburgh’s Usher Hall. The trio returned to the venue the following night (April 21) where they debuted ‘Looking High’. Tune in here:  ‘Looking High’, frontman Yannis Philippakis explained, “is looking back to a more hedonistic time in my life, and a more innocent time in society in general, pre-pandemic and before the existential threat of climate change”. He continued: “It takes place in an alley in Oxford with two clubs – The Cellar and The Wheatsheaf – that all the city’s nightlife gravitated towards.” Foals’ current run of UK gigs continues in Birmingham tonight (April 23) ahead of various festival appearances this summer. You can see their upcoming live schedule below and find tickets here. APRIL23 – Utilita Arena, Birmingham25 – Bonus Arena, Hull26 – O2 City Hall, Newcastle27 – Centre, Brighton29 – Olympia, London30 – Olympia, London MAY1 – Olympia, London2 – Olympia, London5 – Empress Ballroom, Blackpool6 – Empress Ballroom, Blackpool8 – O2 Academy Brixton, London29 – Radio 1’s Big Weekend, Coventry JUNE22–26 – Glastonbury Festival27 – Fairview Park, Dublin29 – Sounds of the City, Castlefield Bowl, Manchester JULY8 – Sounds of the City, Millennium Square, Leeds9 – TRSNMT, Glasgow23 – Latitude Festival, SuffolkSpeaking to NME about the forthcoming ‘Life Is Yours’ back in February, Philippakis said that “this is our idea of a going out record”.   “We were thinking about parties, club nights and being drunk on the bus at 2am trying to get home,” he explained. “All of it: the excitement before you go out, meeting up with your friends, the wild abandon. ‘Who’s got the pingers? Where are we going?’ This is all of that youthful excess of going out.” "
        },
        "https://www.nme.com/news/music/mick-jagger-praises-yungblud-and-machine-gun-kelly-for-bringing-life-to-modern-rock-3210855": {
            "title": "Mick Jagger says Yungblud and Machine Gun Kelly are bringing “life” to modern rock",
            "content": "Mick Jagger has praised Yungblud and Machine Gun Kelly, saying that the two artists bring “life” to a new generation of rock music. Speaking to Swedish radio station P4 recently, the Rolling Stones frontman explained (via The Independent): “In rock music you need energy and there have not been a lot of new rock singers around. Now there are a few.” He continued: “You have Yungblud and Machine Gun Kelly. That kind of post-punk vibe makes me think there is still a bit of life in rock and roll.” Elsewhere in the interview, Jagger, 78, shut down the possibility of retiring following the Stones’ UK and European 60th anniversary tour which is due to kick off in June. “I am not planning it to be the last tour. I love being on tour,” he said. “I don’t think I would do it if I did not enjoy it.” Jagger went on: “I enjoy going out there on stage and doing my stuff. That is what I do. I want everyone to enjoy themselves and forget the troubles in their lives for a couple of hours and just chill out and have a great afternoon and evening.” Mick Jagger performs in concert as The Rolling Stones close out their North American tour at Circuit of The Americas on November 20, 2021 in Austin, Texas. Credit: Gary Miller/WireImage Speaking to NME back in 2019, Yungblud namechecked the legendary Stones singer while talking about his own ambitions for the future. “I’m not arsed about being about for 10 minutes, have a hit song, get a fucking mansion, do too many drugs and kill myself,” he explained. “I want to be doing this until I look like Mick Jagger. He’s still sexy as fuck!” Yungblud also told NME at the time that he thought rock ‘n’ roll was “very much alive” and had been “reinvented for a new generation” of fans. You can see the full schedule for The Rolling Stones’ forthcoming UK and European tour below and find any remaining UK tickets here. JUNE1 – MADRID, Wanda Metropolitano Stadium, SPAIN5 – MUNICH, Olympic Stadium, GERMANY9 – LIVERPOOL, Anfield Stadium, UK13 – AMSTERDAM, Johan Cruijff Arena, NETHERLANDS17 – BERN, Wankdorf Stadium, SWITZERLAND21 – MILAN, San Siro Stadium, ITALY25 – LONDON, American Express presents BST Hyde Park, UK JULY3 – LONDON, American Express presents BST Hyde Park, UK11 – BRUSSELS, King Baudouin Stadium, BELGIUM15 – VIENNA, Ernst Happel Stadium, AUSTRIA19 – LYON, Groupama Stadium, FRANCE23 – PARIS, Hippodrome Paris, FRANCE27 – GELSENKIRCHEN, Veltins Arena, GERMANY31 – STOCKHOLM, Friends Arena, SWEDEN  Earlier this month, Mick Jagger shared a new solo single called ‘Strange Game’. The “moodily strutting” track serves as the theme tune to the Apple Original series Slow Horses, which stars Gary Oldman. Yungblud is expected to release his as-yet-untitled third studio album this year, with Machine Gun Kelly’s sixth record ‘Mainstream Sellout’ arriving last month. "
        },
        "https://www.nme.com/news/music/watch-bob-vylans-video-for-their-raucous-new-single-wicked-bad-3210242": {
            "title": "Watch Bob Vylan’s video for their raucous new single ‘Wicked & Bad’",
            "content": "Bob Vylan have shared the video for their latest single ‘Wicked & Bad’ – watch below. The clip arrives on the same day as the duo’s new album ‘Bob Vylan Presents The Price Of Life’, which was announced last year and is the follow-up to 2020’s ‘We Live Here’. ‘Wicked & Bad’ follows previously released singles ‘Pretty Songs’, ‘GDP’ and ‘Health is Wealth’, arriving with a video directed by Yannick Reid. The track is heavily influenced by jungle music, which has roots in reggae and dancehall, so the band wanted to pay homage to its birthplace by filming in Jamaica. Speaking about the video and single, they said: “‘Wicked and Bad’ is a mosh pit, festival ready banger and when we were thinking about what the video would look like we just knew it had to be shot in Jamaica, and having complete creative control and being in complete control of the budget, we were able to just get up and do exactly that!”  They continued: “I [Bobby] reached out to Yannick Reid who is an incredible director in Jamaica and works with Koffee, Protoje, Lila Ike to name a few, he loved the track and came back with a vision that matched perfectly with what we were thinking, even down to the DIY flame thrower which is a cultural staple of dancehalls in Jamaica, it just fits with the song perfectly. “We used a completely local crew and I styled the outfits. Being a jungle type of track I knew I had to pull out some vintage Moschino pieces which were popular in the UK jungle raves back in the day. It’s the focus track from the new album so we knew it had to make an impact when we released it and this video helps us do just that!” The band caught up with NME at the BandLab NME Awards 2022 in March, where they spoke about the new album. They were in attendance to present the award for Best Festival in the UK to Reading & Leeds.  “It might be big-headed to say, but there’s maybe more variation than any band’s album – maybe ever!” said drummer Bobbie Vylan. Bob continued: “It’s a conceptual piece, but it’s very varied in its sonics, it’s varied in its production, the lyrical content, the themes that we’re exploring as well. I think it’s going to be an incredible album to conceptualise what the UK is going through and will be going through in the next year to God knows how long… until this government pulls their finger out of their fucking arsehole.” The band will be heading off on a full UK headline tour through May and June in support of ‘Bob Vylan Presents The Price Of Life’ – buy tickets here. "
        },
        "https://www.nme.com/news/music/the-weeknd-shares-kaytranada-remix-of-out-of-time-3210262": {
            "title": "The Weeknd shares Kaytranada remix of ‘Out Of Time’",
            "content": "The Weeknd has shared a remix of his ‘Dawn FM’ song ‘Out Of Time’ by fellow Canadian artist Kaytranada. Kaytra’s version retains the glistening electronics of the original along with Abel Tesfaye’s distinctive croon, though it trades the groove-heavy bass guitar for a deep sub-synth and more active percussion. It arrives as part of an EP that also includes a much shorter radio edit of the remix along with the original and an instrumental version of the studio recording. Listen to Kaytranada’s remix below:  Earlier this month, The Weeknd shared a video for ‘Out Of Time’ featuring Squid Game actress Jung Ho-yeon along with Jim Carrey, whose narration was threaded through ‘Dawn FM’. Days later, The Weeknd announced he was teaming up with US art collective MSCHF for a limited-edition run of the single pressed on a playable saw blade vinyl record. ‘Out Of Time’ was one of three ‘Dawn FM’ songs The Weeknd debuted live on Sunday night (April 17) at Coachella as part of his headline set with Swedish House Mafia. The two acts performed a joint closing set, replacing previous headliner Kanye West after the rapper withdrew from the line-up just a few weeks earlier. Elsewhere during the set, Tesfaye performed ‘After Hours’ hits like ‘Blinding Lights’ and ‘Save Your Tears’, and his verse from West’s ‘Donda’ track ‘Hurricane’. The set was closed out with his 2021 Swedish House Mafia collaboration ‘Moth To a Flame’. The two acts will perform another collaborative set this coming Sunday (April 24) for the festival’s second weekend. The Weeknd is due to embark on the North American leg of his ‘After Hours Til Dawn’ headline tour this July, with Doja Cat featuring as special guest on many of the dates. See the full schedule and find any remaining tickets here.  Kaytranada, meanwhile, announced a string of European dates earlier this month that includes a show at O2 Academy Brixton in London on June 19. The announcement followed the release of the producer and DJ’s recent single ‘Iced Tea’ along with last year’s H.E.R. and Thundercat-featuring ‘Intimidated’ EP. "
        },
        "https://www.nme.com/news/music/liam-gallagher-better-days-video-single-cmon-you-know-3210357": {
            "title": "Watch Liam Gallagher’s new video for his single ‘Better Days’",
            "content": "Liam Gallagher has shared the video for his new single ‘Better Days’ – you can watch the clip below. The song is the latest to be taken from the former Oasis frontman’s upcoming third solo album ‘C’mon You Know’, which is set for release on May 27 via Warner. After sharing a preview of the clip on his social media channels yesterday (April 21), Gallagher has now released ‘Better Days’ – described by the singer as “the sound of the summer” and featuring Yeah Yeah Yeahs guitarist Nick Zinner – and its accompanying video. The clip sees Gallagher and his live band performing on the roof of Manchester’s Midland Hotel – a location Gallagher previously teased in a tweet to fans last month.  Directed by multiple Grammy nominee Paul Dugdale, you can watch Liam Gallagher’s video for ‘Better Days’ above. All UK proceeds from ‘Better Days’ will be donated to War Child for the rest of this year. “We could not be more grateful to Liam for his incredible, continued support for the charity,” Rich Clarke, Head of War Child Records, said in a statement. “With us since the earliest days of our music-focused fundraising almost 27 years ago, Liam’s contributions have extended to putting exclusive Oasis tracks on our classic ‘HELP’ and ‘1 Love’ albums to donating £1 from every ticket sold on his 2019 UK tour. “Now, in these most challenging times, Liam’s generosity stretches further still, to help us reach more children living conflict around the world.”  Gallagher will play a number of UK and Ireland shows this summer in support of ‘C’mon You Know’, including two sold-out dates at Knebworth. He’ll also play an intimate date at the 1800-capacity King George’s Hall in Blackburn next week to celebrate the launch of his LG2SPZL Adidas trainers. "
        },
        "https://www.nme.com/news/music/kendrick-lamar-joins-baby-keem-for-pair-of-songs-at-coachella-2022-3210891": {
            "title": "Kendrick Lamar joins Baby Keem for pair of songs at Coachella 2022",
            "content": "Kendrick Lamar made a surprise appearance during Baby Keem‘s Coachella 2022 performance last night (April 22) – see the footage below. Lamar, who recently announced the release of his fifth studio album, ‘Mr Morale & The Big Steppers’, joined his cousin on the Sahaha stage for ‘Family Ties’ and ‘Vent’, the final two songs of his set. It was Keem’s second consecutive weekend performing at the festival. “Oh shit!” Keem shouted as Lamar made his way to the stage. The Compton rapper then proceeded to perform his rapid-fire verse from ‘Family Ties’ in front of a large video screen of fire and water scenes. The pair closed the set with the live debut of their collaborative track ‘Vent’. Both tracks are taken from Keem’s debut album, ‘The Melodic Blue’. You can check out footage from Keem’s Coachella set below:   ‘trademark usa’‘hooligan’‘scapegoats’‘HONEST’‘ORANGE SODA’‘booman’‘issues’‘range brothers’’16’‘Praise God’‘family ties’ (with Kendrick Lamar)‘vent’ (with Kendrick Lamar) Elsewhere on Friday at Coachella, Harry Styles brought out Lizzo as a special guest during his headline set. Towards the end of his main set, Styles surprised the crowd by welcoming Lizzo to the stage to cover Gloria Gaynor’s 1978 disco anthem ‘I Will Survive’. The pair strutted down the runway in flamboyant matching coats, belting out the tune as they went. Styles and Lizzo then sang a joint rendition of One Direction’s 2011 hit single ‘What Makes You Beautiful’.  Lamar is set to headline Glastonbury 2022 in June, sharing the stage with fellow headliners Paul McCartney and Billie Eilish. Lamar has also shared details of a new summer headline show in Milan, Italy, which was announced following his performance at this year’s Super Bowl Halftime Show. "
        },
        "https://www.nme.com/news/music/billie-eilish-presents-girl-in-red-with-norwegian-grammy-at-coachella-2022-radar-3210794": {
            "title": "Billie Eilish surprises Girl In Red with Norwegian Grammy at Coachella 2022",
            "content": "Billie Eilish surprised Girl In Red by presenting her with a Spellemann award at Coachella 2022 this weekend – check out the video below. The Norwegian artist, real name Marie Ulven, won the statue – often referred to as a Norwegian Grammy – in the Album Of The Year category for her acclaimed 2021 debut ‘If I Could Make It Go Quiet’. Ulven was also named Songwriter Of The Year at the Spellemanns – check out the full list of winners here. “I am about to surprise Girl In Red with the Spellemann Album Of The Year award,” explained Eilish in a video that was filmed at weekend two of Coachella. Ulven is then seen entering the tour bus to find Eilish inside. “What the fuck?!” said a shocked Girl In Red. “What the actual fuck?! That’s a Norwegian Grammy, y’know.” Eilish responded: “I am aware. You have won the Spellemann… Album Of The Year!” The pair then hugged as Eilish congratulated Ulven on her victory. “This is so weird!” Girl In Red said, adding: “Dude! I did not expect this.”  Eilish told Ulven that the win was “so fucking cool”, saying: “I’m sorry to put you on the spot. You’re amazing, we love you so much. Congratulations.” Elsewhere in the clip, it was explained that the singer-songwriter had set the record for the most Spellemann nominations – receiving a total of seven nods in various categories, including Song Of The Year for the Finneas-produced single ‘Serotonin’. Speaking to NME last year, Ulven recalled Eilish’s reaction to track. “Billie said that the lyrics were bonkers, and that’s insane,” she said. “I’m so stoked.” As for the chances of collaborating with Eilish in future, Ulven told NME: “No! I think that’s a pretty far-out question. I would love that one day, never say never, but right now I don’t know who I am when it comes to working with other musicians in that way.” Billie Eilish and Girl In Red will both perform at the second weekend of Coachella 2022 today (April 23).  In a four-star review of Eilish’s weekend one headline set, NME wrote: “Billie doesn’t seem interested in following any well-worn path to success, proving that when we see her in a crown, it’s because she’s earned the right to wear one.” Check back at NME all weekend for more reviews, news, interviews, photos and more from Coachella 2022.  "
        },
        "https://www.nme.com/news/music/watch-fka-twigs-hitch-a-ride-in-cheeky-new-honda-video-3210896": {
            "title": "Watch FKA Twigs hitch a ride in “cheeky” new ‘Honda’ video",
            "content": "FKA Twigs has shared the official video for her latest single ‘Honda’ – you can watch it below. The track appears on the singer-songwriter’s ‘Caprisongs’ mixtape, which was released back in January via Young. The video, which sees Twigs hitch a ride on top of a car, was directed by Aidan Zamiri, who also helmed the official videos for Twigs’ previous singles ‘Papi Bones’ (featuring Shygirl), ‘Meta Angel’, ‘Jealousy’ (featuring Rema) and ‘Oh My Love’. Speaking about the song’s video and the lengths she went to get the perfect shots, Twigs told Rolling Stone: “Yolo, like with me it’s just anything to get the shot. Working with Aiden Zamiri has been incredible, he’s a genius. She added: “‘Honda’ for me is like a perfect definition of a caprivid because it’s super short and cheeky and it leaves you wanting more.” You can watch the ‘Honda’ video below:  Earlier this month, it was announced that FKA Twigs had directed a new short film, in which she also stars, as part of the 2022 International Woolmark Prize celebrations. Playscape features Twigs and others dancing to ‘He Hu’ by Duval Timothy and Rosie Lowe, before X-Ray Spex‘s classic ‘Identity’ takes over. The film has been made in tribute to the aforementioned annual prize, which recognises achievement in fashion. Last month saw FKA Twigs being crowned Godlike Genius at the BandLab NME Awards 2022, which took place at Brixton Academy. “I’m really so grateful,” she said while accepting the statue.  Speaking to NME for a Big Read Cover feature upon the announcement of her win, Twigs explained: “I guess what it means is that you’ve made a lot of creative things and people like them. “And maybe it means that, you know, your work has been influential to the industry. But it’s a massive title and I’m really flattered by it.” "
        },
        "https://www.nme.com/news/music/jennifer-grey-says-her-relationship-with-matthew-broderick-inspired-madonnas-express-yourself-3210899": {
            "title": "Jennifer Grey says her relationship with Matthew Broderick inspired Madonna’s ‘Express Yourself’",
            "content": "Jennifer Grey has revealed that her relationship with Matthew Broderick in the late ’80s was the inspiration behind Madonna‘s ‘Express Yourself’. Grey and Broderick started dating in 1986 after meeting on the set of Ferris Bueller’s Day Off. Grey then bagged the role of Baby in Dirty Dancing, catapulting her to new heights of stardom in Hollywood. She and Broderick were engaged to be married, but after about four years together the pair split up and Grey started dating Johnny Depp. Speaking to People magazine, the actor – whose new memoir Out Of The Corner is released May 3 – recalled the time Madonna threw her a 29th birthday party and on the same night shared that her 1989 hit was penned in response to her breakup with Broderick. “She told me she wrote ‘Express Yourself’ about me breaking up with Matthew,” Grey said. “She played it for me in her car. I was in my log cabin with Johnny and she said, ‘Come into my car.’ And I got in her Mercedes where she had a really good sound system and she was like, ‘Listen to this song I just did. It’s about you.'” A portion of the song’s lyrics even makes reference to Grey’s Dirty Dancing character, Baby: “You deserve the best in life/ So if the time isn’t right, then move on/ Second best is never enough/ You’ll do much better, baby, on your own.” Referencing the song’s lyrics, Grey added: “What I’ve learned is that I demanded second best.”  Grey and Madonna were close friends at the time when Grey’s relationship with Depp began, and both women were cast in the 1989 film Bloodhounds Of Broadway. Grey said she reached out to Madonna recently about her relationship being the subject matter of the ‘Express Yourself’. “I wrote her an email where I asked, ‘Did you just tell that to everyone?'” she told People. Last month, Madonna dropped off a second remix of her song ‘Frozen’ with Canadian producer Sickick and Nigerian singer Fireboy DML. Madonna and Sickick first released a remix of the 1998 classic – taken from the queen of pop’s ‘Ray Of Light’ album – last December, which came after it went viral on TikTok.  Meanwhile, Evan Rachel Wood has been cast as Madonna in the forthcoming ‘Weird Al’ Yankovic biopic. Madonna’s 1984 hit ‘Like A Virgin’ became a hit parody for Yankovic in the form of ‘Like A Surgeon’, which the pop star herself praised upon its release. "
        },
        "https://www.nme.com/news/music/mike-shinoda-updates-fans-on-linkin-parks-future-3210894": {
            "title": "Mike Shinoda updates fans on Linkin Park’s future",
            "content": "Mike Shinoda has updated fans on the status of Linkin Park, revealing that he and the rest of the band talk “every few weeks”. The musician, who was recently appointed Community Innovation Advisor of Warner Recorded Music, discussed the future of the band during a Twitch livestream on Friday (April 22). Linkin Park have been on hiatus since the death of frontman Chester Bennington in 2017. “The only Linkin Park news I have for you is that… Yeah, we talk every few weeks – I talk to the guys, or some of the guys,” Shinoda said. “And there’s no tours, there’s no music, there’s no albums in the pipeline. Okay, so let me just tell you that. So just keep in your minds that that is not happening.” “I’m just gonna say that much for now,” he continued. “I say that because anytime the band says anything or does anything, everyone tries to start up the hype train, and we’re, like, ‘No, no, no, no. Don’t start up the hype train.’ You’re gonna disappoint yourself. Don’t do that.” Watch Shinoda talk Linkin Park below: Latest Linkin Park news – the guys are talking every couple of weeks, but there’s no plans for new music or tour, and Rob is “kinda out of his cave” and is doing fine❤️ pic.twitter.com/DeLikchf2H — a.🍍 (@BroodingAnanas) April 22, 2022  Back in 2019, Shinoda shot down reports that Linkin Park were actively looking for a new frontman. Asked if the group would ever look for another singer, Shinoda told Rock Antenne: “That’s not my goal right now. I think it has to happen naturally. And if we find somebody that’s a great person that we think is a good personality fit and a good stylistic fit, then I could see trying to do some stuff with somebody.” He added that the potential line-up change wouldn’t be “for the sake of replacing” Bennington, as he “wouldn’t wanna ever feel like we were replacing Chester”. Soon after, Shinoda took to Twitter to write: “Lemme clarify a rumor: we are not looking for a new singer, and if it were to happen organically, I’d be open. Seems pretty clear, yet I guess some folks have a hard time understanding.” He added: “I’m not into predicting the future. The future will happen.”  Meanwhile, Grey Daze, the band fronted by Chester Bennington before he went on to form Linkin Park, announced their return earlier this month with new album ‘The Phoenix’. "
        },
        "https://www.nme.com/news/music/elton-john-announces-50th-anniversary-reissue-of-madman-across-the-water-3209760": {
            "title": "Elton John announces 50th anniversary reissue of ‘Madman Across The Water’",
            "content": "Elton John has announced a special 50th anniversary reissue of his 1971 album ‘Madman Across The Water’. The singer/songwriter’s fourth studio album, which was recorded at Trident Studios in central London in February and August 1971, featured such songs as ‘Tiny Dancer’, ‘Levon’ and ‘Indian Summer’. ‘Madman Across The Water’ will be reissued on June 10 via UMe to celebrate its recent 50th anniversary, and will be available as a 3xCD and 1xBlu-ray super deluxe box set, as well as in 4xLP, 1xLP limited edition coloured vinyl, and 2xCD formats. Pre-order is available now from here. The reissue features Bob Ludwig’s 2016 remaster of the main album, as well as 18 previously unreleased tracks, rare, restored material from the era, piano demos of the album, and the audio from John’s 1972 BBC Sounds For Saturday concert.  The box set, which is detailed further in the above video, also includes photos, an essay with interviews with those who helped make the album, memorabilia and artwork taken from the Rocket Archive. You can see the tracklist for the super deluxe box set reissue of ‘Madman Across The Water’ below. CD 1 CD 2 CD 3  Elton John recently announced a number of new dates for his farewell North American tour. You can find tickets for his North American dates here, and UK tickets here. "
        },
        "https://www.nme.com/news/music/vinyl-fans-flock-to-uk-record-stops-for-record-store-day-2022-3210839": {
            "title": "Vinyl fans flock to UK record stops for Record Store Day 2022",
            "content": "Vinyl lovers have been flocking to independent record shops across the UK today (April 23) for Record Store Day 2022. As part of RSD’s 15th anniversary, hundreds of exclusive physical releases – including vinyl, CD and cassette – were made available at over 260 participating indie retailers nationwide. Fans can get their hands on special records from the likes of Blur, Taylor Swift, Elvis, U2, Bring Me The Horizon, Sam Fender and Blondie. Many celebrated managing to bag ‘The Lakes’ 7″ by Swift, who is the global ambassador of Record Store Day 2022. “Still can’t believe this happened but I’m so glad to have another addition to my Taylor Swift collection, especially one of my favourite tracks for my first RSD!” one customer wrote on Twitter. Another Swift fan shared a picture of their clear vinyl of ‘The Lakes’, captioning it: “Three hours later and she’s finally mine.” Elsewhere, a third Twitter used said: “SO SO HAPPY !!!!!! I GOT IT!! after waking up at 4am for record store day I now own ‘The Lakes’ on vinyl and it is so beautiful.” You can see those tweets below. Three hours later and she’s finally mine 😻 @taylorswift13 #recordstoreday #RSD22 @taylornation13 pic.twitter.com/5tQcoiyxzi — Jemma 🫶 (@jemmapage) April 23, 2022  still can’t believe this happened but I’m so glad to have another addition to my Taylor Swift collection, especially one of my favourite tracks for my first RSD! Thank you @vinyltaprecords for the great service!@taylorswift13 @taylornation13 #RSD2022 #RecordStoreDay pic.twitter.com/zPK1oQbXsE — z (@uItshixun) April 23, 2022  :)) https://t.co/5jk7ShhSNI — jess 🪩 (@winsinthemovies) April 23, 2022  Vinyl enthusiasts also snapped up Sam Fender’s 7″ record ‘Alright/The Kitchen (Live)’. “Absolute Stunner white pressing,” one fan said of their purchase. Other hauls included Holly Humberstone‘s ‘The Walls Are Way Too Thin’ picture disc, Glass Animals‘ ‘I Don’t Wanna Talk (I Just Wanna Dance)’ 12″, David Bowie‘s ‘Toy’ and ‘Brilliant Adventure’ EPs, and a special pressing of The Cure‘s ‘Pornography’. You can see more reactions and images from Record Store Day UK in the posts below. Record Store Day 7” Vinyl by Sam Fender • Absolute Stunner White Pressing • Thanks @samfendermusic @RSDUK @polydorrecords pic.twitter.com/X2IPVcPmkZ — Tarik (@little_tariko) April 23, 2022  Record store day today !!!! #RSD22 #recordstoreday2022 #samfender #vinyl pic.twitter.com/flNkdAq5uh — Je M'Appelle Nicole (@Nicolam1980) April 23, 2022  Picked up Blur and Alice in Chains records for Record Store Day 🙌🏼 — r💃🏽 (@_Domnomnom) April 23, 2022  in my record store day haul, i also managed to secure the ONLY ‘the walls are way too thin’ picture disc at my store by arriving half an hour before the other person who wanted it 😭💙 i loooove this EP @HolHumberstone pic.twitter.com/VEBVnro7Jg — em HAS A LAKES RSD! 🤍🐇 (@taylorstoebeans) April 23, 2022  Record Store Day success 🎉 @HolHumberstone @samfendermusic @SeaGirls @GlassAnimals pic.twitter.com/yDDFI6m5ih — Lewis Capaldi UK (@LewisCapaldiUK) April 23, 2022  Wife said one of my record store day purchases was “inappropriate”.. not sure what she’s got against The Cure?? #RSD pic.twitter.com/7kbc9gNI2D — Beamer 🇮🇹 (@thisisastory_) April 23, 2022  Up at 6.30am with Jude to drive into Sheffield and queue at @RecordJunkee for Record Store day. Another successful haul between us including a couple I missed on the 2021 drop! #childishgambino #djangodjango #pattismith #suede #glassanimals @RecordStoreDay2022 @BBC6Music pic.twitter.com/e6u6weFjnT — Neil Brownhill (@N_A_Brownhill) April 23, 2022  pls manifest that I can make it from sheffield in time to get this signed @GlassAnimals pic.twitter.com/BAdgbnG7hv — wallace algernon🍍 (@marvelscales) April 23, 2022  Meanwhile, The Rock Box Record Store in Camberley, Surrey said that they saw the “biggest line we’ve ever had” as RSD ’22 customers queued up outside the shop this morning. Crash Records in Leeds shared a video of “early risers” lining up from the early hours while Banquet Records in Kingston, London posted footage of vinyl fans camping outside from 11:30pm last night (April 22). Brighton’s Resident reported “great vibes” as they sold “tons of excellent records [to] lovely music lovers” this lunchtime. You can see those posts below. Thanks to our queuers this morning, biggest line we’ve ever had! #rsd #rsd22 #recordstoreday @RSDUK pic.twitter.com/aLZDvJfzNj — The Rock Box Record Store (@RockBoxRecords) April 23, 2022  The early risers for @RSDUK pic.twitter.com/hHfsgyiiLH — Crash Records (@Crash_Records) April 23, 2022  the @BanquetRSDfeed queue at 11:30. Sweet dreams! pic.twitter.com/Kzb4GFmbVI — Banquet Records (@BanquetRecords) April 22, 2022  #RSD22 (Resident‘s Version) is in full swing! 💫 Tons of excellent records, lovely music lovers, dogs, great vibes, all the good stuff! 🥰 We‘ve powered through the queue and waiting time is no more than an hour now, so come by & grab your @RSDUK exclusives! ✌🏻 pic.twitter.com/QEiyvhU5VI — resident (@residentmusic) April 23, 2022  Upon being appointed the first-ever RSD global ambassador back in January, Taylor Swift said she was “very proud” to take on the role. “The places where we go to browse and explore and discover music new and old have always been sacred to me,” she explained. “Record stores are so important because they help to perpetuate and foster music-loving as a passion. They create settings for live events. They employ people who adore music thoroughly and purely.” Swift went on to acknowledge the “rough few years” that independent record shops have faced as a result of the COVID pandemic, adding: ‘We need to support these small businesses more now than ever to make sure they can stay alive, stay eccentric, and stay individual.” "
        },
        "https://www.nme.com/news/music/arcade-fire-on-peter-gabriel-and-father-john-mistys-involvement-in-we-3210728": {
            "title": "Arcade Fire on Peter Gabriel and Father John Misty’s involvement in ‘WE’",
            "content": "Arcade Fire have spoken about Peter Gabriel and Father John Misty‘s contributions to their upcoming new album, ‘WE’. The Canadian band are due to release their sixth studio effort on May 6 via Columbia Records. It was produced by long-term Radiohead collaborator Nigel Godrich along with the group’s Win Butler and Régine Chassagne. During a recent interview with the Montreal Gazette, it was noted that Gabriel contributed to a dance-orientated album track called ‘Unconditional II (Race and Religion)’ on which Chassagne takes the lead. “[Gabriel] came to the studio and we had a day to work on it,” Butler told the outlet. “He does this thing where he double-tracks his voice, high and low. As soon as he put the high vocal down, I was like, ‘Oh s—, that’s Peter Gabriel’.” In a separate conversation with The New York Times, Butler and Chassagne said it was gratifying to spend time with an artist who had a similar approach to pursuing music. “We feel crazy sometimes,” Butler explained. “It’s nice to meet other people that know what we’re talking about.” Chassagne, meanwhile, said it was “so special” to hear the finished collaboration. Arcade Fire. CREDIT: Michael Marcelle Elsewhere in their chat with the Montreal Gazette, Butler opened up about the experience of him and Chassagne being separated from their bandmates as the couple worked on new material throughout the pandemic. “We didn’t know when or if it would be possible to get the band together. We were very inspired and very plugged in, but the world we were making the record for was changing so much,” Butler remembered. In the NYT’s interview, it was revealed that Joshua Tillman – aka Father John Misty – flew in from Los Angeles to act as an external “sounding board” for Butler and Chassagne early on in the songwriting process. Butler told the Montreal Gazette: “The goal was to write — independent of genre — songs we could play around the piano with guitar, and to just work on structure, melody and the bones of songs as much as we could, because we had time.” Six months later, Butler and Chassagne reunited with the rest of the band and ‘WE’ started to properly come together. “Every night, I would grill food and we would sit around the fire and play songs,” the frontman recalled. “It was a very uncertain but beautiful time.” Peter Gabriel previously covered Arcade Fire’s ‘My Body Is A Cage’, with Butler and co. later returning the favour by recording a rendition of the former Genesis musician’s solo track ‘Games Without Frontiers’. Back in 2015, Father John Misty put his own spin on Arcade Fire’s 2010 song ‘The Suburbs’ from their Grammy-winning third album of the same name.  Arcade Fire have previewed ‘WE’ with the double lead single ‘The Lightning I, II’ and are expected to release ‘Unconditional I (Lookout Kid)’ soon. The band played the forthcoming track during their surprise Coachella set last weekend. The group will make their return to the UK next Friday (April 29) to play an intimate concert at London’s KOKO to mark the long-awaited reopening of the venue. Tickets are now sold out. "
        },
        "https://www.nme.com/news/music/coachella-2022-harry-styles-covers-one-direction-with-lizzo-3210753": {
            "title": "Coachella 2022: Harry Styles covers One Direction with Lizzo",
            "content": "Harry Styles brought out Lizzo as a special guest during his set at Coachella 2022 last night (April 22). Check out the footage below. The former One Direction star returned to the California festival’s second consecutive weekend to deliver another headline performance after making his debut appearance on April 15. Towards the end of his main set, Styles surprised the crowd by welcoming Lizzo to the stage to cover Gloria Gaynor’s 1978 disco anthem ‘I Will Survive’. The pair strutted down the runway in flamboyant matching coats, belting out the tune as they went. Styles and Lizzo then sang a joint rendition of 1D’s 2011 hit single ‘What Makes You Beautiful’. Lizzo had teased her appearance earlier in the day by sharing a video on TikTok of herself travelling to the festival. “I’m bored otw to Coachella,” she captioned the clip. harry styles bringing out lizzo THIS DUO IS ICONIC #harrychella pic.twitter.com/PZVHTBc3Vh — elizabeth ♡ (@xelizabethmxx) April 23, 2022  harry styles and lizzo singing i will survive by gloria gaynor in 2022 while wearing a pink fur is a cultural reset#Coachella  #HARRYCHELLApic.twitter.com/e2httBJ76y — Gio is a sunflower 🌻 (@harrehsdimpless) April 23, 2022  Lizzo and Harry Styles perform One Direction's hit single 'What Makes You Beautiful' during his headlining set at weekend two of #Coachella pic.twitter.com/Vo2rRzmhco — Bops And Bangers (@bopsandbangers) April 23, 2022  Styles and Lizzo have covered each other’s music previously, with the former taking on ‘Juice’ and the latter then recording a new version of ‘Adore You’ for BBC Radio 1’s Live Lounge. Back in 2020, the two artists gave ‘Juice’ a collaborative spin while onstage together in Miami, Florida. During his first Coachella headline set, Harry Styles brought out Shania Twain to perform her hits ‘Man! I Feel Like a Woman!’ and ‘You’re Still The One’. He also debuted his recent single ‘As It Was’ as well as two new tracks: ‘Boyfriends’ and ‘Late Night Talking’. It was subsequently reported that the pop star’s Coachella crowd had surpassed a huge 100,000 people.  In a four-star review of Styles’ weekend one show, NME wrote: “[…] It’s clear that he’s no longer aiming for the rock star lane, but is firmly blazing his own path through it.” Check back at NME all weekend for more reviews, news, interviews, photos and more from Coachella 2022.  "
        },
        "https://www.nme.com/news/music/tom-grennan-updates-fans-following-attack-in-new-york-the-show-must-go-on-3210716": {
            "title": "Tom Grennan updates fans following attack in New York: “The show must go on”",
            "content": "Tom Grennan has shared an update after being attacked in New York, while thanking fans for their “incredible” support. The singer-songwriter was hospitalised following an “unprovoked attack and robbery” outside a bar in Manhattan after playing a headline show in New York City. As a result, he was forced to postpone his scheduled performance in Washington, D.C. yesterday (April 22). In a statement, his management wrote: “Tom is currently in hospital being assessed by doctors for his injuries which include a ruptured ear, torn eardrum and issue with his previously fractured jaw.” The message went on to say that Grennan was “in good spirits but needs to temporarily recuperate whilst doctors assess his ability to continue with touring”. With Grennan’s North American tour due to resume in Boston, Massachusetts this evening (April 23), the singer has posted a video message on social media in which he spoke about the incident and his ongoing recovery. “I thought I’d come on here and let you know that I’m all good,” Grennan said. “The support that I’ve been seeing is unbelievable and very overwhelming, and I can’t believe it. So thank you so much. “The [last] 24 hours has been crazy; it’s been madness, to be honest with you. But I thought I’d come on here and let you know what actually went on. It was just wrong place, wrong time.” A message from Tom 💚❤️ pic.twitter.com/GAnsBLNvQW — Tom Grennan (@Tom_Grennan) April 22, 2022  Grennan continued: “I was punched, knocked out and I woke up and was like, ‘Whoa, what went on?'” The musician went on to confirm that he has a ruptured eardrum, “a bit of concussion” and is currently on medication. “Luckily enough, my jaw’s fine,” he said. Grennan has since filed a police report, saying that the NYPD were “brilliant”. As for his next gig, Grennan explained that his fans are his “main priority” and said he doesn’t want to cancel the tour: “The show must go on, and I’m gonna do all that I can to get to Boston.” He added: “But thank you so much. It’s been incredible to see how much people show love and support. I’m all good, I promise you. It’s gonna take a couple of weeks – hopefully – for the ear to be on the mend, but we’ll see. We’ve just got to keep the show running.” You can watch the video message in the tweet above.  Tom Grennan is out on tour in support of his second album ‘Evering Road’, which came out in March 2021. The record went to Number One in the UK, shifting over 17,000 chart sales in its first week. Last month, Grennan shared a soaring new single called ‘Remind Me’. "
        },
        "https://www.nme.com/news/music/sergio-vega-on-why-he-left-deftones-it-was-never-about-money-it-was-about-a-sense-of-belonging-3210713": {
            "title": "Sergio Vega on why he left Deftones: “It was never about money, it was about a sense of belonging”",
            "content": "Sergio Vega has opened up about his recent departure from Deftones, saying he left the Californian alt-metal outfit back in March because it didn’t offer him “a sense of belonging”. Vega first performed with Deftones in 1999, filling in for bassist Chi Chang on a tour preceding their ‘White Pony’ release. After a serious car accident forced Chang to leave the band in 2008, Vega was brought as his full-time replacement. He appeared on the last four of Deftones’ studio albums, starting with 2010’s ‘Diamond Eyes’ and most recently, 2020’s ‘Ohms’.  But in a new interview with the Talk Toomey podcast (transcribed by The PRP), Vega alleged that he was never formally made an official member of the band. He explained: “Over the years, it started to become like ‘Hey I would really like to belong to this,’ and whenever it would come up, it was really more like they were good with the status quo.” The bassist – who also performs in Quicksand, and has a solo project of his own – went on to say that his exit from Deftones was “not financial”, noting that although the band wouldn’t agree to include Vega in their formal business dealings, they did offer him a raise.  He continued: “It was never about money, it was about a sense of belonging. So that was really it. And ultimately, in parting ways, it was not a function of me trying to renegotiate during the pandemic. It was a function of the contract being cancelled. And me having a little conversation with Chino [Moreno, vocals/rhythm guitar], and then another conversation with a couple of the guys saying ‘hey’ when they wanted to reinstate [the contract]. “I was like, ‘I think the path forward is that we can all be in the same boat. Now would be the time to get off this type of structure. Because it’s not really working for anybody, especially now when we’re not touring, we’re not doing anything. And it doesn’t make sense to have this type of structure, it’s been twelve years at this point and let’s make good on that. I just can’t go onto the salary thing because it’s not working for us’. And that was it.” Expounding on his experience of feeling like an outsider in the group, Vega said: “It’s the security and stability of feeling like you’re a part of something that you’re investing in, and belonging. To me the keyword is this feeling that you belong. Something that you’re pouring yourself into. Now, had it been from the get go, ‘This is the vibe, this it the help that we need,’ then that’s cool…  “But at the end of the day, I guess the perception of it encroaching on anyone’s income could have been the thing that allowed it to not come together.” In addition to his continued activity in Quicksand – who released their fourth album, ‘Distant Populations’, last August’ – Vega is currently working on a series of elusive new endeavours, including “a single-based project” with Spotlights drummer Chris Enriquez.   Detailing the unique way that project operates, Vega explained: “[We] get with a singer, [we] talk a little bit about a vibe, and we write a song together. And that’s it. We write and record the song, we give it a little digital component… It was kind of inspired by an Argentine hip-hop producer, who has this series of songs that he does with a lot of artists.  “[It’s] mostly rappers and some singers – [he] does a song, records it, that’s it. It’s a series. And the idea of building that as a modality in this kind of music was really, really exciting.  You don’t have the thing of trying to build the band. You don’t have to deal with the time conflicts with the people you may want to work with, it opens up a lot.  “So currently we have a song done. We have [another] one almost done. And then last week we started working on a track with [former Every Time I Die frontman] Keith Buckley. It’s super exciting because we got on the phone and we just talked about life. He, Chris and I had a quick FaceTime. We hadn’t met each other, [but] obviously [we’re] well aware of each other. And we really, really hit it off. So it’s a rare time that I feel compelled to mention the person because of the situation.” Earlier this month, Deftones unveiled their new touring line-up, with former Marilyn Manson bassist Fred Sablan taking Vega’s old role. "
        }
    }
}